VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031.h
      struct
      {
        __IOM uint32_t EN : 1;       /*!< [0..0] desc EN                                                            */
        __IOM uint32_t MD : 2;       /*!< [2..1] desc MD                                                            */
        __IOM uint32_t TRS : 1;      /*!< [3..3] desc TRS                                                           */
        __IOM uint32_t POLARITY : 1; /*!< [4..4] desc POLARITY                                                      */
        __IOM uint32_t ONESHOT : 1;  /*!< [5..5] desc ONESHOT                                                       */
        __IOM uint32_t TOGEN : 1;    /*!< [6..6] desc TOGEN                                                         */
        __IOM uint32_t PRS : 4;      /*!< [10..7] desc PRS                                                          */
        __IM uint32_t PRSSTATUS : 4; /*!< [14..11] desc PRSSTATUS                                                   */
        __IM uint32_t : 17;
      } BCR_f;
    };

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x00000014) desc IER                                                   */

      struct
      {
        __IOM uint32_t OV : 1;  /*!< [0..0] desc OV                                                            */
        __IOM uint32_t TI : 1;  /*!< [1..1] desc TI                                                            */
        __IOM uint32_t TOP : 1; /*!< [2..2] desc TOP                                                           */
        __IM uint32_t : 29;
      } IER_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x00000018) desc ISR                                                   */

      struct
      {
        __IM uint32_t OV : 1;  /*!< [0..0] desc OV                                                            */
        __IM uint32_t TI : 1;  /*!< [1..1] desc TI                                                            */
        __IM uint32_t TOP : 1; /*!< [2..2] desc TOP                                                           */
        __IM uint32_t : 29;
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x0000001C) desc ICR                                                   */

      struct
      {
        __IOM uint32_t OV : 1;  /*!< [0..0] desc OV                                                            */
        __IOM uint32_t TI : 1;  /*!< [1..1] desc TI                                                            */
        __IOM uint32_t TOP : 1; /*!< [2..2] desc TOP                                                           */
        __IM uint32_t : 29;
      } ICR_f;
    };

    union
    {
      __IOM uint32_t DMA; /*!< (@ 0x00000020) desc DMA                                                   */

      struct
      {
        __IOM uint32_t OV : 1;  /*!< [0..0] desc OV                                                            */
        __IOM uint32_t TRS : 1; /*!< [1..1] desc TRS                                                           */
        __IM uint32_t : 30;
      } DMA_f;
    };

    union
    {
      __IOM uint32_t PSC; /*!< (@ 0x00000024) desc PSC                                                   */

      struct
      {
        __IOM uint32_t PSC : 16; /*!< [15..0] desc PSC                                                          */
        __IM uint32_t : 16;
      } PSC_f;
    };
  } BTIM_TypeDef; /*!< Size = 40 (0x28)                                                          */

  /* =========================================================================================================================== */
  /* ================                                            CRC                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc CRC (CRC)
   */

  typedef struct
  { /*!< (@ 0x40023000) CRC Structure                                              */

    union
    {
      __IOM uint32_t CR; /*!< (@ 0x00000000) desc CR                                                    */

      struct
      {
        __IOM uint32_t MODE : 4; /*!< [3..0] desc MODE                                                          */
        __IM uint32_t : 28;
      } CR_f;
    };
    __IM uint32_t RESERVED;

    union
    {
      __IOM uint32_t DR; /*!< (@ 0x00000008) desc DR                                                    */

      struct
      {
        __IOM uint32_t DR : 8; /*!< [7..0] desc DR                                                            */
        __IM uint32_t : 24;
      } DR_f;
    };

    union
    {
      __IM uint32_t RESULT; /*!< (@ 0x0000000C) desc RESULT                                                */

      struct
      {
        __IM uint32_t RESULT : 16; /*!< [15..0] desc RESULT                                                       */
        __IM uint32_t : 16;
      } RESULT_f;
    };
  } CRC_TypeDef; /*!< Size = 20 (0x14)                                                          */

  /* =========================================================================================================================== */
  /* ================                                            DMA                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc DMA (DMA)
   */

  typedef struct
  { /*!< (@ 0x40020000) DMA Structure                                              */

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x00000000) Interrupt status register                                  */

      struct
      {
        __IM uint32_t TC1 : 1; /*!< [0..0] desc TC1                                                           */
        __IM uint32_t TE1 : 1; /*!< [1..1] desc TE1                                                           */
        __IM uint32_t : 2;
        __IM uint32_t TC2 : 1; /*!< [4..4] desc TC2                                                           */
        __IM uint32_t TE2 : 1; /*!< [5..5] desc TE2                                                           */
        __IM uint32_t : 2;
        __IM uint32_t TC3 : 1; /*!< [8..8] desc TC3                                                           */
        __IM uint32_t TE3 : 1; /*!< [9..9] desc TE3                                                           */
        __IM uint32_t : 2;
        __IM uint32_t TC4 : 1; /*!< [12..12] desc TC4                                                         */
        __IM uint32_t TE4 : 1; /*!< [13..13] desc TE4                                                         */
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000004) Interrupt flag clear register                              */

      struct
      {
        __IOM uint32_t TC1 : 1; /*!< [0..0] desc TC1                                                           */
        __IOM uint32_t TE1 : 1; /*!< [1..1] desc TE1                                                           */
        __IM uint32_t : 2;
        __IOM uint32_t TC2 : 1; /*!< [4..4] desc TC2                                                           */
        __IOM uint32_t TE2 : 1; /*!< [5..5] desc TE2                                                           */
        __IM uint32_t : 2;
        __IOM uint32_t TC3 : 1; /*!< [8..8] desc TC3                                                           */
        __IOM uint32_t TE3 : 1; /*!< [9..9] desc TE3                                                           */
        __IM uint32_t : 2;
        __IOM uint32_t TC4 : 1; /*!< [12..12] desc TC4                                                         */
        __IOM uint32_t TE4 : 1; /*!< [13..13] desc TE4                                                         */
      } ICR_f;
    };
    __IM uint32_t RESERVED[6];

    union
    {
      __IOM uint32_t CSR1; /*!< (@ 0x00000020) Channel1 control and status register                       */

      struct
      {
        __IOM uint32_t EN : 1;     /*!< [0..0] desc EN                                                            */
        __IOM uint32_t TCIE : 1;   /*!< [1..1] desc TCIE                                                          */
        __IOM uint32_t TEIE : 1;   /*!< [2..2] desc TEIE                                                          */
        __IOM uint32_t TRANS : 1;  /*!< [3..3] desc TRANS                                                         */
        __IOM uint32_t SRCINC : 1; /*!< [4..4] desc SRCINC                                                        */
        __IOM uint32_t DSTINC : 1; /*!< [5..5] desc DSTINC                                                        */
        __IOM uint32_t SIZE : 2;   /*!< [7..6] desc SIZE                                                          */
        __IM uint32_t STATUS : 3;  /*!< [10..8] desc STATUS                                                       */
        __IM uint32_t : 21;
      } CSR1_f;
    };

    union
    {
      __IOM uint32_t CNT1; /*!< (@ 0x00000024) Channel1 counter register                                  */

      struct
      {
        __IOM uint32_t CNT : 16;   /*!< [15..0] desc CNT                                                          */
        __IOM uint32_t REPEAT : 4; /*!< [19..16] desc REPEAT                                                      */
        __IM uint32_t : 12;
      } CNT1_f;
    };

    union
    {
      __IOM uint32_t SRCADDR1; /*!< (@ 0x00000028) Channel1 source address register                           */

      struct
      {
        __IOM uint32_t SRCADDR : 32; /*!< [31..0] desc SRCADDR                                                      */
      } SRCADDR1_f;
    };

    union
    {
      __IOM uint32_t DSTADDR1; /*!< (@ 0x0000002C) Channel1 destination address register                      */

      struct
      {
        __IOM uint32_t DSTADDR : 32; /*!< [31..0] desc DSTADDR                                                      */
      } DSTADDR1_f;
    };

    union
    {
      __IOM uint32_t TRIG1; /*!< (@ 0x00000030) Channel1 trigger register                                  */

      struct
      {
        __IOM uint32_t TYPE : 1;    /*!< [0..0] desc TYPE                                                          */
        __IOM uint32_t SOFTSRC : 1; /*!< [1..1] desc SOFTSRC                                                       */
        __IOM uint32_t HARDSRC : 6; /*!< [7..2] desc HARDSRC                                                       */
        __IM uint32_t : 24;
      } TRIG1_f;
    };
    __IM uint32_t RESERVED1[3];

    union
    {
      __IOM uint32_t CSR2; /*!< (@ 0x00000040) Channel2 control and status register                       */

      struct
      {
        __IOM uint32_t EN : 1;     /*!< [0..0] desc EN                                                            */
        __IOM uint32_t TCIE : 1;   /*!< [1..1] desc TCIE                                                          */
        __IOM uint32_t TEIE : 1;   /*!< [2..2] desc TEIE                                                          */
        __IOM uint32_t TRANS : 1;  /*!< [3..3] desc TRANS                                                         */
        __IOM uint32_t SRCINC : 1; /*!< [4..4] desc SRCINC                                                        */
        __IOM uint32_t DSTINC : 1; /*!< [5..5] desc DSTINC                                                        */
        __IOM uint32_t SIZE : 2;   /*!< [7..6] desc SIZE                                                          */
        __IM uint32_t STATUS : 3;  /*!< [10..8] desc STATUS                                                       */
        __IM uint32_t : 21;
      } CSR2_f;
    };

    union
    {
      __IOM uint32_t CNT2; /*!< (@ 0x00000044) Channel2 counter register                                  */

      struct
      {
        __IOM uint32_t CNT : 16;   /*!< [15..0] desc CNT                                                          */
        __IOM uint32_t REPEAT : 4; /*!< [19..16] desc REPEAT                                                      */
        __IM uint32_t : 12;
      } CNT2_f;
    };

    union
    {
      __IOM uint32_t SRCADDR2; /*!< (@ 0x00000048) Channel2 source address register                           */

      struct
      {
        __IOM uint32_t SRCADDR : 32; /*!< [31..0] desc SRCADDR                                                      */
      } SRCADDR2_f;
    };

    union
    {
      __IOM uint32_t DSTADDR2; /*!< (@ 0x0000004C) Channel2 destination address register                      */

      struct
      {
        __IOM uint32_t DSTADDR : 32; /*!< [31..0] desc DSTADDR                                                      */
      } DSTADDR2_f;
    };

    union
    {
      __IOM uint32_t TRIG2; /*!< (@ 0x00000050) Channel2 trigger register                                  */

      struct
      {
        __IOM uint32_t TYPE : 1;    /*!< [0..0] desc TYPE                                                          */
        __IOM uint32_t SOFTSRC : 1; /*!< [1..1] desc SOFTSRC                                                       */
        __IOM uint32_t HARDSRC : 6; /*!< [7..2] desc HARDSRC                                                       */
        __IM uint32_t : 24;
      } TRIG2_f;
    };
    __IM uint32_t RESERVED2[3];

    union
    {
      __IOM uint32_t CSR3; /*!< (@ 0x00000060) Channel3 control and status register                       */

      struct
      {
        __IOM uint32_t EN : 1;     /*!< [0..0] desc EN                                                            */
        __IOM uint32_t TCIE : 1;   /*!< [1..1] desc TCIE                                                          */
        __IOM uint32_t TEIE : 1;   /*!< [2..2] desc TEIE                                                          */
        __IOM uint32_t TRANS : 1;  /*!< [3..3] desc TRANS                                                         */
        __IOM uint32_t SRCINC : 1; /*!< [4..4] desc SRCINC                                                        */
        __IOM uint32_t DSTINC : 1; /*!< [5..5] desc DSTINC                                                        */
        __IOM uint32_t SIZE : 2;   /*!< [7..6] desc SIZE                                                          */
        __IM uint32_t STATUS : 3;  /*!< [10..8] desc STATUS                                                       */
        __IM uint32_t : 21;
      } CSR3_f;
    };

    union
    {
      __IOM uint32_t CNT3; /*!< (@ 0x00000064) Channel3 counter register                                  */

      struct
      {
        __IOM uint32_t CNT : 16;   /*!< [15..0] desc CNT                                                          */
        __IOM uint32_t REPEAT : 4; /*!< [19..16] desc REPEAT                                                      */
        __IM uint32_t : 12;
      } CNT3_f;
    };

    union
    {
      __IOM uint32_t SRCADDR3; /*!< (@ 0x00000068) Channel3 source address register                           */

      struct
      {
        __IOM uint32_t SRCADDR : 32; /*!< [31..0] desc SRCADDR                                                      */
      } SRCADDR3_f;
    };

    union
    {
      __IOM uint32_t DSTADDR3; /*!< (@ 0x0000006C) Channel3 destination address register                      */

      struct
      {
        __IOM uint32_t DSTADDR : 32; /*!< [31..0] desc DSTADDR                                                      */
      } DSTADDR3_f;
    };

    union
    {
      __IOM uint32_t TRIG3; /*!< (@ 0x00000070) Channel3 trigger register                                  */

      struct
      {
        __IOM uint32_t TYPE : 1;    /*!< [0..0] desc TYPE                                                          */
        __IOM uint32_t SOFTSRC : 1; /*!< [1..1] desc SOFTSRC                                                       */
        __IOM uint32_t HARDSRC : 6; /*!< [7..2] desc HARDSRC                                                       */
        __IM uint32_t : 24;
      } TRIG3_f;
    };
    __IM uint32_t RESERVED3[3];

    union
    {
      __IOM uint32_t CSR4; /*!< (@ 0x00000080) Channel4 control and status register                       */

      struct
      {
        __IOM uint32_t EN : 1;     /*!< [0..0] desc EN                                                            */
        __IOM uint32_t TCIE : 1;   /*!< [1..1] desc TCIE                                                          */
        __IOM uint32_t TEIE : 1;   /*!< [2..2] desc TEIE                                                          */
        __IOM uint32_t TRANS : 1;  /*!< [3..3] desc TRANS                                                         */
        __IOM uint32_t SRCINC : 1; /*!< [4..4] desc SRCINC                                                        */
        __IOM uint32_t DSTINC : 1; /*!< [5..5] desc DSTINC                                                        */
        __IOM uint32_t SIZE : 2;   /*!< [7..6] desc SIZE                                                          */
        __IM uint32_t STATUS : 3;  /*!< [10..8] desc STATUS                                                       */
        __IM uint32_t : 21;
      } CSR4_f;
    };

    union
    {
      __IOM uint32_t CNT4; /*!< (@ 0x00000084) Channel4 counter register                                  */

      struct
      {
        __IOM uint32_t CNT : 16;   /*!< [15..0] desc CNT                                                          */
        __IOM uint32_t REPEAT : 4; /*!< [19..16] desc REPEAT                                                      */
        __IM uint32_t : 12;
      } CNT4_f;
    };

    union
    {
      __IOM uint32_t SRCADDR4; /*!< (@ 0x00000088) Channel4 source address register                           */

      struct
      {
        __IOM uint32_t SRCADDR : 32; /*!< [31..0] desc SRCADDR                                                      */
      } SRCADDR4_f;
    };

    union
    {
      __IOM uint32_t DSTADDR4; /*!< (@ 0x0000008C) Channel4 destination address register                      */

      struct
      {
        __IOM uint32_t DSTADDR : 32; /*!< [31..0] desc DSTADDR                                                      */
      } DSTADDR4_f;
    };

    union
    {
      __IOM uint32_t TRIG4; /*!< (@ 0x00000090) Channel4 trigger register                                  */

      struct
      {
        __IOM uint32_t TYPE : 1;    /*!< [0..0] desc TYPE                                                          */
        __IOM uint32_t SOFTSRC : 1; /*!< [1..1] desc SOFTSRC                                                       */
        __IOM uint32_t HARDSRC : 6; /*!< [7..2] desc HARDSRC                                                       */
        __IM uint32_t : 24;
      } TRIG4_f;
    };
  } DMA_TypeDef; /*!< Size = 148 (0x94)                                                         */

  /* =========================================================================================================================== */
  /* ================                                        DMACHANNEL1                                        ================ */
  /* =========================================================================================================================== */

  /**
   * @brief DMA Channel 1 (DMACHANNEL1)
   */

  typedef struct
  { /*!< (@ 0x40020020) DMACHANNEL1 Structure                                      */

    union
    {
      __IOM uint32_t CSR; /*!< (@ 0x00000000) Channel.y control and status register                      */

      struct
      {
        __IOM uint32_t EN : 1;     /*!< [0..0] desc EN                                                            */
        __IOM uint32_t TCIE : 1;   /*!< [1..1] desc TCIE                                                          */
        __IOM uint32_t TEIE : 1;   /*!< [2..2] desc TEIE                                                          */
        __IOM uint32_t TRANS : 1;  /*!< [3..3] desc TRANS                                                         */
        __IOM uint32_t SRCINC : 1; /*!< [4..4] desc SRCINC                                                        */
        __IOM uint32_t DSTINC : 1; /*!< [5..5] desc DSTINC                                                        */
        __IOM uint32_t SIZE : 2;   /*!< [7..6] desc SIZE                                                          */
        __IM uint32_t STATUS : 3;  /*!< [10..8] desc STATUS                                                       */
        __IM uint32_t : 21;
      } CSR_f;
    };

    union
    {
      __IOM uint32_t CNT; /*!< (@ 0x00000004) Channel.y counter register                                 */

      struct
      {
        __IOM uint32_t CNT : 16;   /*!< [15..0] desc CNT                                                          */
        __IOM uint32_t REPEAT : 4; /*!< [19..16] desc REPEAT                                                      */
        __IM uint32_t : 12;
      } CNT_f;
    };

    union
    {
      __IOM uint32_t SRCADDR; /*!< (@ 0x00000008) Channel.y source address register                          */

      struct
      {
        __IOM uint32_t SRCADDR : 32; /*!< [31..0] desc SRCADDR                                                      */
      } SRCADDR_f;
    };

    union
    {
      __IOM uint32_t DSTADDR; /*!< (@ 0x0000000C) Channel.y destination address register                     */

      struct
      {
        __IOM uint32_t DSTADDR : 32; /*!< [31..0] desc DSTADDR                                                      */
      } DSTADDR_f;
    };

    union
    {
      __IOM uint32_t TRIG; /*!< (@ 0x00000010) Channel.y trigger register                                 */

      struct
      {
        __IOM uint32_t TYPE : 1;    /*!< [0..0] desc TYPE                                                          */
        __IOM uint32_t SOFTSRC : 1; /*!< [1..1] desc SOFTSRC                                                       */
        __IOM uint32_t HARDSRC : 6; /*!< [7..2] desc HARDSRC                                                       */
        __IM uint32_t : 24;
      } TRIG_f;
    };
  } DMACHANNEL_TypeDef; /*!< Size = 20 (0x14)                                                          */

  /* =========================================================================================================================== */
  /* ================                                           FLASH                                           ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc FLASH (FLASH)
   */

  typedef struct
  { /*!< (@ 0x40022000) FLASH Structure                                            */

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000000) desc CR1                                                   */

      struct
      {
        __IOM uint32_t MODE : 2; /*!< [1..0] desc MODE                                                          */
        __IM uint32_t : 2;
        __IOM uint32_t STANDBY : 1; /*!< [4..4] desc STANDBY                                                       */
        __IM uint32_t BUSY : 1;     /*!< [5..5] desc BUSY                                                          */
        __IM uint32_t SECURITY : 2; /*!< [7..6] desc SECURITY                                                      */
        __IM uint32_t : 8;
        __OM uint32_t KEY : 16; /*!< [31..16] desc KEY                                                         */
      } CR1_f;
    };

    union
    {
      __IOM uint32_t CR2; /*!< (@ 0x00000004) desc CR2                                                   */

