VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031.h
      struct
      {
        __IOM uint32_t WAIT : 3; /*!< [2..0] desc WAIT                                                          */
        __IM uint32_t : 13;
        __OM uint32_t KEY : 16; /*!< [31..16] desc KEY                                                         */
      } CR2_f;
    };

    union
    {
      __IOM uint32_t PAGELOCK1; /*!< (@ 0x00000008) Page Write Erase Lock                                      */

      struct
      {
        __IOM uint32_t LOCK0 : 1;  /*!< [0..0] Page0 - 7                                                          */
        __IOM uint32_t LOCK1 : 1;  /*!< [1..1] Page8 - 15                                                         */
        __IOM uint32_t LOCK2 : 1;  /*!< [2..2] Page16 - 23                                                        */
        __IOM uint32_t LOCK3 : 1;  /*!< [3..3] Page24 - 31                                                        */
        __IOM uint32_t LOCK4 : 1;  /*!< [4..4] Page32 - 39                                                        */
        __IOM uint32_t LOCK5 : 1;  /*!< [5..5] Page40 - 47                                                        */
        __IOM uint32_t LOCK6 : 1;  /*!< [6..6] Page48 - 55                                                        */
        __IOM uint32_t LOCK7 : 1;  /*!< [7..7] Page56 - 63                                                        */
        __IOM uint32_t LOCK8 : 1;  /*!< [8..8] Page64 - 71                                                        */
        __IOM uint32_t LOCK9 : 1;  /*!< [9..9] Page72 - 79                                                        */
        __IOM uint32_t LOCK10 : 1; /*!< [10..10] Page80 - 87                                                      */
        __IOM uint32_t LOCK11 : 1; /*!< [11..11] Page88 - 95                                                      */
        __IOM uint32_t LOCK12 : 1; /*!< [12..12] Page96 - 103                                                     */
        __IOM uint32_t LOCK13 : 1; /*!< [13..13] Page104 - 111                                                    */
        __IOM uint32_t LOCK14 : 1; /*!< [14..14] Page112 - 119                                                    */
        __IOM uint32_t LOCK15 : 1; /*!< [15..15] Page120 - 127                                                    */
        __OM uint32_t KEY : 16;    /*!< [31..16] desc KEY                                                         */
      } PAGELOCK_f;
    };
    __IM uint32_t RESERVED[5];

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x00000020) desc IER                                                   */

      struct
      {
        __IOM uint32_t PC : 1;       /*!< [0..0] desc PC                                                            */
        __IOM uint32_t PAGELOCK : 1; /*!< [1..1] desc PAGELOCK                                                      */
        __IM uint32_t : 2;
        __IOM uint32_t PROG : 1; /*!< [4..4] desc PROG                                                          */
        __IM uint32_t : 27;
      } IER_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x00000024) desc ISR                                                   */

      struct
      {
        __IM uint32_t PC : 1;       /*!< [0..0] desc PC                                                            */
        __IM uint32_t PAGELOCK : 1; /*!< [1..1] desc PAGELOCK                                                      */
        __IM uint32_t : 2;
        __IM uint32_t PROG : 1; /*!< [4..4] desc PROG                                                          */
        __IM uint32_t : 27;
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000028) desc ICR                                                   */

      struct
      {
        __IOM uint32_t PC : 1;       /*!< [0..0] desc PC                                                            */
        __IOM uint32_t PAGELOCK : 1; /*!< [1..1] desc PAGELOCK                                                      */
        __IM uint32_t : 2;
        __IOM uint32_t PROG : 1; /*!< [4..4] desc PROG                                                          */
        __IM uint32_t : 27;
      } ICR_f;
    };
  } FLASH_TypeDef; /*!< Size = 104 (0x68)                                                         */

  /* =========================================================================================================================== */
  /* ================                                           GPIOA                                           ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc GPIOA (GPIOA)
   */

  typedef struct
  { /*!< (@ 0x48000000) GPIOA Structure                                            */

    union
    {
      __IOM uint32_t DIR; /*!< (@ 0x00000000) desc DIR                                                   */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
        __IM uint32_t : 16;
      } DIR_f;
    };

    union
    {
      __IOM uint32_t OPENDRAIN; /*!< (@ 0x00000004) desc OPENDRAIN                                             */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
        __IM uint32_t : 16;
      } OPENDRAIN_f;
    };
    __IM uint32_t RESERVED;

    union
    {
      __IOM uint32_t PDR; /*!< (@ 0x0000000C) desc PDR                                                   */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
        __IM uint32_t : 16;
      } PDR_f;
    };

    union
    {
      __IOM uint32_t PUR; /*!< (@ 0x00000010) desc PUR                                                   */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
        __IM uint32_t : 16;
      } PUR_f;
    };

    union
    {
      __IOM uint32_t AFRH; /*!< (@ 0x00000014) desc AFRH                                                  */

      struct
      {
        __IOM uint32_t AFR8 : 4;  /*!< [3..0] desc AFR8                                                          */
        __IOM uint32_t AFR9 : 4;  /*!< [7..4] desc AFR9                                                          */
        __IOM uint32_t AFR10 : 4; /*!< [11..8] desc AFR10                                                        */
        __IOM uint32_t AFR11 : 4; /*!< [15..12] desc AFR11                                                       */
        __IOM uint32_t AFR12 : 4; /*!< [19..16] desc AFR12                                                       */
        __IOM uint32_t AFR13 : 4; /*!< [23..20] desc AFR13                                                       */
        __IOM uint32_t AFR14 : 4; /*!< [27..24] desc AFR14                                                       */
        __IOM uint32_t AFR15 : 4; /*!< [31..28] desc AFR15                                                       */
      } AFRH_f;
    };

    union
    {
      __IOM uint32_t AFRL; /*!< (@ 0x00000018) desc AFRL                                                  */

      struct
      {
        __IOM uint32_t AFR0 : 4; /*!< [3..0] desc AFR0                                                          */
        __IOM uint32_t AFR1 : 4; /*!< [7..4] desc AFR1                                                          */
        __IOM uint32_t AFR2 : 4; /*!< [11..8] desc AFR2                                                         */
        __IOM uint32_t AFR3 : 4; /*!< [15..12] desc AFR3                                                        */
        __IOM uint32_t AFR4 : 4; /*!< [19..16] desc AFR4                                                        */
        __IOM uint32_t AFR5 : 4; /*!< [23..20] desc AFR5                                                        */
        __IOM uint32_t AFR6 : 4; /*!< [27..24] desc AFR6                                                        */
        __IOM uint32_t AFR7 : 4; /*!< [31..28] desc AFR7                                                        */
      } AFRL_f;
    };

    union
    {
      __IOM uint32_t ANALOG; /*!< (@ 0x0000001C) desc ANALOG                                                */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
        __IM uint32_t : 16;
      } ANALOG_f;
    };
    __IM uint32_t RESERVED1;

    union
    {
      __IOM uint32_t RISEIE; /*!< (@ 0x00000024) Interrupt enable register                                  */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
        __IM uint32_t : 16;
      } RISEIE_f;
    };

    union
    {
      __IOM uint32_t FALLIE; /*!< (@ 0x00000028) Interrupt enable register                                  */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
        __IM uint32_t : 16;
      } FALLIE_f;
    };
    __IM uint32_t RESERVED2[2];

    union
    {
      __IOM uint32_t ISR; /*!< (@ 0x00000034) Interrupt status register                                  */

      struct
      {
        __IM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
        __IM uint32_t : 16;
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000038) Interrupt flag clear register                              */

