VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031.h
      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
        __IM uint32_t : 16;
      } ICR_f;
    };
    __IM uint32_t RESERVED3;

    union
    {
      __IOM uint32_t FILTER; /*!< (@ 0x00000040) desc FILTER                                                */

      struct
      {
        __IOM uint32_t PIN0 : 1;   /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;   /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;   /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;   /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;   /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;   /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;   /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;   /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;   /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;   /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1;  /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1;  /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1;  /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1;  /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1;  /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1;  /*!< [15..15] desc PIN15                                                       */
        __IOM uint32_t FLTCLK : 3; /*!< [18..16] desc FLTCLK                                                      */
        __IM uint32_t : 13;
      } FILTER_f;
    };
    __IM uint32_t RESERVED4[3];

    union
    {
      __IM uint32_t IDR; /*!< (@ 0x00000050) desc IDR                                                   */

      struct
      {
        __IM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
        __IM uint32_t : 16;
      } IDR_f;
    };

    union
    {
      __IOM uint32_t ODR; /*!< (@ 0x00000054) desc ODR                                                   */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
        __IM uint32_t : 16;
      } ODR_f;
    };

    union
    {
      __IOM uint32_t BRR; /*!< (@ 0x00000058) desc BRR                                                   */

      struct
      {
        __IOM uint32_t BRR0 : 1;  /*!< [0..0] desc BRR0                                                          */
        __IOM uint32_t BRR1 : 1;  /*!< [1..1] desc BRR1                                                          */
        __IOM uint32_t BRR2 : 1;  /*!< [2..2] desc BRR2                                                          */
        __IOM uint32_t BRR3 : 1;  /*!< [3..3] desc BRR3                                                          */
        __IOM uint32_t BRR4 : 1;  /*!< [4..4] desc BRR4                                                          */
        __IOM uint32_t BRR5 : 1;  /*!< [5..5] desc BRR5                                                          */
        __IOM uint32_t BRR6 : 1;  /*!< [6..6] desc BRR6                                                          */
        __IOM uint32_t BRR7 : 1;  /*!< [7..7] desc BRR7                                                          */
        __IOM uint32_t BRR8 : 1;  /*!< [8..8] desc BRR8                                                          */
        __IOM uint32_t BRR9 : 1;  /*!< [9..9] desc BRR9                                                          */
        __IOM uint32_t BRR10 : 1; /*!< [10..10] desc BRR10                                                       */
        __IOM uint32_t BRR11 : 1; /*!< [11..11] desc BRR11                                                       */
        __IOM uint32_t BRR12 : 1; /*!< [12..12] desc BRR12                                                       */
        __IOM uint32_t BRR13 : 1; /*!< [13..13] desc BRR13                                                       */
        __IOM uint32_t BRR14 : 1; /*!< [14..14] desc BRR14                                                       */
        __IOM uint32_t BRR15 : 1; /*!< [15..15] desc BRR15                                                       */
        __IM uint32_t : 16;
      } BRR_f;
    };

    union
    {
      __IOM uint32_t BSRR; /*!< (@ 0x0000005C) desc BSRR                                                  */

      struct
      {
        __IOM uint32_t BSS0 : 1;  /*!< [0..0] desc BSS0                                                          */
        __IOM uint32_t BSS1 : 1;  /*!< [1..1] desc BSS1                                                          */
        __IOM uint32_t BSS2 : 1;  /*!< [2..2] desc BSS2                                                          */
        __IOM uint32_t BSS3 : 1;  /*!< [3..3] desc BSS3                                                          */
        __IOM uint32_t BSS4 : 1;  /*!< [4..4] desc BSS4                                                          */
        __IOM uint32_t BSS5 : 1;  /*!< [5..5] desc BSS5                                                          */
        __IOM uint32_t BSS6 : 1;  /*!< [6..6] desc BSS6                                                          */
        __IOM uint32_t BSS7 : 1;  /*!< [7..7] desc BSS7                                                          */
        __IOM uint32_t BSS8 : 1;  /*!< [8..8] desc BSS8                                                          */
        __IOM uint32_t BSS9 : 1;  /*!< [9..9] desc BSS9                                                          */
        __IOM uint32_t BSS10 : 1; /*!< [10..10] desc BSS10                                                       */
        __IOM uint32_t BSS11 : 1; /*!< [11..11] desc BSS11                                                       */
        __IOM uint32_t BSS12 : 1; /*!< [12..12] desc BSS12                                                       */
        __IOM uint32_t BSS13 : 1; /*!< [13..13] desc BSS13                                                       */
        __IOM uint32_t BSS14 : 1; /*!< [14..14] desc BSS14                                                       */
        __IOM uint32_t BSS15 : 1; /*!< [15..15] desc BSS15                                                       */
        __IOM uint32_t BRR0 : 1;  /*!< [16..16] desc BRR0                                                        */
        __IOM uint32_t BRR1 : 1;  /*!< [17..17] desc BRR1                                                        */
        __IOM uint32_t BRR2 : 1;  /*!< [18..18] desc BRR2                                                        */
        __IOM uint32_t BRR3 : 1;  /*!< [19..19] desc BRR3                                                        */
        __IOM uint32_t BRR4 : 1;  /*!< [20..20] desc BRR4                                                        */
        __IOM uint32_t BRR5 : 1;  /*!< [21..21] desc BRR5                                                        */
        __IOM uint32_t BRR6 : 1;  /*!< [22..22] desc BRR6                                                        */
        __IOM uint32_t BRR7 : 1;  /*!< [23..23] desc BRR7                                                        */
        __IOM uint32_t BRR8 : 1;  /*!< [24..24] desc BRR8                                                        */
        __IOM uint32_t BRR9 : 1;  /*!< [25..25] desc BRR9                                                        */
        __IOM uint32_t BRR10 : 1; /*!< [26..26] desc BRR10                                                       */
        __IOM uint32_t BRR11 : 1; /*!< [27..27] desc BRR11                                                       */
        __IOM uint32_t BRR12 : 1; /*!< [28..28] desc BRR12                                                       */
        __IOM uint32_t BRR13 : 1; /*!< [29..29] desc BRR13                                                       */
        __IOM uint32_t BRR14 : 1; /*!< [30..30] desc BRR14                                                       */
        __IOM uint32_t BRR15 : 1; /*!< [31..31] desc BRR15                                                       */
      } BSRR_f;
    };

    union
    {
      __IOM uint32_t TOG; /*!< (@ 0x00000060) desc TOG                                                   */

      struct
      {
        __IOM uint32_t PIN0 : 1;  /*!< [0..0] desc PIN0                                                          */
        __IOM uint32_t PIN1 : 1;  /*!< [1..1] desc PIN1                                                          */
        __IOM uint32_t PIN2 : 1;  /*!< [2..2] desc PIN2                                                          */
        __IOM uint32_t PIN3 : 1;  /*!< [3..3] desc PIN3                                                          */
        __IOM uint32_t PIN4 : 1;  /*!< [4..4] desc PIN4                                                          */
        __IOM uint32_t PIN5 : 1;  /*!< [5..5] desc PIN5                                                          */
        __IOM uint32_t PIN6 : 1;  /*!< [6..6] desc PIN6                                                          */
        __IOM uint32_t PIN7 : 1;  /*!< [7..7] desc PIN7                                                          */
        __IOM uint32_t PIN8 : 1;  /*!< [8..8] desc PIN8                                                          */
        __IOM uint32_t PIN9 : 1;  /*!< [9..9] desc PIN9                                                          */
        __IOM uint32_t PIN10 : 1; /*!< [10..10] desc PIN10                                                       */
        __IOM uint32_t PIN11 : 1; /*!< [11..11] desc PIN11                                                       */
        __IOM uint32_t PIN12 : 1; /*!< [12..12] desc PIN12                                                       */
        __IOM uint32_t PIN13 : 1; /*!< [13..13] desc PIN13                                                       */
        __IOM uint32_t PIN14 : 1; /*!< [14..14] desc PIN14                                                       */
        __IOM uint32_t PIN15 : 1; /*!< [15..15] desc PIN15                                                       */
        __IM uint32_t : 16;
      } TOG_f;
    };
  } GPIO_TypeDef; /*!< Size = 100 (0x64)                                                         */

  /* =========================================================================================================================== */
  /* ================                                           GTIM1                                           ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc GTIM1 (GTIM1)
   */

  typedef struct
  { /*!< (@ 0x40000700) GTIM1 Structure                                            */

    union
    {
      __IOM uint32_t ARR; /*!< (@ 0x00000000) desc ARR                                                   */

      struct
      {
        __IOM uint32_t ARR : 16; /*!< [15..0] desc ARR                                                          */
        __IM uint32_t : 16;
      } ARR_f;
    };

    union
    {
      __IOM uint32_t CNT; /*!< (@ 0x00000004) desc CNT                                                   */

      struct
      {
        __IOM uint32_t CNT : 16; /*!< [15..0] desc CNT                                                          */
        __IM uint32_t : 16;
      } CNT_f;
    };

    union
    {
      __IOM uint32_t CMMR; /*!< (@ 0x00000008) desc CMMR                                                  */

      struct
      {
        __IOM uint32_t CC1M : 4; /*!< [3..0] desc CC1M                                                          */
        __IOM uint32_t CC2M : 4; /*!< [7..4] desc CC2M                                                          */
        __IOM uint32_t CC3M : 4; /*!< [11..8] desc CC3M                                                         */
        __IOM uint32_t CC4M : 4; /*!< [15..12] desc CC4M                                                        */
        __IM uint32_t : 16;
      } CMMR_f;
    };

    union
    {
      __IOM uint32_t ETR; /*!< (@ 0x0000000C) desc ETR                                                   */

      struct
      {
        __IM uint32_t : 4;
        __IOM uint32_t ETRFLT : 3; /*!< [6..4] desc ETRFLT                                                        */
        __IM uint32_t : 25;
      } ETR_f;
    };

    union
    {
      __IOM uint32_t CR0; /*!< (@ 0x00000010) desc CR0                                                   */

      struct
      {
        __IOM uint32_t EN : 1;      /*!< [0..0] desc EN                                                            */
        __IOM uint32_t MODE : 2;    /*!< [2..1] desc MD                                                            */
        __IOM uint32_t TRS : 1;     /*!< [3..3] desc TRS                                                           */
        __IOM uint32_t POL : 1;     /*!< [4..4] desc POLARITY                                                      */
        __IOM uint32_t ONESHOT : 1; /*!< [5..5] desc ONESHOT                                                       */
        __IOM uint32_t TOGEN : 1;   /*!< [6..6] desc TOGEN                                                         */
        __IM uint32_t : 8;
        __IOM uint32_t ENCMODE : 2;   /*!< [16..15] desc ENCMODE                                                     */
        __IOM uint32_t ENCRESET : 2;  /*!< [18..17] desc ENCRESET                                                    */
        __IOM uint32_t ENCRELOAD : 2; /*!< [20..19] desc ENCRELOAD                                                   */
        __IM uint32_t : 11;
      } CR0_f;
    };

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x00000014) desc IER                                                   */

      struct
      {
        __IOM uint32_t OV : 1;  /*!< [0..0] desc OV                                                            */
        __IOM uint32_t TI : 1;  /*!< [1..1] desc TI                                                            */
        __IOM uint32_t UD : 1;  /*!< [2..2] desc UD                                                            */
        __IOM uint32_t CC1 : 1; /*!< [3..3] desc CC1                                                           */
        __IOM uint32_t CC2 : 1; /*!< [4..4] desc CC2                                                           */
        __IOM uint32_t CC3 : 1; /*!< [5..5] desc CC3                                                           */
        __IOM uint32_t CC4 : 1; /*!< [6..6] desc CC4                                                           */
        __IM uint32_t : 2;
        __IOM uint32_t DIRCHANGE : 1; /*!< [9..9] desc DIRCHANGE                                                     */
        __IM uint32_t : 22;
      } IER_f;
    };

    union
    {
      __IOM uint32_t ISR; /*!< (@ 0x00000018) desc ISR                                                   */

      struct
      {
        __IOM uint32_t OV : 1; /*!< [0..0] desc OV                                                            */
        __IOM uint32_t TI : 1; /*!< [1..1] desc TI                                                            */
        __IOM uint32_t UD : 1; /*!< [2..2] desc UD                                                            */
        __IM uint32_t CC1 : 1; /*!< [3..3] desc CC1                                                           */
        __IM uint32_t CC2 : 1; /*!< [4..4] desc CC2                                                           */
        __IM uint32_t CC3 : 1; /*!< [5..5] desc CC3                                                           */
        __IM uint32_t CC4 : 1; /*!< [6..6] desc CC4                                                           */
        __IM uint32_t : 2;
        __IM uint32_t DIRCHANGE : 1; /*!< [9..9] desc DIRCHANGE                                                     */
        __IM uint32_t DIR : 1;       /*!< [10..10] desc DIR                                                         */
        __IM uint32_t : 21;
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x0000001C) desc ICR                                                   */

      struct
      {
        __IOM uint32_t OV : 1;  /*!< [0..0] desc OV                                                            */
        __IOM uint32_t TI : 1;  /*!< [1..1] desc TI                                                            */
        __IOM uint32_t UD : 1;  /*!< [2..2] desc UD                                                            */
        __IOM uint32_t CC1 : 1; /*!< [3..3] desc CC1                                                           */
        __IOM uint32_t CC2 : 1; /*!< [4..4] desc CC2                                                           */
        __IOM uint32_t CC3 : 1; /*!< [5..5] desc CC3                                                           */
        __IOM uint32_t CC4 : 1; /*!< [6..6] desc CC4                                                           */
        __IM uint32_t : 2;
        __IOM uint32_t DIRCHANGE : 1; /*!< [9..9] desc DIRCHANGE                                                     */
        __IM uint32_t : 22;
      } ICR_f;
    };

    union
    {
      __IOM uint32_t CCR1; /*!< (@ 0x00000020) desc CCR1                                                  */

      struct
      {
        __IOM uint32_t CCR : 16; /*!< [15..0] desc CCR                                                          */
        __IM uint32_t : 16;
      } CCR1_f;
    };

    union
    {
      __IOM uint32_t CCR2; /*!< (@ 0x00000024) desc CCR2                                                  */

      struct
      {
        __IOM uint32_t CCR : 16; /*!< [15..0] desc CCR                                                          */
        __IM uint32_t : 16;
      } CCR2_f;
    };

