VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031.h
    union
    {
      __IOM uint32_t CCR3; /*!< (@ 0x00000028) desc CCR3                                                  */

      struct
      {
        __IOM uint32_t CCR : 16; /*!< [15..0] desc CCR                                                          */
        __IM uint32_t : 16;
      } CCR3_f;
    };
    union
    {
      __IOM uint32_t CCR4; /*!< (@ 0x0000002C) desc CCR3                                                  */

      struct
      {
        __IOM uint32_t CCR : 16; /*!< [15..0] desc CCR                                                          */
        __IM uint32_t : 16;
      } CCR4_f;
    };

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000030) desc CR1                                                   */

      struct
      {
        __IOM uint32_t CH1FLT : 3; /*!< [2..0] desc CH1FLT                                                        */
        __IOM uint32_t CH1POL : 1; /*!< [3..3] desc CH1POL                                                        */
        __IOM uint32_t CH2FLT : 3; /*!< [6..4] desc CH2FLT                                                        */
        __IOM uint32_t CH2POL : 1; /*!< [7..7] desc CH2POL                                                        */
        __IOM uint32_t CH3FLT : 3; /*!< [10..8] desc CH3FLT                                                       */
        __IOM uint32_t CH3POL : 1; /*!< [11..11] desc CH3POL                                                      */
        __IOM uint32_t CH4FLT : 3; /*!< [14..12] desc CH4FLT                                                      */
        __IOM uint32_t CH4POL : 1; /*!< [15..15] desc CH4POL                                                      */
        __IM uint32_t : 16;
      } CR1_f;
    };

    union
    {
      __IOM uint32_t PSC; /*!< (@ 0x00000034) desc PSC                                                   */

      struct
      {
        __IOM uint32_t PSC : 16; /*!< [15..0] desc PSC                                                          */
        __IM uint32_t : 16;
      } PSC_f;
    };
    __IM uint32_t RESERVED2[2];

    union
    {
      __IOM uint32_t DMA; /*!< (@ 0x00000040) desc DMA                                                   */

      struct
      {
        __IOM uint32_t OV : 1;  /*!< [0..0] desc OV                                                            */
        __IOM uint32_t TRS : 1; /*!< [1..1] desc TRS                                                           */
        __IOM uint32_t CC1 : 1; /*!< [2..2] desc CC1                                                           */
        __IOM uint32_t CC2 : 1; /*!< [3..3] desc CC2                                                           */
        __IOM uint32_t CC3 : 1; /*!< [4..4] desc CC3                                                           */
        __IOM uint32_t CC4 : 1; /*!< [5..5] desc CC4                                                           */
        __IM uint32_t : 26;
      } DMA_f;
    };
  } GTIM_TypeDef; /*!< Size = 68 (0x44)                                                        */

  /* =========================================================================================================================== */
  /* ================                                           I2C1                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc I2C1 (I2C1)
   */

  typedef struct
  { /*!< (@ 0x40005400) I2C1 Structure                                             */

    union
    {
      __IOM uint32_t BRREN; /*!< (@ 0x00000000) desc BRREN                                                 */

      struct
      {
        __IOM uint32_t EN : 1; /*!< [0..0] desc EN                                                            */
        __IM uint32_t : 31;
      } BRREN_f;
    };

    union
    {
      __IOM uint32_t BRR; /*!< (@ 0x00000004) desc BRR                                                   */

      struct
      {
        __IOM uint32_t BRR : 8; /*!< [7..0] desc BRR                                                           */
        __IM uint32_t : 24;
      } BRR_f;
    };

    union
    {
      __IOM uint32_t CR; /*!< (@ 0x00000008) desc CR                                                    */

      struct
      {
        __IOM uint32_t FLT : 1; /*!< [0..0] desc FLT                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t AA : 1;  /*!< [2..2] desc AA                                                            */
        __IOM uint32_t SI : 1;  /*!< [3..3] desc SI                                                            */
        __IOM uint32_t STO : 1; /*!< [4..4] desc STO                                                           */
        __IOM uint32_t STA : 1; /*!< [5..5] desc STA                                                           */
        __IOM uint32_t EN : 1;  /*!< [6..6] desc EN                                                            */
        __IM uint32_t : 25;
      } CR_f;
    };

    union
    {
      __IOM uint32_t DR; /*!< (@ 0x0000000C) desc DR                                                    */

      struct
      {
        __IOM uint32_t DR : 8; /*!< [7..0] desc DR                                                            */
        __IM uint32_t : 24;
      } DR_f;
    };

    union
    {
      __IOM uint32_t ADDR0; /*!< (@ 0x00000010) desc ADDR0                                                 */

      struct
      {
        __IOM uint32_t GC : 1;    /*!< [0..0] desc GC                                                            */
        __IOM uint32_t ADDR0 : 7; /*!< [7..1] desc ADDR0                                                         */
        __IM uint32_t : 24;
      } ADDR0_f;
    };

    union
    {
      __IM uint32_t STAT; /*!< (@ 0x00000014) desc STAT                                                  */

      struct
      {
        __IM uint32_t STAT : 8; /*!< [7..0] desc STAT                                                          */
        __IM uint32_t : 24;
      } STAT_f;
    };
    __IM uint32_t RESERVED[2];

    union
    {
      __IOM uint32_t ADDR1; /*!< (@ 0x00000020) desc ADDR1                                                 */

      struct
      {
        __IM uint32_t : 1;
        __IOM uint32_t ADDR1 : 7; /*!< [7..1] desc ADDR1                                                         */
        __IM uint32_t : 24;
      } ADDR1_f;
    };

    union
    {
      __IOM uint32_t ADDR2; /*!< (@ 0x00000024) desc ADDR2                                                 */

      struct
      {
        __IM uint32_t : 1;
        __IOM uint32_t ADDR2 : 7; /*!< [7..1] desc ADDR2                                                         */
        __IM uint32_t : 24;
      } ADDR2_f;
    };

    union
    {
      __IM uint32_t MATCH; /*!< (@ 0x00000028) desc MATCH                                                 */

      struct
      {
        __IM uint32_t ADDR0 : 1; /*!< [0..0] desc ADDR0                                                         */
        __IM uint32_t ADDR1 : 1; /*!< [1..1] desc ADDR1                                                         */
        __IM uint32_t ADDR2 : 1; /*!< [2..2] desc ADDR2                                                         */
        __IM uint32_t : 29;
      } MATCH_f;
    };
  } I2C_TypeDef; /*!< Size = 44 (0x2c)                                                          */

  /* =========================================================================================================================== */
  /* ================                                           IRMOD                                           ================ */
  /* =========================================================================================================================== */

  /**
   * @brief IR Mode (IRMOD)
   */

  typedef struct
  { /*!< (@ 0x40010074) IRMOD Structure                                            */

    union
    {
      __IOM uint32_t CR; /*!< (@ 0x00000000) IR MOD Control Reg                                         */

      struct
      {
        __IOM uint32_t MOD : 4; /*!< [3..0] desc MOD                                                           */
      } CR_f;
    };
  } IRMOD_TypeDef; /*!< Size = 4 (0x4)                                                            */

  /* =========================================================================================================================== */
  /* ================                                           IWDT                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc IWDT (IWDT)
   */

  typedef struct
  { /*!< (@ 0x40003000) IWDT Structure                                             */

    union
    {
      __OM uint32_t KR; /*!< (@ 0x00000000) desc KR                                                    */

      struct
      {
        __OM uint32_t KR : 16; /*!< [15..0] desc KR                                                           */
        __IM uint32_t : 16;
      } KR_f;
    };

    union
    {
      __IOM uint32_t CR; /*!< (@ 0x00000004) desc CR                                                    */

      struct
      {
        __IOM uint32_t PRS : 3;    /*!< [2..0] desc PRS                                                           */
        __IOM uint32_t ACTION : 1; /*!< [3..3] desc ACTION                                                        */
        __IOM uint32_t IE : 1;     /*!< [4..4] desc IE                                                            */
        __IOM uint32_t PAUSE : 1;  /*!< [5..5] desc PAUSE                                                         */
        __IM uint32_t : 26;
      } CR_f;
    };

    union
    {
      __IOM uint32_t ARR; /*!< (@ 0x00000008) desc ARR                                                   */

      struct
      {
        __IOM uint32_t ARR : 12; /*!< [11..0] desc ARR                                                          */
        __IM uint32_t : 20;
      } ARR_f;
    };

    union
    {
      __IOM uint32_t SR; /*!< (@ 0x0000000C) desc SR                                                    */

      struct
      {
        __IM uint32_t CRF : 1;    /*!< [0..0] desc CRF                                                           */
        __IM uint32_t ARRF : 1;   /*!< [1..1] desc ARRF                                                          */
        __IM uint32_t WINRF : 1;  /*!< [2..2] desc WINRF                                                         */
        __IOM uint32_t OV : 1;    /*!< [3..3] desc OV                                                            */
        __IM uint32_t RUN : 1;    /*!< [4..4] desc RUN                                                           */
        __IM uint32_t RELOAD : 1; /*!< [5..5] desc RELOAD                                                        */
        __IM uint32_t : 26;
      } SR_f;
    };

    union
    {
      __IOM uint32_t WINR; /*!< (@ 0x00000010) desc WINR                                                  */

      struct
      {
        __IOM uint32_t WINR : 12; /*!< [11..0] desc WINR                                                         */
        __IM uint32_t : 20;
      } WINR_f;
    };
    __IM uint32_t RESERVED[4];

    union
    {
      __IM uint32_t CNT; /*!< (@ 0x00000024) desc CNT                                                   */

      struct
      {
        __IM uint32_t CNT : 12; /*!< [11..0] desc CNT                                                          */
        __IM uint32_t : 20;
      } CNT_f;
    };
  } IWDT_TypeDef; /*!< Size = 40 (0x28)                                                          */

  /* =========================================================================================================================== */
  /* ================                                            LVD                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc LVD (LVD)
   */

  typedef struct
  { /*!< (@ 0x40012A80) LVD Structure                                              */

    union
    {
      __IOM uint32_t CR0; /*!< (@ 0x00000000) desc CR0                                                   */

      struct
      {
        __IOM uint32_t EN : 1;     /*!< [0..0] desc EN                                                            */
        __IOM uint32_t ACTION : 1; /*!< [1..1] desc ACTION                                                        */
        __IOM uint32_t SOURCE : 2; /*!< [3..2] desc SOURCE                                                        */
        __IOM uint32_t VTH : 4;    /*!< [7..4] desc VTH                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t IE : 1; /*!< [9..9] desc IE                                                            */
        __IM uint32_t : 22;
      } CR0_f;
    };

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000004) desc CR1                                                   */

      struct
      {
        __IOM uint32_t FLTEN : 1;   /*!< [0..0] desc FLTEN                                                         */
        __IOM uint32_t FLTTIME : 3; /*!< [3..1] desc FLTTIME                                                       */
        __IOM uint32_t FLTCLK : 1;  /*!< [4..4] desc FLTCLK                                                        */
        __IOM uint32_t RISE : 1;    /*!< [5..5] desc RISE                                                          */
        __IOM uint32_t FALL : 1;    /*!< [6..6] desc FALL                                                          */
        __IOM uint32_t LEVEL : 1;   /*!< [7..7] desc LEVEL                                                         */
        __IM uint32_t : 24;
      } CR1_f;
    };

    union
    {
      __IOM uint32_t SR; /*!< (@ 0x00000008) desc SR                                                    */

      struct
      {
        __IOM uint32_t INTF : 1; /*!< [0..0] desc INTF                                                          */
        __IM uint32_t FLTV : 1;  /*!< [1..1] desc FLTV                                                          */
        __IM uint32_t : 30;
      } SR_f;
    };
  } LVD_TypeDef; /*!< Size = 12 (0xc)                                                           */

  /* =========================================================================================================================== */
  /* ================                                            RAM                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc RAM (RAM)
   */

  typedef struct
  { /*!< (@ 0x40022400) RAM Structure                                              */

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x00000000) desc IER                                                   */

      struct
      {
        __IOM uint32_t EN : 1;     /*!< [0..0] desc EN                                                            */
        __IOM uint32_t PARITY : 1; /*!< [1..1] desc PARITY                                                        */
        __IM uint32_t : 30;
      } IER_f;
    };

    union
    {
      __IM uint32_t ADDR; /*!< (@ 0x00000004) desc ADDR                                                  */

      struct
      {
        __IM uint32_t ADDR : 14; /*!< [13..0] desc ADDR                                                         */
        __IM uint32_t : 18;
      } ADDR_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x00000008) desc ISR                                                   */

      struct
      {
        __IM uint32_t PARITY : 1; /*!< [0..0] desc PARITY                                                        */
        __IM uint32_t : 31;
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x0000000C) desc ICR                                                   */

      struct
      {
        __IOM uint32_t PARITY : 1; /*!< [0..0] desc PARITY                                                        */
        __IM uint32_t : 31;
      } ICR_f;
    };
  } RAM_TypeDef; /*!< Size = 16 (0x10)                                                          */

  /* =========================================================================================================================== */
  /* ================                                            RTC                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc RTC (RTC)
   */

  typedef struct
  { /*!< (@ 0x40002800) RTC Structure                                              */

    union
    {
      __OM uint32_t KEY; /*!< (@ 0x00000000) desc KEY                                                   */

      struct
      {
        __OM uint32_t KEY : 8; /*!< [7..0] desc KEY                                                           */
        __IM uint32_t : 24;
      } KEY_f;
    };

    union
    {
      __IOM uint32_t CR0; /*!< (@ 0x00000004) desc CR0                                                   */

      struct
      {
        __IOM uint32_t INTERVAL : 3; /*!< [2..0] desc INTERVAL                                                      */
        __IOM uint32_t H24 : 1;      /*!< [3..3] desc AMPM                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t RTC1HZ : 2; /*!< [6..5] desc RTC1HZ                                                        */
        __IOM uint32_t START : 1;  /*!< [7..7] desc START                                                         */
        __IM uint32_t : 24;
      } CR0_f;
    };

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000008) desc CR1                                                   */

      struct
      {
        __IOM uint32_t ACCESS : 1; /*!< [0..0] desc ACCESS                                                        */
        __IM uint32_t WINDOW : 1;  /*!< [1..1] desc WINDOW                                                        */
        __IM uint32_t : 6;
        __IOM uint32_t SOURCE : 3; /*!< [10..8] desc SOURCE                                                       */
        __IM uint32_t : 21;
      } CR1_f;
    };

    union
    {
      __IOM uint32_t CR2; /*!< (@ 0x0000000C) desc CR2                                                   */

      struct
      {
        __IOM uint32_t AWTSRC : 3;   /*!< [2..0] desc AWTSRC                                                        */
        __IOM uint32_t TAMPEDGE : 1; /*!< [3..3] desc TAMPEDGE                                                      */
        __IOM uint32_t RTCOUT : 2;   /*!< [5..4] desc RTCOUT                                                        */
        __IOM uint32_t TAMPEN : 1;   /*!< [6..6] desc TAMPEN                                                        */
        __IOM uint32_t AWTEN : 1;    /*!< [7..7] desc AWTEN                                                         */
        __IM uint32_t : 1;
        __IOM uint32_t ALARMAEN : 1; /*!< [9..9] desc ALARMAEN                                                      */
        __IOM uint32_t ALARMBEN : 1; /*!< [10..10] desc ALARMBEN                                                    */
        __IM uint32_t : 21;
      } CR2_f;
    };

    union
    {
      __IOM uint32_t COMPEN; /*!< (@ 0x00000010) desc COMPEN                                                */

      struct
      {
        __IOM uint32_t COMP : 12; /*!< [11..0] desc COMP                                                         */
        __IOM uint32_t STEP : 2;  /*!< [13..12] desc STEP                                                        */
        __IOM uint32_t SIGN : 1;  /*!< [14..14] desc SIGN                                                        */
        __IOM uint32_t EN : 1;    /*!< [15..15] desc EN                                                          */
        __IOM uint32_t FREQ : 4;  /*!< [19..16] desc FREQ                                                        */
        __IM uint32_t : 12;
      } COMPEN_f;
    };

    union
    {
      __IOM uint32_t DATE; /*!< (@ 0x00000014) desc DATE                                                  */

      struct
      {
        __IOM uint32_t DAY : 8;   /*!< [7..0] desc DAY                                                           */
        __IOM uint32_t MONTH : 8; /*!< [15..8] desc MONTH                                                        */
        __IOM uint32_t YEAR : 8;  /*!< [23..16] desc YEAR                                                        */
        __IOM uint32_t WEEK : 3;  /*!< [26..24] desc WEEK                                                        */
        __IM uint32_t : 5;
      } DATE_f;
    };

    union
    {
      __IOM uint32_t TIME; /*!< (@ 0x00000018) desc TIME                                                  */

      struct
      {
        __IOM uint32_t SECOND : 7; /*!< [6..0] desc SECOND                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t MINUTE : 7; /*!< [14..8] desc MINUTE                                                       */
        __IM uint32_t : 1;
        __IOM uint32_t HOUR : 6; /*!< [21..16] desc HOUR                                                        */
        __IM uint32_t : 10;
      } TIME_f;
    };

    union
    {
      __IOM uint32_t ALARMA; /*!< (@ 0x0000001C) desc ALARMA                                                */

      struct
      {
        __IOM uint32_t SECOND : 7;   /*!< [6..0] desc SECOND                                                        */
        __IOM uint32_t SECONDEN : 1; /*!< [7..7] desc SECONDEN                                                      */
        __IOM uint32_t MINUTE : 7;   /*!< [14..8] desc MINUTE                                                       */
        __IOM uint32_t MINUTEEN : 1; /*!< [15..15] desc MINUTEEN                                                    */
        __IOM uint32_t HOUR : 6;     /*!< [21..16] desc HOUR                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t HOUREN : 1;   /*!< [23..23] desc HOUREN                                                      */
        __IOM uint32_t WEEKMASK : 7; /*!< [30..24] desc WEEKMASK                                                    */
        __IM uint32_t : 1;
      } ALARMA_f;
    };

    union
    {
      __IOM uint32_t ALARMB; /*!< (@ 0x00000020) desc ALARMB                                                */

