VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031.h
      struct
      {
        __IOM uint32_t SECOND : 7;   /*!< [6..0] desc SECOND                                                        */
        __IOM uint32_t SECONDEN : 1; /*!< [7..7] desc SECONDEN                                                      */
        __IOM uint32_t MINUTE : 7;   /*!< [14..8] desc MINUTE                                                       */
        __IOM uint32_t MINUTEEN : 1; /*!< [15..15] desc MINUTEEN                                                    */
        __IOM uint32_t HOUR : 6;     /*!< [21..16] desc HOUR                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t HOUREN : 1;   /*!< [23..23] desc HOUREN                                                      */
        __IOM uint32_t WEEKMASK : 7; /*!< [30..24] desc WEEKMASK                                                    */
        __IM uint32_t : 1;
      } ALARMB_f;
    };

    union
    {
      __IM uint32_t TAMPDATE; /*!< (@ 0x00000024) desc TAMPDATE                                              */

      struct
      {
        __IM uint32_t DAY : 6; /*!< [5..0] desc DAY                                                           */
        __IM uint32_t : 2;
        __IM uint32_t MONTH : 5; /*!< [12..8] desc MONTH                                                        */
        __IM uint32_t WEEK : 3;  /*!< [15..13] desc WEEK                                                        */
        __IM uint32_t : 16;
      } TAMPDATE_f;
    };

    union
    {
      __IM uint32_t TAMPTIME; /*!< (@ 0x00000028) desc TAMPTIME                                              */

      struct
      {
        __IM uint32_t SECOND : 7; /*!< [6..0] desc SECOND                                                        */
        __IM uint32_t : 1;
        __IM uint32_t MINUTE : 7; /*!< [14..8] desc MINUTE                                                       */
        __IM uint32_t : 1;
        __IM uint32_t HOUR : 6; /*!< [21..16] desc HOUR                                                        */
        __IM uint32_t : 10;
      } TAMPTIME_f;
    };

    union
    {
      __IOM uint32_t AWTARR; /*!< (@ 0x0000002C) desc AWTARR                                               */

      struct
      {
        __IOM uint32_t ARR : 16; /*!< [15..0] desc ARR                                                          */
        __IM uint32_t : 16;
      } AWTARR_f;
    };

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x00000030) desc IER                                                   */

      struct
      {
        __IOM uint32_t ALARMA : 1;  /*!< [0..0] desc ALARMA                                                        */
        __IOM uint32_t ALARMB : 1;  /*!< [1..1] desc ALARMB                                                        */
        __IOM uint32_t AWTIMER : 1; /*!< [2..2] desc AWTIMER                                                       */
        __IOM uint32_t TAMP : 1;    /*!< [3..3] desc TAMP                                                          */
        __IOM uint32_t TAMPOV : 1;  /*!< [4..4] desc TAMPOV                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t INTERVAL : 1; /*!< [6..6] desc INTERVAL                                                      */
        __IM uint32_t : 25;
      } IER_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x00000034) desc ISR                                                   */

      struct
      {
        __IM uint32_t ALARMA : 1;  /*!< [0..0] desc ALARMA                                                        */
        __IM uint32_t ALARMB : 1;  /*!< [1..1] desc ALARMB                                                        */
        __IM uint32_t AWTIMER : 1; /*!< [2..2] desc AWTIMER                                                       */
        __IM uint32_t TAMP : 1;    /*!< [3..3] desc TAMP                                                          */
        __IM uint32_t TAMPOV : 1;  /*!< [4..4] desc TAMPOV                                                        */
        __IM uint32_t : 1;
        __IM uint32_t INTERVAL : 1; /*!< [6..6] desc INTERVAL                                                      */
        __IM uint32_t : 25;
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000038) desc ICR                                                   */

      struct
      {
        __IOM uint32_t ALARMA : 1;  /*!< [0..0] desc ALARMA                                                        */
        __IOM uint32_t ALARMB : 1;  /*!< [1..1] desc ALARMB                                                        */
        __IOM uint32_t AWTIMER : 1; /*!< [2..2] desc AWTIMER                                                       */
        __IOM uint32_t TAMP : 1;    /*!< [3..3] desc TAMP                                                          */
        __IOM uint32_t TAMPOV : 1;  /*!< [4..4] desc TAMPOV                                                        */
        __IM uint32_t : 1;
        __IOM uint32_t INTERVAL : 1; /*!< [6..6] desc INTERVAL                                                      */
        __IM uint32_t : 25;
      } ICR_f;
    };
  } RTC_TypeDef; /*!< Size = 60 (0x3c)                                                          */

  /* =========================================================================================================================== */
  /* ================                                           SPI1                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc SPI1 (SPI1)
   */

  typedef struct
  { /*!< (@ 0x40013000) SPI1 Structure                                             */

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000000) desc CR1                                                   */

      struct
      {
        __IOM uint32_t CPHA : 1;   /*!< [0..0] desc CPHA                                                          */
        __IOM uint32_t CPOL : 1;   /*!< [1..1] desc CPOL                                                          */
        __IOM uint32_t MSTR : 1;   /*!< [2..2] desc MSTR                                                          */
        __IOM uint32_t BR : 3;     /*!< [5..3] desc BR                                                            */
        __IOM uint32_t EN : 1;     /*!< [6..6] desc EN                                                            */
        __IOM uint32_t LSBF : 1;   /*!< [7..7] desc LSBF                                                          */
        __IOM uint32_t SMP : 1;    /*!< [8..8] desc SMP                                                           */
        __IOM uint32_t SSM : 1;    /*!< [9..9] desc SSM                                                           */
        __IOM uint32_t WIDTH : 4;  /*!< [13..10] desc WIDTH                                                       */
        __IOM uint32_t MODE : 2;   /*!< [15..14] desc MODE                                                        */
        __IOM uint32_t DMARX : 1;  /*!< [16..16] desc DMARX                                                       */
        __IOM uint32_t DMATX : 1;  /*!< [17..17] desc DMATX                                                       */
        __IOM uint32_t MISOHD : 1; /*!< [18..18] desc MISOHD                                                      */
        __IM uint32_t : 13;
      } CR1_f;
    };

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x00000004) desc IER                                                   */

      struct
      {
        __IOM uint32_t TXE : 1;   /*!< [0..0] desc TXE                                                           */
        __IOM uint32_t RXNE : 1;  /*!< [1..1] desc RXNE                                                          */
        __IOM uint32_t SSF : 1;   /*!< [2..2] desc SSF                                                           */
        __IOM uint32_t SSR : 1;   /*!< [3..3] desc SSR                                                           */
        __IOM uint32_t UD : 1;    /*!< [4..4] desc UD                                                            */
        __IOM uint32_t OV : 1;    /*!< [5..5] desc OV                                                            */
        __IOM uint32_t SSERR : 1; /*!< [6..6] desc SSERR                                                         */
        __IOM uint32_t MODF : 1;  /*!< [7..7] desc MODF                                                          */
        __IM uint32_t : 24;
      } IER_f;
    };

    union
    {
      __IOM uint32_t CR2; /*!< (@ 0x00000008) desc CR2                                                   */

      struct
      {
        __IOM uint32_t HDOE : 1; /*!< [0..0] desc HDOE                                                          */
        __IM uint32_t : 31;
      } CR2_f;
    };

    union
    {
      __IOM uint32_t SSI; /*!< (@ 0x0000000C) desc SSI                                                   */

      struct
      {
        __IOM uint32_t SSI : 1; /*!< [0..0] desc SSI                                                           */
        __IM uint32_t : 31;
      } SSI_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x00000010) desc ISR                                                   */

      struct
      {
        __IM uint32_t TXE : 1;   /*!< [0..0] desc TXE                                                           */
        __IM uint32_t RXNE : 1;  /*!< [1..1] desc RXNE                                                          */
        __IM uint32_t SSF : 1;   /*!< [2..2] desc SSF                                                           */
        __IM uint32_t SSR : 1;   /*!< [3..3] desc SSR                                                           */
        __IM uint32_t UD : 1;    /*!< [4..4] desc UD                                                            */
        __IM uint32_t OV : 1;    /*!< [5..5] desc OV                                                            */
        __IM uint32_t SSERR : 1; /*!< [6..6] desc SSERR                                                         */
        __IM uint32_t MODF : 1;  /*!< [7..7] desc MODF                                                          */
        __IM uint32_t BUSY : 1;  /*!< [8..8] desc BUSY                                                          */
        __IM uint32_t SSLVL : 1; /*!< [9..9] desc SSLVL                                                         */
        __IM uint32_t : 22;
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000014) desc ICR                                                   */

      struct
      {
        __IOM uint32_t FLUSH : 1; /*!< [0..0] desc FLUSH                                                         */
        __IOM uint32_t RXNE : 1;  /*!< [1..1] desc RXNE                                                          */
        __IOM uint32_t SSF : 1;   /*!< [2..2] desc SSF                                                           */
        __IOM uint32_t SSR : 1;   /*!< [3..3] desc SSR                                                           */
        __IOM uint32_t UD : 1;    /*!< [4..4] desc UD                                                            */
        __IOM uint32_t OV : 1;    /*!< [5..5] desc OV                                                            */
        __IOM uint32_t SSERR : 1; /*!< [6..6] desc SSERR                                                         */
        __IOM uint32_t MODF : 1;  /*!< [7..7] desc MODF                                                          */
        __IM uint32_t : 24;
      } ICR_f;
    };

    union
    {
      __IOM uint32_t DR; /*!< (@ 0x00000018) desc DR                                                    */

      struct
      {
        __IOM uint32_t DR : 16; /*!< [15..0] desc DR                                                           */
        __IM uint32_t : 16;
      } DR_f;
    };
  } SPI_TypeDef; /*!< Size = 28 (0x1c)                                                          */

  /* =========================================================================================================================== */
  /* ================                                          SYSCTRL                                          ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc SYSCTRL (SYSCTRL)
   */

  typedef struct
  { /*!< (@ 0x40010000) SYSCTRL Structure                                          */

    union
    {
      __IOM uint32_t CR0; /*!< (@ 0x00000000) desc CR0                                                   */

      struct
      {
        __IOM uint32_t SYSCLK : 3;  /*!< [2..0] desc SYSCLK                                                        */
        __IOM uint32_t PCLKPRS : 2; /*!< [4..3] desc PCLKPRS                                                       */
        __IOM uint32_t HCLKPRS : 3; /*!< [7..5] desc HCLKPRS                                                       */
        __IM uint32_t : 8;
        __OM uint32_t KEY : 16; /*!< [31..16] desc KEY                                                         */
      } CR0_f;
    };

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000004) desc CR1                                                   */

      struct
      {
        __IOM uint32_t HSIEN : 1;   /*!< [0..0] desc HSIEN                                                         */
        __IOM uint32_t HSEEN : 1;   /*!< [1..1] desc HSEEN                                                         */
        __IOM uint32_t : 1;         /*!< [2..2] desc                                                               */
        __IOM uint32_t LSIEN : 1;   /*!< [3..3] desc LSIEN                                                         */
        __IOM uint32_t LSEEN : 1;   /*!< [4..4] desc LSEEN                                                         */
        __IOM uint32_t LSELOCK : 1; /*!< [5..5] desc LSELOCK                                                       */
        __IOM uint32_t LSECCS : 1;  /*!< [6..6] desc LSECCS                                                        */
        __IOM uint32_t HSECCS : 1;  /*!< [7..7] desc HSECCS                                                        */
        __IOM uint32_t CLKCCS : 1;  /*!< [8..8] desc CLKCCS                                                        */
        __IM uint32_t : 7;
        __OM uint32_t KEY : 16; /*!< [31..16] desc KEY                                                         */
      } CR1_f;
    };

    union
    {
      __IOM uint32_t CR2; /*!< (@ 0x00000008) desc CR2                                                   */

      struct
      {
        __IM uint32_t : 1;
        __IOM uint32_t SWDIO : 1;     /*!< [1..1] desc SWDIO                                                         */
        __IOM uint32_t LOCKUP : 1;    /*!< [2..2] desc LOCKUP                                                        */
        __IOM uint32_t WAKEUPCLK : 1; /*!< [3..3] desc WAKEUPCLK                                                     */
        __IOM uint32_t FLASHWAIT : 3; /*!< [6..4] desc FLASHWAIT                                                     */
        __IM uint32_t : 9;
        __OM uint32_t KEY : 16; /*!< [31..16] desc KEY                                                         */
      } CR2_f;
    };

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x0000000C) desc IER                                                   */

      struct
      {
        __IOM uint32_t HSIRDY : 1;   /*!< [0..0] desc HSIRDY                                                        */
        __IOM uint32_t HSERDY : 1;   /*!< [1..1] desc HSERDY                                                        */
        __IOM uint32_t : 1;          /*!< [2..2] desc                                                               */
        __IOM uint32_t LSIRDY : 1;   /*!< [3..3] desc LSIRDY                                                        */
        __IOM uint32_t LSERDY : 1;   /*!< [4..4] desc LSERDY                                                        */
        __IOM uint32_t LSEFAIL : 1;  /*!< [5..5] desc LSEFAIL                                                       */
        __IOM uint32_t HSEFAIL : 1;  /*!< [6..6] desc HSEFAIL                                                       */
        __IOM uint32_t LSEFAULT : 1; /*!< [7..7] desc LSEFAULT                                                      */
        __IOM uint32_t HSEFAULT : 1; /*!< [8..8] desc HSEFAULT                                                      */
        __IM uint32_t : 7;
        __OM uint32_t KEY : 16; /*!< [31..16] desc KEY                                                         */
      } IER_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x00000010) desc ISR                                                   */

      struct
      {
        __IM uint32_t HSIRDY : 1;   /*!< [0..0] desc HSIRDY                                                        */
        __IM uint32_t HSERDY : 1;   /*!< [1..1] desc HSERDY                                                        */
        __IM uint32_t : 1;          /*!< [2..2] desc                                                               */
        __IM uint32_t LSIRDY : 1;   /*!< [3..3] desc LSIRDY                                                        */
        __IM uint32_t LSERDY : 1;   /*!< [4..4] desc LSERDY                                                        */
        __IM uint32_t LSEFAIL : 1;  /*!< [5..5] desc LSEFAIL                                                       */
        __IM uint32_t HSEFAIL : 1;  /*!< [6..6] desc HSEFAIL                                                       */
        __IM uint32_t LSEFAULT : 1; /*!< [7..7] desc LSEFAULT                                                      */
        __IM uint32_t HSEFAULT : 1; /*!< [8..8] desc HSEFAULT                                                      */
        __IM uint32_t : 2;
        __IM uint32_t HSISTABLE : 1; /*!< [11..11] desc HSISTABLE                                                   */
        __IM uint32_t HSESTABLE : 1; /*!< [12..12] desc HSESTABLE                                                   */
        __IM uint32_t : 1;           /*!< [13..13] desc                                                             */
        __IM uint32_t LSISTABLE : 1; /*!< [14..14] desc LSISTABLE                                                   */
        __IM uint32_t LSESTABLE : 1; /*!< [15..15] desc LSESTABLE                                                   */
        __IM uint32_t : 16;
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000014) desc ICR                                                   */

      struct
      {
        __IOM uint32_t HSIRDY : 1;   /*!< [0..0] desc HSIRDY                                                        */
        __IOM uint32_t HSERDY : 1;   /*!< [1..1] desc HSERDY                                                        */
        __IOM uint32_t : 1;          /*!< [2..2] desc                                                               */
        __IOM uint32_t LSIRDY : 1;   /*!< [3..3] desc LSIRDY                                                        */
        __IOM uint32_t LSERDY : 1;   /*!< [4..4] desc LSERDY                                                        */
        __IOM uint32_t LSEFAIL : 1;  /*!< [5..5] desc LSEFAIL                                                       */
        __IOM uint32_t HSEFAIL : 1;  /*!< [6..6] desc HSEFAIL                                                       */
        __IOM uint32_t LSEFAULT : 1; /*!< [7..7] desc LSEFAULT                                                      */
        __IOM uint32_t HSEFAULT : 1; /*!< [8..8] desc HSEFAULT                                                      */
        __IM uint32_t : 23;
      } ICR_f;
    };

    union
    {
      __IOM uint32_t HSI; /*!< (@ 0x00000018) desc HSI                                                   */

      struct
      {
        __IOM uint32_t TRIM : 11; /*!< [10..0] desc TRIM                                                         */
        __IOM uint32_t DIV : 4;   /*!< [14..11] desc DIV                                                         */
        __IM uint32_t STABLE : 1; /*!< [15..15] desc STABLE                                                      */
        __IM uint32_t : 16;
      } HSI_f;
    };

    union
    {
      __IOM uint32_t HSE; /*!< (@ 0x0000001C) desc HSE                                                   */

      struct
      {
        __IOM uint32_t DRIVER : 2;    /*!< [1..0] desc DRIVER                                                        */
        __IOM uint32_t FREQRANGE : 2; /*!< [3..2] desc FREQRANGE                                                     */
        __IOM uint32_t WAITCYCLE : 2; /*!< [5..4] desc WAITCYCLE                                                     */
        __IOM uint32_t MODE : 1;      /*!< [6..6] desc MODE                                                          */
        __IOM uint32_t FLT : 1;       /*!< [7..7] desc FLT                                                           */
        __IOM uint32_t DETCNT : 11;   /*!< [18..8] desc DETCNT                                                       */
        __IM uint32_t STABLE : 1;     /*!< [19..19] desc STABLE                                                      */
        __IM uint32_t : 12;
      } HSE_f;
    };

    union
    {
      __IOM uint32_t LSI; /*!< (@ 0x00000020) desc LSI                                                   */

      struct
      {
        __IOM uint32_t TRIM : 10;     /*!< [9..0] desc TRIM                                                          */
        __IOM uint32_t WAITCYCLE : 2; /*!< [11..10] desc WAITCYCLE                                                   */
        __IM uint32_t : 3;
        __IM uint32_t STABLE : 1; /*!< [15..15] desc STABLE                                                      */
        __IM uint32_t : 16;
      } LSI_f;
    };

    union
    {
      __IOM uint32_t LSE; /*!< (@ 0x00000024) desc LSE                                                   */

      struct
      {
        __IOM uint32_t DRIVER : 2;    /*!< [1..0] desc DRIVER                                                        */
        __IOM uint32_t AMP : 2;       /*!< [3..2] desc AMP                                                           */
        __IOM uint32_t WAITCYCLE : 2; /*!< [5..4] desc WAITCYCLE                                                     */
        __IOM uint32_t MODE : 1;      /*!< [6..6] desc MODE                                                          */
        __IM uint32_t : 8;
        __IM uint32_t STABLE : 1; /*!< [15..15] desc STABLE                                                      */
        __IM uint32_t : 16;
      } LSE_f;
    };

