VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031.h
    __IM uint32_t RESERVED0;

    union
    {
      __IOM uint32_t DEBUG; /*!< (@ 0x0000002C) desc DEBUG                                                 */

      struct
      {
        __IOM uint32_t ATIM : 1;    /*!< [0..0] desc ATIM                                                          */
        __IOM uint32_t GTIM1 : 1;   /*!< [1..1] desc GTIM1                                                         */
        __IOM uint32_t GTIM2 : 1;   /*!< [2..2] desc GTIM2                                                         */
        __IOM uint32_t : 1;         /*!< [3..3] desc                                                               */
        __IOM uint32_t : 1;         /*!< [4..4] desc                                                               */
        __IOM uint32_t BTIM123 : 1; /*!< [5..5] desc BTIM123                                                       */
        __IOM uint32_t AWT : 1;     /*!< [6..6] desc AWT                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t RTC : 1;  /*!< [8..8] desc RTC                                                           */
        __IOM uint32_t IWDT : 1; /*!< [9..9] desc IWDT                                                          */
        __IOM uint32_t WWDT : 1; /*!< [10..10] desc WWDT                                                        */
      } DEBUG_f;
    };

    union
    {
      __IOM uint32_t AHBEN; /*!< (@ 0x00000030) desc AHBEN                                                 */

      struct
      {
        __IOM uint32_t DMA : 1;   /*!< [0..0] desc DMA                                                           */
        __IOM uint32_t FLASH : 1; /*!< [1..1] desc FLASH                                                         */
        __IOM uint32_t CRC : 1;   /*!< [2..2] desc CRC                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t GPIOA : 1; /*!< [4..4] desc GPIOA                                                         */
        __IOM uint32_t GPIOB : 1; /*!< [5..5] desc GPIOB                                                         */
        __IOM uint32_t GPIOC : 1; /*!< [6..6] desc GPIOC                                                         */
        __IM uint32_t : 2;
        __IOM uint32_t GPIOF : 1; /*!< [9..9] desc GPIOF                                                         */
        __IOM uint32_t : 1;       /*!< [10..10] desc                                                             */
        __IOM uint32_t : 1;       /*!< [11..11] desc                                                           */
        __IM uint32_t : 20;
      } AHBEN_f;
    };

    union
    {
      __IOM uint32_t APBEN2; /*!< (@ 0x00000034) desc APBEN2                                                */

      struct
      {
        __IM uint32_t : 2;
        __IOM uint32_t ADC : 1; /*!< [2..2] desc ADC                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t VC : 1; /*!< [4..4] desc VC                                                            */
        __IM uint32_t : 2;
        __IOM uint32_t ATIM : 1;  /*!< [7..7] desc ATIM                                                          */
        __IOM uint32_t SPI1 : 1;  /*!< [8..8] desc SPI1                                                          */
        __IOM uint32_t UART1 : 1; /*!< [9..9] desc UART1                                                         */
        __IOM uint32_t : 1;       /*!< [10..10] desc                                                             */
        __IOM uint32_t : 1;       /*!< [11..11] desc                                                             */
        __IOM uint32_t BTIM : 1;  /*!< [12..12] desc BTIM                                                        */
        __IOM uint32_t AWT : 1;   /*!< [13..13] desc AWT                                                         */
        __IM uint32_t : 18;
      } APBEN2_f;
    };

    union
    {
      __IOM uint32_t APBEN1; /*!< (@ 0x00000038) desc APBEN1                                                */

      struct
      {
        __IM uint32_t : 1;
        __IOM uint32_t GTIM1 : 1; /*!< [1..1] desc GTIM1                                                         */
        __IOM uint32_t GTIM2 : 1; /*!< [2..2] desc GTIM2                                                         */
        __IOM uint32_t RTC : 1;   /*!< [3..3] desc RTC                                                           */
        __IOM uint32_t WWDT : 1;  /*!< [4..4] desc WWDT                                                          */
        __IOM uint32_t IWDT : 1;  /*!< [5..5] desc IWDT                                                          */
        __IOM uint32_t : 1;       /*!< [6..6] desc                                                               */
        __IOM uint32_t UART2 : 1; /*!< [7..7] desc UART2                                                         */
        __IOM uint32_t UART3 : 1; /*!< [8..8] desc UART3                                                         */
        __IOM uint32_t : 1;       /*!< [9..9] desc                                                               */
        __IOM uint32_t : 1;       /*!< [10..10] desc                                                             */
        __IOM uint32_t I2C1 : 1;  /*!< [11..11] desc I2C1                                                        */
      } APBEN1_f;
    };
    __IM uint32_t RESERVED;

    union
    {
      __IOM uint32_t AHBRST; /*!< (@ 0x00000040) desc AHBRST                                                */

      struct
      {
        __IOM uint32_t DMA : 1;   /*!< [0..0] desc DMA                                                           */
        __IOM uint32_t FLASH : 1; /*!< [1..1] desc FLASH                                                         */
        __IOM uint32_t CRC : 1;   /*!< [2..2] desc CRC                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t GPIOA : 1; /*!< [4..4] desc GPIOA                                                         */
        __IOM uint32_t GPIOB : 1; /*!< [5..5] desc GPIOB                                                         */
        __IOM uint32_t GPIOC : 1; /*!< [6..6] desc GPIOC                                                         */
        __IM uint32_t : 2;
        __IOM uint32_t GPIOF : 1; /*!< [9..9] desc GPIOF                                                         */
        __IOM uint32_t : 1;       /*!< [10..10] desc                                                             */
        __IOM uint32_t : 1;       /*!< [11..11] desc                                                           */
        __IM uint32_t : 20;
      } AHBRST_f;
    };

    union
    {
      __IOM uint32_t APBRST2; /*!< (@ 0x00000044) desc APBRST2                                               */

      struct
      {
        __IM uint32_t : 1;
        __IOM uint32_t : 1;     /*!< [1..1] desc                                                               */
        __IOM uint32_t ADC : 1; /*!< [2..2] desc ADC                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t VC : 1; /*!< [4..4] desc VC                                                            */
        __IM uint32_t : 2;
        __IOM uint32_t ATIM : 1;  /*!< [7..7] desc ATIM                                                          */
        __IOM uint32_t SPI1 : 1;  /*!< [8..8] desc SPI1                                                          */
        __IOM uint32_t UART1 : 1; /*!< [9..9] desc UART1                                                         */
        __IOM uint32_t : 1;       /*!< [10..10] desc                                                             */
        __IOM uint32_t : 1;       /*!< [11..11] desc                                                             */
        __IOM uint32_t BTIM : 1;  /*!< [12..12] desc BTIM                                                        */
        __IOM uint32_t AWT : 1;   /*!< [13..13] desc AWT                                                         */
        __IM uint32_t : 18;
      } APBRST2_f;
    };

    union
    {
      __IOM uint32_t APBRST1; /*!< (@ 0x00000048) desc APBRST1                                               */

      struct
      {
        __IM uint32_t : 1;
        __IOM uint32_t GTIM1 : 1; /*!< [1..1] desc GTIM1                                                         */
        __IOM uint32_t GTIM2 : 1; /*!< [2..2] desc GTIM2                                                         */
        __IOM uint32_t RTC : 1;   /*!< [3..3] desc RTC                                                           */
        __IOM uint32_t WWDT : 1;  /*!< [4..4] desc WWDT                                                          */
        __IOM uint32_t IWDT : 1;  /*!< [5..5] desc IWDT                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t UART2 : 1; /*!< [7..7] desc UART2                                                         */
        __IOM uint32_t UART3 : 1; /*!< [8..8] desc UART3                                                         */
        __IM uint32_t : 2;
        __IOM uint32_t I2C1 : 1; /*!< [11..11] desc I2C1                                                        */
      } APBRST1_f;
    };

    union
    {
      __IOM uint32_t RESETFLAG; /*!< (@ 0x0000004C) desc RESETFLAG                                             */

      struct
      {
        __IOM uint32_t POR : 1; /*!< [0..0] desc POR                                                           */
        __IOM uint32_t : 1;     /*!< [1..1] desc                                                               */
        __IM uint32_t : 1;
        __IOM uint32_t LVD : 1;  /*!< [3..3] desc LVD                                                           */
        __IOM uint32_t IWDT : 1; /*!< [4..4] desc IWDT                                                          */
        __IOM uint32_t WWDT : 1; /*!< [5..5] desc WWDT                                                          */
        __IOM uint32_t RSTB : 1; /*!< [6..6] desc RSTB                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t LOCKUP : 1;      /*!< [8..8] desc LOCKUP                                                        */
        __IOM uint32_t SYSRESETREQ : 1; /*!< [9..9] desc SYSRESETREQ                                                   */
        __IM uint32_t : 22;
      } RESETFLAG_f;
    };

    union
    {
      __IOM uint32_t GTIM1CAP; /*!< (@ 0x00000050) desc GTIM1CAP                                              */

      struct
      {
        __IOM uint32_t CH1 : 3; /*!< [2..0] desc CH1                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t CH2 : 3; /*!< [6..4] desc CH2                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t CH3 : 3; /*!< [10..8] desc CH3                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t CH4 : 3; /*!< [14..12] desc CH4                                                         */
        __IM uint32_t : 17;
      } GTIM1CAP_f;
    };

    union
    {
      __IOM uint32_t GTIM2CAP; /*!< (@ 0x00000054) desc GTIM2CAP                                              */

      struct
      {
        __IOM uint32_t CH1 : 3; /*!< [2..0] desc CH1                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t CH2 : 3; /*!< [6..4] desc CH2                                                           */
        __IM uint32_t : 1;
        __IOM uint32_t CH3 : 3; /*!< [10..8] desc CH3                                                          */
        __IM uint32_t : 1;
        __IOM uint32_t CH4 : 3; /*!< [14..12] desc CH4                                                         */
        __IM uint32_t : 17;
      } GTIM2CAP_f;
    };
    __IM uint32_t RESERVED1[2];

    union
    {
      __IOM uint32_t ATIMETR; /*!< (@ 0x00000060) desc ATIMETR                                               */

      struct
      {
        __IOM uint32_t ATIMETR : 3; /*!< [2..0] desc ATIMETR                                                       */
        __IM uint32_t : 29;
      } ATIMETR_f;
    };

    union
    {
      __IOM uint32_t GTIMETR; /*!< (@ 0x00000064) desc GTIMETR                                               */

      struct
      {
        __IOM uint32_t GTIM1ETR : 3; /*!< [2..0] desc GTIM1ETR                                                      */
        __IM uint32_t : 1;
        __IOM uint32_t GTIM2ETR : 3; /*!< [6..4] desc GTIM2ETR                                                      */
        __IM uint32_t : 1;
        __IOM uint32_t : 3; /*!< [10..8] desc                                                      */
        __IM uint32_t : 1;
        __IOM uint32_t : 3; /*!< [14..12] desc                                                     */
        __IM uint32_t : 17;
      } GTIMETR_f;
    };
    __IM uint32_t RESERVED2;

    union
    {
      __IOM uint32_t TIMITR; /*!< (@ 0x0000006C) desc TIMITR                                                */

      struct
      {
        __IOM uint32_t ATIMITR : 3;  /*!< [2..0] desc ATIMITR                                                       */
        __IOM uint32_t GTIM1ITR : 3; /*!< [5..3] desc GTIM1ITR                                                      */
        __IOM uint32_t GTIM2ITR : 3; /*!< [8..6] desc GTIM2ITR                                                      */
        __IOM uint32_t : 3;          /*!< [11..9] desc                                                              */
        __IOM uint32_t : 3;          /*!< [14..12] desc                                                             */
        __IOM uint32_t BTIM1ITR : 3; /*!< [17..15] desc BTIM1ITR                                                    */
        __IOM uint32_t BTIM2ITR : 3; /*!< [20..18] desc BTIM2ITR                                                    */
        __IOM uint32_t BTIM3ITR : 3; /*!< [23..21] desc BTIM3ITR                                                    */
        __IM uint32_t : 8;
      } TIMITR_f;
    };

    union
    {
      __IOM uint32_t MCO; /*!< (@ 0x00000070) desc MCO                                                   */

      struct
      {
        __IOM uint32_t SOURCE : 4; /*!< [3..0] desc SOURCE                                                        */
        __IOM uint32_t DIV : 3;    /*!< [6..4] desc DIV                                                           */
        __IM uint32_t : 25;
      } MCO_f;
    };

    union
    {
      __IOM uint32_t IRMOD; /*!< (@ 0x00000074) desc IRMOD                                                 */

      struct
      {
        __IOM uint32_t MOD : 4; /*!< [3..0] desc MOD                                                           */
        __IM uint32_t : 28;
      } IRMOD_f;
    };
  } SYSCTRL_TypeDef; /*!< Size = 120 (0x78)                                                         */

  /* =========================================================================================================================== */
  /* ================                                           UART1                                           ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc UART1 (UART1)
   */

  typedef struct
  { /*!< (@ 0x40013800) UART1 Structure                                            */

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000000) desc CR1                                                   */

      struct
      {
        __IOM uint32_t TXEN : 1;   /*!< [0..0] desc TXEN                                                          */
        __IOM uint32_t RXEN : 1;   /*!< [1..1] desc RXEN                                                          */
        __IOM uint32_t PARITY : 2; /*!< [3..2] desc PARITY                                                        */
        __IOM uint32_t STOP : 2;   /*!< [5..4] desc STOP                                                          */
        __IOM uint32_t SYNC : 1;   /*!< [6..6] desc SYNC                                                          */
        __IOM uint32_t LINEN : 1;  /*!< [7..7] desc LINEN                                                         */
        __IOM uint32_t START : 1;  /*!< [8..8] desc START                                                         */
        __IOM uint32_t OVER : 2;   /*!< [10..9] desc OVER                                                         */
        __IOM uint32_t TXBRK : 1;  /*!< [11..11] desc TXBRK                                                       */
        __IOM uint32_t BRKLEN : 1; /*!< [12..12] desc BRKLEN                                                      */
      } CR1_f;
    };

    union
    {
      __IOM uint32_t CR2; /*!< (@ 0x00000004) desc CR2                                                   */

      struct
      {
        __IOM uint32_t ADDREN : 1; /*!< [0..0] desc ADDREN                                                        */
        __IOM uint32_t SIGNAL : 1; /*!< [1..1] desc SIGNAL                                                        */
        __IOM uint32_t CTSEN : 1;  /*!< [2..2] desc CTSEN                                                         */
        __IOM uint32_t RTSEN : 1;  /*!< [3..3] desc RTSEN                                                         */
        __IOM uint32_t RXINV : 1;  /*!< [4..4] desc RXINV                                                         */
        __IOM uint32_t TXINV : 1;  /*!< [5..5] desc TXINV                                                         */
        __IOM uint32_t DMARX : 1;  /*!< [6..6] desc DMARX                                                         */
        __IOM uint32_t DMATX : 1;  /*!< [7..7] desc DMATX                                                         */
        __IOM uint32_t SOURCE : 2; /*!< [9..8] desc SOURCE                                                        */
        __IOM uint32_t TIMCR : 3;  /*!< [12..10] desc TIMCR                                                       */
      } CR2_f;
    };

    union
    {
      __IOM uint32_t IER; /*!< (@ 0x00000008) desc IER                                                   */

      struct
      {
        __IOM uint32_t TXE : 1; /*!< [0..0] TxBuf empty                                                        */
        __IOM uint32_t TC : 1;  /*!< [1..1] Transmit complete                                                  */
        __IOM uint32_t RC : 1;  /*!< [2..2] Receive complete                                                   */
        __IOM uint32_t FE : 1;  /*!< [3..3] Frame error                                                        */
        __IOM uint32_t PE : 1;  /*!< [4..4] Parity error                                                       */
        __IM uint32_t : 1;
        __IOM uint32_t CTS : 1; /*!< [6..6] CTS change                                                         */
        __IM uint32_t : 2;
        __IOM uint32_t TIMOV : 1; /*!< [9..9] desc TIMOV                                                         */
        __IOM uint32_t BAUD : 1;  /*!< [10..10] desc BAUD                                                        */
        __IOM uint32_t RXBRK : 1; /*!< [11..11] desc RXBRK                                                       */
      } IER_f;
    };

    union
    {
      __IOM uint32_t BRRI; /*!< (@ 0x0000000C) desc BRRI                                                  */

      struct
      {
        __IOM uint32_t BRRI : 16; /*!< [15..0] desc BRRI                                                         */
        __IM uint32_t : 16;
      } BRRI_f;
    };

    union
    {
      __IOM uint32_t BRRF; /*!< (@ 0x00000010) desc BRRF                                                  */

      struct
      {
        __IOM uint32_t BRRF : 4; /*!< [3..0] desc BRRF                                                          */
        __IM uint32_t : 28;
      } BRRF_f;
    };

    union
    {
      __IOM uint32_t TIMARR; /*!< (@ 0x00000014) desc TIMARR                                                */

      struct
      {
        __IOM uint32_t TIMARR : 24; /*!< [23..0] desc TIMARR                                                       */
      } TIMARR_f;
    };

    union
    {
      __IOM uint32_t TIMCNT; /*!< (@ 0x00000018) desc TIMCNT                                                */

      struct
      {
        __IOM uint32_t TIMCNT : 24; /*!< [23..0] desc TIMCNT                                                       */
      } TIMCNT_f;
    };

    union
    {
      __IM uint32_t ISR; /*!< (@ 0x0000001C) desc ISR                                                   */

      struct
      {
        __IM uint32_t TXE : 1;    /*!< [0..0] TxBuf empty                                                        */
        __IM uint32_t TC : 1;     /*!< [1..1] Transmit complete                                                  */
        __IM uint32_t RC : 1;     /*!< [2..2] Receive complete                                                   */
        __IM uint32_t FE : 1;     /*!< [3..3] Frame error                                                        */
        __IM uint32_t PE : 1;     /*!< [4..4] Parity error                                                       */
        __IM uint32_t MATCH : 1;  /*!< [5..5] Slave addr match                                                   */
        __IM uint32_t CTS : 1;    /*!< [6..6] CTS change                                                         */
        __IM uint32_t CTSLV : 1;  /*!< [7..7] CTS PIN level                                                      */
        __IM uint32_t TXBUSY : 1; /*!< [8..8] desc TXBUSY                                                        */
        __IM uint32_t TIMOV : 1;  /*!< [9..9] desc TIMOV                                                         */
        __IM uint32_t BAUD : 1;   /*!< [10..10] desc BAUD                                                        */
        __IM uint32_t RXBRK : 1;  /*!< [11..11] desc RXBRK                                                       */
      } ISR_f;
    };

    union
    {
      __IOM uint32_t ICR; /*!< (@ 0x00000020) desc ICR                                                   */

      struct
      {
        __IM uint32_t : 1;
        __IOM uint32_t TC : 1; /*!< [1..1] Transmit complete                                                  */
        __IOM uint32_t RC : 1; /*!< [2..2] Receive complete                                                   */
        __IOM uint32_t FE : 1; /*!< [3..3] Frame error                                                        */
        __IOM uint32_t PE : 1; /*!< [4..4] Parity error                                                       */
        __IM uint32_t : 1;
        __IOM uint32_t CTS : 1; /*!< [6..6] CTS change                                                         */
        __IM uint32_t : 2;
        __IOM uint32_t TIMOV : 1; /*!< [9..9] desc TIMOV                                                         */
        __IOM uint32_t BAUD : 1;  /*!< [10..10] desc BAUD                                                        */
        __IOM uint32_t RXBRK : 1; /*!< [11..11] desc RXBRK                                                       */
      } ICR_f;
    };

    union
    {
      __IM uint32_t RDR; /*!< (@ 0x00000024) desc RDR                                                   */

      struct
      {
        __IM uint32_t RDR : 9; /*!< [8..0] desc RDR                                                           */
        __IM uint32_t : 23;
      } RDR_f;
    };

