VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031.h
    union
    {
      __OM uint32_t TDR; /*!< (@ 0x00000028) desc TDR                                                   */

      struct
      {
        __OM uint32_t TDR : 9; /*!< [8..0] desc TDR                                                           */
        __IM uint32_t : 23;
      } TDR_f;
    };
    __IM uint32_t RESERVED1;

    union
    {
      __IOM uint32_t ADDR; /*!< (@ 0x00000030) desc ADDR                                                  */

      struct
      {
        __IOM uint32_t ADDR : 8; /*!< [7..0] desc ADDR                                                          */
        __IM uint32_t : 24;
      } ADDR_f;
    };

    union
    {
      __IOM uint32_t MASK; /*!< (@ 0x00000034) desc MASK                                                  */

      struct
      {
        __IOM uint32_t MASK : 8; /*!< [7..0] desc MASK                                                          */
        __IM uint32_t : 24;
      } MASK_f;
    };
  } UART_TypeDef; /*!< Size = 56 (0x38)                                                          */

  /* =========================================================================================================================== */
  /* ================                                            VC1                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc VC1 (VC1)
   */

  typedef struct
  { /*!< (@ 0x40012A00) VC1 Structure                                              */

    union
    {
      __IOM uint32_t DIV; /*!< (@ 0x00000000) desc DIV                                                   */

      struct
      {
        __IOM uint32_t DIV : 6; /*!< [5..0] desc DIV                                                           */
        __IOM uint32_t EN : 1;  /*!< [6..6] desc EN                                                            */
        __IOM uint32_t VIN : 1; /*!< [7..7] desc VIN                                                           */
        __IM uint32_t : 24;
      } DIV_f;
    };

    union
    {
      __IOM uint32_t CR0; /*!< (@ 0x00000004) desc CR0                                                   */

      struct
      {
        __IOM uint32_t EN : 1;     /*!< [0..0] desc EN                                                            */
        __IOM uint32_t RESP : 2;   /*!< [2..1] desc RESP                                                          */
        __IOM uint32_t HYS : 2;    /*!< [4..3] desc HYS                                                           */
        __IOM uint32_t IE : 1;     /*!< [5..5] desc IE                                                            */
        __IOM uint32_t POL : 1;    /*!< [6..6] desc POL                                                           */
        __IOM uint32_t WINDOW : 1; /*!< [7..7] desc WINDOW                                                        */
        __IOM uint32_t INP : 4;    /*!< [11..8] desc INP                                                          */
        __IOM uint32_t INN : 4;    /*!< [15..12] desc INN                                                         */
        __IM uint32_t : 16;
      } CR0_f;
    };

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000008) desc CR1                                                   */

      struct
      {
        __IOM uint32_t FLTEN : 1;     /*!< [0..0] desc FLTEN                                                         */
        __IOM uint32_t FLTTIME : 3;   /*!< [3..1] desc FLTTIME                                                       */
        __IOM uint32_t FLTCLK : 1;    /*!< [4..4] desc FLTCLK                                                        */
        __IOM uint32_t FALLIE : 1;    /*!< [5..5] desc FALLIE                                                        */
        __IOM uint32_t RISEIE : 1;    /*!< [6..6] desc RISEIE                                                        */
        __IOM uint32_t HIGHIE : 1;    /*!< [7..7] desc HIGHIE                                                        */
        __IOM uint32_t ATIMCLR : 1;   /*!< [8..8] desc ATIMCLR                                                       */
        __IOM uint32_t ATIMBK : 1;    /*!< [9..9] desc ATIMBK                                                        */
        __IOM uint32_t BLANKCH1B : 1; /*!< [10..10] desc BLANKCH1B                                                   */
        __IOM uint32_t BLANKCH2B : 1; /*!< [11..11] desc BLANKCH2B                                                   */
        __IOM uint32_t BLANKCH3B : 1; /*!< [12..12] desc BLANKCH3B                                                   */
        __IOM uint32_t BLANKFLT : 3;  /*!< [15..13] desc BLANKFLT                                                    */
        __IM uint32_t : 16;
      } CR1_f;
    };

    union
    {
      __IOM uint32_t SR; /*!< (@ 0x0000000C) desc SR                                                    */

      struct
      {
        __IOM uint32_t INTF : 1; /*!< [0..0] desc INTF                                                          */
        __IM uint32_t FLTV : 1;  /*!< [1..1] desc FLTV                                                          */
        __IM uint32_t READY : 1; /*!< [2..2] desc READY                                                         */
        __IM uint32_t : 29;
      } SR_f;
    };
  } VC_TypeDef; /*!< Size = 16 (0x10)                                                          */

  /* =========================================================================================================================== */
  /* ================                                           WWDT                                            ================ */
  /* =========================================================================================================================== */

  /**
   * @brief desc WWDT (WWDT)
   */

  typedef struct
  { /*!< (@ 0x40002C00) WWDT Structure                                             */

    union
    {
      __IOM uint32_t CR0; /*!< (@ 0x00000000) desc CR0                                                   */

      struct
      {
        __IOM uint32_t WCNT : 7; /*!< [6..0] desc WCNT                                                          */
        __IOM uint32_t EN : 1;   /*!< [7..7] desc EN                                                            */
        __IM uint32_t : 24;
      } CR0_f;
    };

    union
    {
      __IOM uint32_t CR1; /*!< (@ 0x00000004) desc CR1                                                   */

      struct
      {
        __IOM uint32_t WINR : 7; /*!< [6..0] desc WINR                                                          */
        __IOM uint32_t PRS : 3;  /*!< [9..7] desc PRS                                                           */
        __IOM uint32_t IE : 1;   /*!< [10..10] desc IE                                                          */
        __IM uint32_t : 21;
      } CR1_f;
    };

    union
    {
      __IOM uint32_t SR; /*!< (@ 0x00000008) desc SR                                                    */

      struct
      {
        __IOM uint32_t POV : 1; /*!< [0..0] desc POV                                                           */
        __IM uint32_t : 31;
      } SR_f;
    };
  } WWDT_TypeDef; /*!< Size = 12 (0xc)                                                           */

