VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031.h
/* ==========================================================  ISR  ========================================================== */
#define DMA_ISR_TE4_Pos (13UL)     /*!< TE4 (Bit 13)                                          */
#define DMA_ISR_TE4_Msk (0x2000UL) /*!< TE4 (Bitfield-Mask: 0x01)                             */
#define DMA_ISR_TC4_Pos (12UL)     /*!< TC4 (Bit 12)                                          */
#define DMA_ISR_TC4_Msk (0x1000UL) /*!< TC4 (Bitfield-Mask: 0x01)                             */
#define DMA_ISR_TE3_Pos (9UL)      /*!< TE3 (Bit 9)                                           */
#define DMA_ISR_TE3_Msk (0x200UL)  /*!< TE3 (Bitfield-Mask: 0x01)                             */
#define DMA_ISR_TC3_Pos (8UL)      /*!< TC3 (Bit 8)                                           */
#define DMA_ISR_TC3_Msk (0x100UL)  /*!< TC3 (Bitfield-Mask: 0x01)                             */
#define DMA_ISR_TE2_Pos (5UL)      /*!< TE2 (Bit 5)                                           */
#define DMA_ISR_TE2_Msk (0x20UL)   /*!< TE2 (Bitfield-Mask: 0x01)                             */
#define DMA_ISR_TC2_Pos (4UL)      /*!< TC2 (Bit 4)                                           */
#define DMA_ISR_TC2_Msk (0x10UL)   /*!< TC2 (Bitfield-Mask: 0x01)                             */
#define DMA_ISR_TE1_Pos (1UL)      /*!< TE1 (Bit 1)                                           */
#define DMA_ISR_TE1_Msk (0x2UL)    /*!< TE1 (Bitfield-Mask: 0x01)                             */
#define DMA_ISR_TC1_Pos (0UL)      /*!< TC1 (Bit 0)                                           */
#define DMA_ISR_TC1_Msk (0x1UL)    /*!< TC1 (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define DMA_ICR_TE4_Pos (13UL)     /*!< TE4 (Bit 13)                                          */
#define DMA_ICR_TE4_Msk (0x2000UL) /*!< TE4 (Bitfield-Mask: 0x01)                             */
#define DMA_ICR_TC4_Pos (12UL)     /*!< TC4 (Bit 12)                                          */
#define DMA_ICR_TC4_Msk (0x1000UL) /*!< TC4 (Bitfield-Mask: 0x01)                             */
#define DMA_ICR_TE3_Pos (9UL)      /*!< TE3 (Bit 9)                                           */
#define DMA_ICR_TE3_Msk (0x200UL)  /*!< TE3 (Bitfield-Mask: 0x01)                             */
#define DMA_ICR_TC3_Pos (8UL)      /*!< TC3 (Bit 8)                                           */
#define DMA_ICR_TC3_Msk (0x100UL)  /*!< TC3 (Bitfield-Mask: 0x01)                             */
#define DMA_ICR_TE2_Pos (5UL)      /*!< TE2 (Bit 5)                                           */
#define DMA_ICR_TE2_Msk (0x20UL)   /*!< TE2 (Bitfield-Mask: 0x01)                             */
#define DMA_ICR_TC2_Pos (4UL)      /*!< TC2 (Bit 4)                                           */
#define DMA_ICR_TC2_Msk (0x10UL)   /*!< TC2 (Bitfield-Mask: 0x01)                             */
#define DMA_ICR_TE1_Pos (1UL)      /*!< TE1 (Bit 1)                                           */
#define DMA_ICR_TE1_Msk (0x2UL)    /*!< TE1 (Bitfield-Mask: 0x01)                             */
#define DMA_ICR_TC1_Pos (0UL)      /*!< TC1 (Bit 0)                                           */
#define DMA_ICR_TC1_Msk (0x1UL)    /*!< TC1 (Bitfield-Mask: 0x01)                             */
/* =========================================================  CSR1  ========================================================== */
#define DMA_CSR1_STATUS_Pos (8UL)     /*!< STATUS (Bit 8)                                        */
#define DMA_CSR1_STATUS_Msk (0x700UL) /*!< STATUS (Bitfield-Mask: 0x07)                          */
#define DMA_CSR1_SIZE_Pos (6UL)       /*!< SIZE (Bit 6)                                          */
#define DMA_CSR1_SIZE_Msk (0xc0UL)    /*!< SIZE (Bitfield-Mask: 0x03)                            */
#define DMA_CSR1_DSTINC_Pos (5UL)     /*!< DSTINC (Bit 5)                                        */
#define DMA_CSR1_DSTINC_Msk (0x20UL)  /*!< DSTINC (Bitfield-Mask: 0x01)                          */
#define DMA_CSR1_SRCINC_Pos (4UL)     /*!< SRCINC (Bit 4)                                        */
#define DMA_CSR1_SRCINC_Msk (0x10UL)  /*!< SRCINC (Bitfield-Mask: 0x01)                          */
#define DMA_CSR1_TRANS_Pos (3UL)      /*!< TRANS (Bit 3)                                         */
#define DMA_CSR1_TRANS_Msk (0x8UL)    /*!< TRANS (Bitfield-Mask: 0x01)                           */
#define DMA_CSR1_TEIE_Pos (2UL)       /*!< TEIE (Bit 2)                                          */
#define DMA_CSR1_TEIE_Msk (0x4UL)     /*!< TEIE (Bitfield-Mask: 0x01)                            */
#define DMA_CSR1_TCIE_Pos (1UL)       /*!< TCIE (Bit 1)                                          */
#define DMA_CSR1_TCIE_Msk (0x2UL)     /*!< TCIE (Bitfield-Mask: 0x01)                            */
#define DMA_CSR1_EN_Pos (0UL)         /*!< EN (Bit 0)                                            */
#define DMA_CSR1_EN_Msk (0x1UL)       /*!< EN (Bitfield-Mask: 0x01)                              */
/* =========================================================  CNT1  ========================================================== */
#define DMA_CNT1_REPEAT_Pos (16UL)      /*!< REPEAT (Bit 16)                                       */
#define DMA_CNT1_REPEAT_Msk (0xf0000UL) /*!< REPEAT (Bitfield-Mask: 0x0f)                          */
#define DMA_CNT1_CNT_Pos (0UL)          /*!< CNT (Bit 0)                                           */
#define DMA_CNT1_CNT_Msk (0xffffUL)     /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  SRCADDR1  ======================================================== */
#define DMA_SRCADDR1_SRCADDR_Pos (0UL)          /*!< SRCADDR (Bit 0)                                       */
#define DMA_SRCADDR1_SRCADDR_Msk (0xffffffffUL) /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  DSTADDR1  ======================================================== */
#define DMA_DSTADDR1_DSTADDR_Pos (0UL)          /*!< DSTADDR (Bit 0)                                       */
#define DMA_DSTADDR1_DSTADDR_Msk (0xffffffffUL) /*!< DSTADDR (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  TRIG1  ========================================================= */
#define DMA_TRIG1_HARDSRC_Pos (2UL)    /*!< HARDSRC (Bit 2)                                       */
#define DMA_TRIG1_HARDSRC_Msk (0xfcUL) /*!< HARDSRC (Bitfield-Mask: 0x3f)                         */
#define DMA_TRIG1_SOFTSRC_Pos (1UL)    /*!< SOFTSRC (Bit 1)                                       */
#define DMA_TRIG1_SOFTSRC_Msk (0x2UL)  /*!< SOFTSRC (Bitfield-Mask: 0x01)                         */
#define DMA_TRIG1_TYPE_Pos (0UL)       /*!< TYPE (Bit 0)                                          */
#define DMA_TRIG1_TYPE_Msk (0x1UL)     /*!< TYPE (Bitfield-Mask: 0x01)                            */
/* =========================================================  CSR2  ========================================================== */
#define DMA_CSR2_STATUS_Pos (8UL)     /*!< STATUS (Bit 8)                                        */
#define DMA_CSR2_STATUS_Msk (0x700UL) /*!< STATUS (Bitfield-Mask: 0x07)                          */
#define DMA_CSR2_SIZE_Pos (6UL)       /*!< SIZE (Bit 6)                                          */
#define DMA_CSR2_SIZE_Msk (0xc0UL)    /*!< SIZE (Bitfield-Mask: 0x03)                            */
#define DMA_CSR2_DSTINC_Pos (5UL)     /*!< DSTINC (Bit 5)                                        */
#define DMA_CSR2_DSTINC_Msk (0x20UL)  /*!< DSTINC (Bitfield-Mask: 0x01)                          */
#define DMA_CSR2_SRCINC_Pos (4UL)     /*!< SRCINC (Bit 4)                                        */
#define DMA_CSR2_SRCINC_Msk (0x10UL)  /*!< SRCINC (Bitfield-Mask: 0x01)                          */
#define DMA_CSR2_TRANS_Pos (3UL)      /*!< TRANS (Bit 3)                                         */
#define DMA_CSR2_TRANS_Msk (0x8UL)    /*!< TRANS (Bitfield-Mask: 0x01)                           */
#define DMA_CSR2_TEIE_Pos (2UL)       /*!< TEIE (Bit 2)                                          */
#define DMA_CSR2_TEIE_Msk (0x4UL)     /*!< TEIE (Bitfield-Mask: 0x01)                            */
#define DMA_CSR2_TCIE_Pos (1UL)       /*!< TCIE (Bit 1)                                          */
#define DMA_CSR2_TCIE_Msk (0x2UL)     /*!< TCIE (Bitfield-Mask: 0x01)                            */
#define DMA_CSR2_EN_Pos (0UL)         /*!< EN (Bit 0)                                            */
#define DMA_CSR2_EN_Msk (0x1UL)       /*!< EN (Bitfield-Mask: 0x01)                              */
/* =========================================================  CNT2  ========================================================== */
#define DMA_CNT2_REPEAT_Pos (16UL)      /*!< REPEAT (Bit 16)                                       */
#define DMA_CNT2_REPEAT_Msk (0xf0000UL) /*!< REPEAT (Bitfield-Mask: 0x0f)                          */
#define DMA_CNT2_CNT_Pos (0UL)          /*!< CNT (Bit 0)                                           */
#define DMA_CNT2_CNT_Msk (0xffffUL)     /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  SRCADDR2  ======================================================== */
#define DMA_SRCADDR2_SRCADDR_Pos (0UL)          /*!< SRCADDR (Bit 0)                                       */
#define DMA_SRCADDR2_SRCADDR_Msk (0xffffffffUL) /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  DSTADDR2  ======================================================== */
#define DMA_DSTADDR2_DSTADDR_Pos (0UL)          /*!< DSTADDR (Bit 0)                                       */
#define DMA_DSTADDR2_DSTADDR_Msk (0xffffffffUL) /*!< DSTADDR (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  TRIG2  ========================================================= */
#define DMA_TRIG2_HARDSRC_Pos (2UL)    /*!< HARDSRC (Bit 2)                                       */
#define DMA_TRIG2_HARDSRC_Msk (0xfcUL) /*!< HARDSRC (Bitfield-Mask: 0x3f)                         */
#define DMA_TRIG2_SOFTSRC_Pos (1UL)    /*!< SOFTSRC (Bit 1)                                       */
#define DMA_TRIG2_SOFTSRC_Msk (0x2UL)  /*!< SOFTSRC (Bitfield-Mask: 0x01)                         */
#define DMA_TRIG2_TYPE_Pos (0UL)       /*!< TYPE (Bit 0)                                          */
#define DMA_TRIG2_TYPE_Msk (0x1UL)     /*!< TYPE (Bitfield-Mask: 0x01)                            */
/* =========================================================  CSR3  ========================================================== */
#define DMA_CSR3_STATUS_Pos (8UL)     /*!< STATUS (Bit 8)                                        */
#define DMA_CSR3_STATUS_Msk (0x700UL) /*!< STATUS (Bitfield-Mask: 0x07)                          */
#define DMA_CSR3_SIZE_Pos (6UL)       /*!< SIZE (Bit 6)                                          */
#define DMA_CSR3_SIZE_Msk (0xc0UL)    /*!< SIZE (Bitfield-Mask: 0x03)                            */
#define DMA_CSR3_DSTINC_Pos (5UL)     /*!< DSTINC (Bit 5)                                        */
#define DMA_CSR3_DSTINC_Msk (0x20UL)  /*!< DSTINC (Bitfield-Mask: 0x01)                          */
#define DMA_CSR3_SRCINC_Pos (4UL)     /*!< SRCINC (Bit 4)                                        */
#define DMA_CSR3_SRCINC_Msk (0x10UL)  /*!< SRCINC (Bitfield-Mask: 0x01)                          */
#define DMA_CSR3_TRANS_Pos (3UL)      /*!< TRANS (Bit 3)                                         */
#define DMA_CSR3_TRANS_Msk (0x8UL)    /*!< TRANS (Bitfield-Mask: 0x01)                           */
#define DMA_CSR3_TEIE_Pos (2UL)       /*!< TEIE (Bit 2)                                          */
#define DMA_CSR3_TEIE_Msk (0x4UL)     /*!< TEIE (Bitfield-Mask: 0x01)                            */
#define DMA_CSR3_TCIE_Pos (1UL)       /*!< TCIE (Bit 1)                                          */
#define DMA_CSR3_TCIE_Msk (0x2UL)     /*!< TCIE (Bitfield-Mask: 0x01)                            */
#define DMA_CSR3_EN_Pos (0UL)         /*!< EN (Bit 0)                                            */
#define DMA_CSR3_EN_Msk (0x1UL)       /*!< EN (Bitfield-Mask: 0x01)                              */
/* =========================================================  CNT3  ========================================================== */
#define DMA_CNT3_REPEAT_Pos (16UL)      /*!< REPEAT (Bit 16)                                       */
#define DMA_CNT3_REPEAT_Msk (0xf0000UL) /*!< REPEAT (Bitfield-Mask: 0x0f)                          */
#define DMA_CNT3_CNT_Pos (0UL)          /*!< CNT (Bit 0)                                           */
#define DMA_CNT3_CNT_Msk (0xffffUL)     /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  SRCADDR3  ======================================================== */
#define DMA_SRCADDR3_SRCADDR_Pos (0UL)          /*!< SRCADDR (Bit 0)                                       */
#define DMA_SRCADDR3_SRCADDR_Msk (0xffffffffUL) /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  DSTADDR3  ======================================================== */
#define DMA_DSTADDR3_DSTADDR_Pos (0UL)          /*!< DSTADDR (Bit 0)                                       */
#define DMA_DSTADDR3_DSTADDR_Msk (0xffffffffUL) /*!< DSTADDR (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  TRIG3  ========================================================= */
#define DMA_TRIG3_HARDSRC_Pos (2UL)    /*!< HARDSRC (Bit 2)                                       */
#define DMA_TRIG3_HARDSRC_Msk (0xfcUL) /*!< HARDSRC (Bitfield-Mask: 0x3f)                         */
#define DMA_TRIG3_SOFTSRC_Pos (1UL)    /*!< SOFTSRC (Bit 1)                                       */
#define DMA_TRIG3_SOFTSRC_Msk (0x2UL)  /*!< SOFTSRC (Bitfield-Mask: 0x01)                         */
#define DMA_TRIG3_TYPE_Pos (0UL)       /*!< TYPE (Bit 0)                                          */
#define DMA_TRIG3_TYPE_Msk (0x1UL)     /*!< TYPE (Bitfield-Mask: 0x01)                            */
/* =========================================================  CSR4  ========================================================== */
#define DMA_CSR4_STATUS_Pos (8UL)     /*!< STATUS (Bit 8)                                        */
#define DMA_CSR4_STATUS_Msk (0x700UL) /*!< STATUS (Bitfield-Mask: 0x07)                          */
#define DMA_CSR4_SIZE_Pos (6UL)       /*!< SIZE (Bit 6)                                          */
#define DMA_CSR4_SIZE_Msk (0xc0UL)    /*!< SIZE (Bitfield-Mask: 0x03)                            */
#define DMA_CSR4_DSTINC_Pos (5UL)     /*!< DSTINC (Bit 5)                                        */
#define DMA_CSR4_DSTINC_Msk (0x20UL)  /*!< DSTINC (Bitfield-Mask: 0x01)                          */
#define DMA_CSR4_SRCINC_Pos (4UL)     /*!< SRCINC (Bit 4)                                        */
#define DMA_CSR4_SRCINC_Msk (0x10UL)  /*!< SRCINC (Bitfield-Mask: 0x01)                          */
#define DMA_CSR4_TRANS_Pos (3UL)      /*!< TRANS (Bit 3)                                         */
#define DMA_CSR4_TRANS_Msk (0x8UL)    /*!< TRANS (Bitfield-Mask: 0x01)                           */
#define DMA_CSR4_TEIE_Pos (2UL)       /*!< TEIE (Bit 2)                                          */
#define DMA_CSR4_TEIE_Msk (0x4UL)     /*!< TEIE (Bitfield-Mask: 0x01)                            */
#define DMA_CSR4_TCIE_Pos (1UL)       /*!< TCIE (Bit 1)                                          */
#define DMA_CSR4_TCIE_Msk (0x2UL)     /*!< TCIE (Bitfield-Mask: 0x01)                            */
#define DMA_CSR4_EN_Pos (0UL)         /*!< EN (Bit 0)                                            */
#define DMA_CSR4_EN_Msk (0x1UL)       /*!< EN (Bitfield-Mask: 0x01)                              */
/* =========================================================  CNT4  ========================================================== */
#define DMA_CNT4_REPEAT_Pos (16UL)      /*!< REPEAT (Bit 16)                                       */
#define DMA_CNT4_REPEAT_Msk (0xf0000UL) /*!< REPEAT (Bitfield-Mask: 0x0f)                          */
#define DMA_CNT4_CNT_Pos (0UL)          /*!< CNT (Bit 0)                                           */
#define DMA_CNT4_CNT_Msk (0xffffUL)     /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  SRCADDR4  ======================================================== */
#define DMA_SRCADDR4_SRCADDR_Pos (0UL)          /*!< SRCADDR (Bit 0)                                       */
#define DMA_SRCADDR4_SRCADDR_Msk (0xffffffffUL) /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  DSTADDR4  ======================================================== */
#define DMA_DSTADDR4_DSTADDR_Pos (0UL)          /*!< DSTADDR (Bit 0)                                       */
#define DMA_DSTADDR4_DSTADDR_Msk (0xffffffffUL) /*!< DSTADDR (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  TRIG4  ========================================================= */
#define DMA_TRIG4_HARDSRC_Pos (2UL)    /*!< HARDSRC (Bit 2)                                       */
#define DMA_TRIG4_HARDSRC_Msk (0xfcUL) /*!< HARDSRC (Bitfield-Mask: 0x3f)                         */
#define DMA_TRIG4_SOFTSRC_Pos (1UL)    /*!< SOFTSRC (Bit 1)                                       */
#define DMA_TRIG4_SOFTSRC_Msk (0x2UL)  /*!< SOFTSRC (Bitfield-Mask: 0x01)                         */
#define DMA_TRIG4_TYPE_Pos (0UL)       /*!< TYPE (Bit 0)                                          */
#define DMA_TRIG4_TYPE_Msk (0x1UL)     /*!< TYPE (Bitfield-Mask: 0x01)                            */

/* =========================================================================================================================== */
/* ================                                        DMACHANNEL                                         ================ */
/* =========================================================================================================================== */

/* ==========================================================  CSR  ========================================================== */
#define DMACHx_CSR_STATUS_Pos (8UL)     /*!< STATUS (Bit 8)                                        */
#define DMACHx_CSR_STATUS_Msk (0x700UL) /*!< STATUS (Bitfield-Mask: 0x07)                          */
#define DMACHx_CSR_SIZE_Pos (6UL)       /*!< SIZE (Bit 6)                                          */
#define DMACHx_CSR_SIZE_Msk (0xc0UL)    /*!< SIZE (Bitfield-Mask: 0x03)                            */
#define DMACHx_CSR_DSTINC_Pos (5UL)     /*!< DSTINC (Bit 5)                                        */
#define DMACHx_CSR_DSTINC_Msk (0x20UL)  /*!< DSTINC (Bitfield-Mask: 0x01)                          */
#define DMACHx_CSR_SRCINC_Pos (4UL)     /*!< SRCINC (Bit 4)                                        */
#define DMACHx_CSR_SRCINC_Msk (0x10UL)  /*!< SRCINC (Bitfield-Mask: 0x01)                          */
#define DMACHx_CSR_TRANS_Pos (3UL)      /*!< TRANS (Bit 3)                                         */
#define DMACHx_CSR_TRANS_Msk (0x8UL)    /*!< TRANS (Bitfield-Mask: 0x01)                           */
#define DMACHx_CSR_TEIE_Pos (2UL)       /*!< TEIE (Bit 2)                                          */
#define DMACHx_CSR_TEIE_Msk (0x4UL)     /*!< TEIE (Bitfield-Mask: 0x01)                            */
#define DMACHx_CSR_TCIE_Pos (1UL)       /*!< TCIE (Bit 1)                                          */
#define DMACHx_CSR_TCIE_Msk (0x2UL)     /*!< TCIE (Bitfield-Mask: 0x01)                            */
#define DMACHx_CSR_EN_Pos (0UL)         /*!< EN (Bit 0)                                            */
#define DMACHx_CSR_EN_Msk (0x1UL)       /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CNT  ========================================================== */
#define DMACHx_CNT_REPEAT_Pos (16UL)      /*!< REPEAT (Bit 16)                                       */
#define DMACHx_CNT_REPEAT_Msk (0xf0000UL) /*!< REPEAT (Bitfield-Mask: 0x0f)                          */
#define DMACHx_CNT_CNT_Pos (0UL)          /*!< CNT (Bit 0)                                           */
#define DMACHx_CNT_CNT_Msk (0xffffUL)     /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ========================================================  SRCADDR  ======================================================== */
#define DMACHx_SRCADDR_SRCADDR_Pos (0UL)          /*!< SRCADDR (Bit 0)                                       */
#define DMACHx_SRCADDR_SRCADDR_Msk (0xffffffffUL) /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  DSTADDR  ======================================================== */
#define DMACHx_DSTADDR_DSTADDR_Pos (0UL)          /*!< DSTADDR (Bit 0)                                       */
#define DMACHx_DSTADDR_DSTADDR_Msk (0xffffffffUL) /*!< DSTADDR (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  TRIG  ========================================================== */
#define DMACHx_TRIG_HARDSRC_Pos (2UL)    /*!< HARDSRC (Bit 2)                                       */
#define DMACHx_TRIG_HARDSRC_Msk (0xfcUL) /*!< HARDSRC (Bitfield-Mask: 0x3f)                         */
#define DMACHx_TRIG_SOFTSRC_Pos (1UL)    /*!< SOFTSRC (Bit 1)                                       */
#define DMACHx_TRIG_SOFTSRC_Msk (0x2UL)  /*!< SOFTSRC (Bitfield-Mask: 0x01)                         */
#define DMACHx_TRIG_TYPE_Pos (0UL)       /*!< TYPE (Bit 0)                                          */
#define DMACHx_TRIG_TYPE_Msk (0x1UL)     /*!< TYPE (Bitfield-Mask: 0x01)                            */

/* =========================================================================================================================== */
/* ================                                           FLASH                                           ================ */
/* =========================================================================================================================== */

