VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031.h
/* ==========================================================  CR1  ========================================================== */
#define FLASH_CR1_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define FLASH_CR1_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define FLASH_CR1_SECURITY_Pos (6UL)     /*!< SECURITY (Bit 6)                                      */
#define FLASH_CR1_SECURITY_Msk (0xc0UL)  /*!< SECURITY (Bitfield-Mask: 0x03)                        */
#define FLASH_CR1_BUSY_Pos (5UL)         /*!< BUSY (Bit 5)                                          */
#define FLASH_CR1_BUSY_Msk (0x20UL)      /*!< BUSY (Bitfield-Mask: 0x01)                            */
#define FLASH_CR1_STANDBY_Pos (4UL)      /*!< STANDBY (Bit 4)                                       */
#define FLASH_CR1_STANDBY_Msk (0x10UL)   /*!< STANDBY (Bitfield-Mask: 0x01)                         */
#define FLASH_CR1_MODE_Pos (0UL)         /*!< MODE (Bit 0)                                          */
#define FLASH_CR1_MODE_Msk (0x3UL)       /*!< MODE (Bitfield-Mask: 0x03)                            */
/* ==========================================================  CR2  ========================================================== */
#define FLASH_CR2_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define FLASH_CR2_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define FLASH_CR2_WAIT_Pos (0UL)         /*!< WAIT (Bit 0)                                          */
#define FLASH_CR2_WAIT_Msk (0x7UL)       /*!< WAIT (Bitfield-Mask: 0x07)                            */
/* =======================================================  PAGELOCK1  ======================================================= */
#define FLASH_PAGELOCK1_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define FLASH_PAGELOCK1_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define FLASH_PAGELOCK1_LOCK15_Pos (15UL)      /*!< LOCK15 (Bit 15)                                       */
#define FLASH_PAGELOCK1_LOCK15_Msk (0x8000UL)  /*!< LOCK15 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK1_LOCK14_Pos (14UL)      /*!< LOCK14 (Bit 14)                                       */
#define FLASH_PAGELOCK1_LOCK14_Msk (0x4000UL)  /*!< LOCK14 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK1_LOCK13_Pos (13UL)      /*!< LOCK13 (Bit 13)                                       */
#define FLASH_PAGELOCK1_LOCK13_Msk (0x2000UL)  /*!< LOCK13 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK1_LOCK12_Pos (12UL)      /*!< LOCK12 (Bit 12)                                       */
#define FLASH_PAGELOCK1_LOCK12_Msk (0x1000UL)  /*!< LOCK12 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK1_LOCK11_Pos (11UL)      /*!< LOCK11 (Bit 11)                                       */
#define FLASH_PAGELOCK1_LOCK11_Msk (0x800UL)   /*!< LOCK11 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK1_LOCK10_Pos (10UL)      /*!< LOCK10 (Bit 10)                                       */
#define FLASH_PAGELOCK1_LOCK10_Msk (0x400UL)   /*!< LOCK10 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK1_LOCK9_Pos (9UL)        /*!< LOCK9 (Bit 9)                                         */
#define FLASH_PAGELOCK1_LOCK9_Msk (0x200UL)    /*!< LOCK9 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK8_Pos (8UL)        /*!< LOCK8 (Bit 8)                                         */
#define FLASH_PAGELOCK1_LOCK8_Msk (0x100UL)    /*!< LOCK8 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK7_Pos (7UL)        /*!< LOCK7 (Bit 7)                                         */
#define FLASH_PAGELOCK1_LOCK7_Msk (0x80UL)     /*!< LOCK7 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK6_Pos (6UL)        /*!< LOCK6 (Bit 6)                                         */
#define FLASH_PAGELOCK1_LOCK6_Msk (0x40UL)     /*!< LOCK6 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK5_Pos (5UL)        /*!< LOCK5 (Bit 5)                                         */
#define FLASH_PAGELOCK1_LOCK5_Msk (0x20UL)     /*!< LOCK5 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK4_Pos (4UL)        /*!< LOCK4 (Bit 4)                                         */
#define FLASH_PAGELOCK1_LOCK4_Msk (0x10UL)     /*!< LOCK4 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK3_Pos (3UL)        /*!< LOCK3 (Bit 3)                                         */
#define FLASH_PAGELOCK1_LOCK3_Msk (0x8UL)      /*!< LOCK3 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK2_Pos (2UL)        /*!< LOCK2 (Bit 2)                                         */
#define FLASH_PAGELOCK1_LOCK2_Msk (0x4UL)      /*!< LOCK2 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK1_Pos (1UL)        /*!< LOCK1 (Bit 1)                                         */
#define FLASH_PAGELOCK1_LOCK1_Msk (0x2UL)      /*!< LOCK1 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK0_Pos (0UL)        /*!< LOCK0 (Bit 0)                                         */
#define FLASH_PAGELOCK1_LOCK0_Msk (0x1UL)      /*!< LOCK0 (Bitfield-Mask: 0x01)                           */
/* ==========================================================  IER  ========================================================== */
#define FLASH_IER_PROG_Pos (4UL)       /*!< PROG (Bit 4)                                          */
#define FLASH_IER_PROG_Msk (0x10UL)    /*!< PROG (Bitfield-Mask: 0x01)                            */
#define FLASH_IER_PAGELOCK_Pos (1UL)   /*!< PAGELOCK (Bit 1)                                      */
#define FLASH_IER_PAGELOCK_Msk (0x2UL) /*!< PAGELOCK (Bitfield-Mask: 0x01)                        */
#define FLASH_IER_PC_Pos (0UL)         /*!< PC (Bit 0)                                            */
#define FLASH_IER_PC_Msk (0x1UL)       /*!< PC (Bitfield-Mask: 0x01)                              */
/* ==========================================================  ISR  ========================================================== */
#define FLASH_ISR_PROG_Pos (4UL)       /*!< PROG (Bit 4)                                          */
#define FLASH_ISR_PROG_Msk (0x10UL)    /*!< PROG (Bitfield-Mask: 0x01)                            */
#define FLASH_ISR_PAGELOCK_Pos (1UL)   /*!< PAGELOCK (Bit 1)                                      */
#define FLASH_ISR_PAGELOCK_Msk (0x2UL) /*!< PAGELOCK (Bitfield-Mask: 0x01)                        */
#define FLASH_ISR_PC_Pos (0UL)         /*!< PC (Bit 0)                                            */
#define FLASH_ISR_PC_Msk (0x1UL)       /*!< PC (Bitfield-Mask: 0x01)                              */
/* ==========================================================  ICR  ========================================================== */
#define FLASH_ICR_PROG_Pos (4UL)       /*!< PROG (Bit 4)                                          */
#define FLASH_ICR_PROG_Msk (0x10UL)    /*!< PROG (Bitfield-Mask: 0x01)                            */
#define FLASH_ICR_PAGELOCK_Pos (1UL)   /*!< PAGELOCK (Bit 1)                                      */
#define FLASH_ICR_PAGELOCK_Msk (0x2UL) /*!< PAGELOCK (Bitfield-Mask: 0x01)                        */
#define FLASH_ICR_PC_Pos (0UL)         /*!< PC (Bit 0)                                            */
#define FLASH_ICR_PC_Msk (0x1UL)       /*!< PC (Bitfield-Mask: 0x01)                              */
/* =======================================================  NVREWLOCK  ======================================================= */
#define FLASH_NVREWLOCK_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define FLASH_NVREWLOCK_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define FLASH_NVREWLOCK_WLOCK7_Pos (15UL)      /*!< WLOCK7 (Bit 15)                                       */
#define FLASH_NVREWLOCK_WLOCK7_Msk (0x8000UL)  /*!< WLOCK7 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVREWLOCK_WLOCK6_Pos (14UL)      /*!< WLOCK6 (Bit 14)                                       */
#define FLASH_NVREWLOCK_WLOCK6_Msk (0x4000UL)  /*!< WLOCK6 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVREWLOCK_WLOCK5_Pos (13UL)      /*!< WLOCK5 (Bit 13)                                       */
#define FLASH_NVREWLOCK_WLOCK5_Msk (0x2000UL)  /*!< WLOCK5 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVREWLOCK_WLOCK4_Pos (12UL)      /*!< WLOCK4 (Bit 12)                                       */
#define FLASH_NVREWLOCK_WLOCK4_Msk (0x1000UL)  /*!< WLOCK4 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVREWLOCK_WLOCK3_Pos (11UL)      /*!< WLOCK3 (Bit 11)                                       */
#define FLASH_NVREWLOCK_WLOCK3_Msk (0x800UL)   /*!< WLOCK3 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVREWLOCK_WLOCK2_Pos (10UL)      /*!< WLOCK2 (Bit 10)                                       */
#define FLASH_NVREWLOCK_WLOCK2_Msk (0x400UL)   /*!< WLOCK2 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVREWLOCK_WLOCK1_Pos (9UL)       /*!< WLOCK1 (Bit 9)                                        */
#define FLASH_NVREWLOCK_WLOCK1_Msk (0x200UL)   /*!< WLOCK1 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVREWLOCK_WLOCK0_Pos (8UL)       /*!< WLOCK0 (Bit 8)                                        */
#define FLASH_NVREWLOCK_WLOCK0_Msk (0x100UL)   /*!< WLOCK0 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVREWLOCK_ELOCK7_Pos (7UL)       /*!< ELOCK7 (Bit 7)                                        */
#define FLASH_NVREWLOCK_ELOCK7_Msk (0x80UL)    /*!< ELOCK7 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVREWLOCK_ELOCK6_Pos (6UL)       /*!< ELOCK6 (Bit 6)                                        */
#define FLASH_NVREWLOCK_ELOCK6_Msk (0x40UL)    /*!< ELOCK6 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVREWLOCK_ELOCK5_Pos (5UL)       /*!< ELOCK5 (Bit 5)                                        */
#define FLASH_NVREWLOCK_ELOCK5_Msk (0x20UL)    /*!< ELOCK5 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVREWLOCK_ELOCK4_Pos (4UL)       /*!< ELOCK4 (Bit 4)                                        */
#define FLASH_NVREWLOCK_ELOCK4_Msk (0x10UL)    /*!< ELOCK4 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVREWLOCK_ELOCK3_Pos (3UL)       /*!< ELOCK3 (Bit 3)                                        */
#define FLASH_NVREWLOCK_ELOCK3_Msk (0x8UL)     /*!< ELOCK3 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVREWLOCK_ELOCK2_Pos (2UL)       /*!< ELOCK2 (Bit 2)                                        */
#define FLASH_NVREWLOCK_ELOCK2_Msk (0x4UL)     /*!< ELOCK2 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVREWLOCK_ELOCK1_Pos (1UL)       /*!< ELOCK1 (Bit 1)                                        */
#define FLASH_NVREWLOCK_ELOCK1_Msk (0x2UL)     /*!< ELOCK1 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVREWLOCK_ELOCK0_Pos (0UL)       /*!< ELOCK0 (Bit 0)                                        */
#define FLASH_NVREWLOCK_ELOCK0_Msk (0x1UL)     /*!< ELOCK0 (Bitfield-Mask: 0x01)                          */
/* =======================================================  NVRRDLOCK  ======================================================= */
#define FLASH_NVRRDLOCK_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define FLASH_NVRRDLOCK_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define FLASH_NVRRDLOCK_RLOCK7_Pos (7UL)       /*!< RLOCK7 (Bit 7)                                        */
#define FLASH_NVRRDLOCK_RLOCK7_Msk (0x80UL)    /*!< RLOCK7 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVRRDLOCK_RLOCK6_Pos (6UL)       /*!< RLOCK6 (Bit 6)                                        */
#define FLASH_NVRRDLOCK_RLOCK6_Msk (0x40UL)    /*!< RLOCK6 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVRRDLOCK_RLOCK5_Pos (5UL)       /*!< RLOCK5 (Bit 5)                                        */
#define FLASH_NVRRDLOCK_RLOCK5_Msk (0x20UL)    /*!< RLOCK5 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVRRDLOCK_RLOCK4_Pos (4UL)       /*!< RLOCK4 (Bit 4)                                        */
#define FLASH_NVRRDLOCK_RLOCK4_Msk (0x10UL)    /*!< RLOCK4 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVRRDLOCK_RLOCK3_Pos (3UL)       /*!< RLOCK3 (Bit 3)                                        */
#define FLASH_NVRRDLOCK_RLOCK3_Msk (0x8UL)     /*!< RLOCK3 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVRRDLOCK_RLOCK2_Pos (2UL)       /*!< RLOCK2 (Bit 2)                                        */
#define FLASH_NVRRDLOCK_RLOCK2_Msk (0x4UL)     /*!< RLOCK2 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVRRDLOCK_RLOCK1_Pos (1UL)       /*!< RLOCK1 (Bit 1)                                        */
#define FLASH_NVRRDLOCK_RLOCK1_Msk (0x2UL)     /*!< RLOCK1 (Bitfield-Mask: 0x01)                          */
#define FLASH_NVRRDLOCK_RLOCK0_Pos (0UL)       /*!< RLOCK0 (Bit 0)                                        */
#define FLASH_NVRRDLOCK_RLOCK0_Msk (0x1UL)     /*!< RLOCK0 (Bitfield-Mask: 0x01)                          */

/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */

