VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031.h
#define GPIOx_RISEIE_PIN0_Pos (0UL)       /*!< PIN0 (Bit 0)                                          */
#define GPIOx_RISEIE_PIN0_Msk (0x1UL)     /*!< PIN0 (Bitfield-Mask: 0x01)                            */
/* ========================================================  FALLIE  ========================================================= */
#define GPIOx_FALLIE_PIN15_Pos (15UL)     /*!< PIN15 (Bit 15)                                        */
#define GPIOx_FALLIE_PIN15_Msk (0x8000UL) /*!< PIN15 (Bitfield-Mask: 0x01)                           */
#define GPIOx_FALLIE_PIN14_Pos (14UL)     /*!< PIN14 (Bit 14)                                        */
#define GPIOx_FALLIE_PIN14_Msk (0x4000UL) /*!< PIN14 (Bitfield-Mask: 0x01)                           */
#define GPIOx_FALLIE_PIN13_Pos (13UL)     /*!< PIN13 (Bit 13)                                        */
#define GPIOx_FALLIE_PIN13_Msk (0x2000UL) /*!< PIN13 (Bitfield-Mask: 0x01)                           */
#define GPIOx_FALLIE_PIN12_Pos (12UL)     /*!< PIN12 (Bit 12)                                        */
#define GPIOx_FALLIE_PIN12_Msk (0x1000UL) /*!< PIN12 (Bitfield-Mask: 0x01)                           */
#define GPIOx_FALLIE_PIN11_Pos (11UL)     /*!< PIN11 (Bit 11)                                        */
#define GPIOx_FALLIE_PIN11_Msk (0x800UL)  /*!< PIN11 (Bitfield-Mask: 0x01)                           */
#define GPIOx_FALLIE_PIN10_Pos (10UL)     /*!< PIN10 (Bit 10)                                        */
#define GPIOx_FALLIE_PIN10_Msk (0x400UL)  /*!< PIN10 (Bitfield-Mask: 0x01)                           */
#define GPIOx_FALLIE_PIN9_Pos (9UL)       /*!< PIN9 (Bit 9)                                          */
#define GPIOx_FALLIE_PIN9_Msk (0x200UL)   /*!< PIN9 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FALLIE_PIN8_Pos (8UL)       /*!< PIN8 (Bit 8)                                          */
#define GPIOx_FALLIE_PIN8_Msk (0x100UL)   /*!< PIN8 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FALLIE_PIN7_Pos (7UL)       /*!< PIN7 (Bit 7)                                          */
#define GPIOx_FALLIE_PIN7_Msk (0x80UL)    /*!< PIN7 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FALLIE_PIN6_Pos (6UL)       /*!< PIN6 (Bit 6)                                          */
#define GPIOx_FALLIE_PIN6_Msk (0x40UL)    /*!< PIN6 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FALLIE_PIN5_Pos (5UL)       /*!< PIN5 (Bit 5)                                          */
#define GPIOx_FALLIE_PIN5_Msk (0x20UL)    /*!< PIN5 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FALLIE_PIN4_Pos (4UL)       /*!< PIN4 (Bit 4)                                          */
#define GPIOx_FALLIE_PIN4_Msk (0x10UL)    /*!< PIN4 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FALLIE_PIN3_Pos (3UL)       /*!< PIN3 (Bit 3)                                          */
#define GPIOx_FALLIE_PIN3_Msk (0x8UL)     /*!< PIN3 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FALLIE_PIN2_Pos (2UL)       /*!< PIN2 (Bit 2)                                          */
#define GPIOx_FALLIE_PIN2_Msk (0x4UL)     /*!< PIN2 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FALLIE_PIN1_Pos (1UL)       /*!< PIN1 (Bit 1)                                          */
#define GPIOx_FALLIE_PIN1_Msk (0x2UL)     /*!< PIN1 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FALLIE_PIN0_Pos (0UL)       /*!< PIN0 (Bit 0)                                          */
#define GPIOx_FALLIE_PIN0_Msk (0x1UL)     /*!< PIN0 (Bitfield-Mask: 0x01)                            */
/* ==========================================================  ISR  ========================================================== */
#define GPIOx_ISR_PIN15_Pos (15UL)     /*!< PIN15 (Bit 15)                                        */
#define GPIOx_ISR_PIN15_Msk (0x8000UL) /*!< PIN15 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ISR_PIN14_Pos (14UL)     /*!< PIN14 (Bit 14)                                        */
#define GPIOx_ISR_PIN14_Msk (0x4000UL) /*!< PIN14 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ISR_PIN13_Pos (13UL)     /*!< PIN13 (Bit 13)                                        */
#define GPIOx_ISR_PIN13_Msk (0x2000UL) /*!< PIN13 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ISR_PIN12_Pos (12UL)     /*!< PIN12 (Bit 12)                                        */
#define GPIOx_ISR_PIN12_Msk (0x1000UL) /*!< PIN12 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ISR_PIN11_Pos (11UL)     /*!< PIN11 (Bit 11)                                        */
#define GPIOx_ISR_PIN11_Msk (0x800UL)  /*!< PIN11 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ISR_PIN10_Pos (10UL)     /*!< PIN10 (Bit 10)                                        */
#define GPIOx_ISR_PIN10_Msk (0x400UL)  /*!< PIN10 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ISR_PIN9_Pos (9UL)       /*!< PIN9 (Bit 9)                                          */
#define GPIOx_ISR_PIN9_Msk (0x200UL)   /*!< PIN9 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ISR_PIN8_Pos (8UL)       /*!< PIN8 (Bit 8)                                          */
#define GPIOx_ISR_PIN8_Msk (0x100UL)   /*!< PIN8 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ISR_PIN7_Pos (7UL)       /*!< PIN7 (Bit 7)                                          */
#define GPIOx_ISR_PIN7_Msk (0x80UL)    /*!< PIN7 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ISR_PIN6_Pos (6UL)       /*!< PIN6 (Bit 6)                                          */
#define GPIOx_ISR_PIN6_Msk (0x40UL)    /*!< PIN6 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ISR_PIN5_Pos (5UL)       /*!< PIN5 (Bit 5)                                          */
#define GPIOx_ISR_PIN5_Msk (0x20UL)    /*!< PIN5 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ISR_PIN4_Pos (4UL)       /*!< PIN4 (Bit 4)                                          */
#define GPIOx_ISR_PIN4_Msk (0x10UL)    /*!< PIN4 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ISR_PIN3_Pos (3UL)       /*!< PIN3 (Bit 3)                                          */
#define GPIOx_ISR_PIN3_Msk (0x8UL)     /*!< PIN3 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ISR_PIN2_Pos (2UL)       /*!< PIN2 (Bit 2)                                          */
#define GPIOx_ISR_PIN2_Msk (0x4UL)     /*!< PIN2 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ISR_PIN1_Pos (1UL)       /*!< PIN1 (Bit 1)                                          */
#define GPIOx_ISR_PIN1_Msk (0x2UL)     /*!< PIN1 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ISR_PIN0_Pos (0UL)       /*!< PIN0 (Bit 0)                                          */
#define GPIOx_ISR_PIN0_Msk (0x1UL)     /*!< PIN0 (Bitfield-Mask: 0x01)                            */
/* ==========================================================  ICR  ========================================================== */
#define GPIOx_ICR_PIN15_Pos (15UL)     /*!< PIN15 (Bit 15)                                        */
#define GPIOx_ICR_PIN15_Msk (0x8000UL) /*!< PIN15 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ICR_PIN14_Pos (14UL)     /*!< PIN14 (Bit 14)                                        */
#define GPIOx_ICR_PIN14_Msk (0x4000UL) /*!< PIN14 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ICR_PIN13_Pos (13UL)     /*!< PIN13 (Bit 13)                                        */
#define GPIOx_ICR_PIN13_Msk (0x2000UL) /*!< PIN13 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ICR_PIN12_Pos (12UL)     /*!< PIN12 (Bit 12)                                        */
#define GPIOx_ICR_PIN12_Msk (0x1000UL) /*!< PIN12 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ICR_PIN11_Pos (11UL)     /*!< PIN11 (Bit 11)                                        */
#define GPIOx_ICR_PIN11_Msk (0x800UL)  /*!< PIN11 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ICR_PIN10_Pos (10UL)     /*!< PIN10 (Bit 10)                                        */
#define GPIOx_ICR_PIN10_Msk (0x400UL)  /*!< PIN10 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ICR_PIN9_Pos (9UL)       /*!< PIN9 (Bit 9)                                          */
#define GPIOx_ICR_PIN9_Msk (0x200UL)   /*!< PIN9 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ICR_PIN8_Pos (8UL)       /*!< PIN8 (Bit 8)                                          */
#define GPIOx_ICR_PIN8_Msk (0x100UL)   /*!< PIN8 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ICR_PIN7_Pos (7UL)       /*!< PIN7 (Bit 7)                                          */
#define GPIOx_ICR_PIN7_Msk (0x80UL)    /*!< PIN7 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ICR_PIN6_Pos (6UL)       /*!< PIN6 (Bit 6)                                          */
#define GPIOx_ICR_PIN6_Msk (0x40UL)    /*!< PIN6 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ICR_PIN5_Pos (5UL)       /*!< PIN5 (Bit 5)                                          */
#define GPIOx_ICR_PIN5_Msk (0x20UL)    /*!< PIN5 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ICR_PIN4_Pos (4UL)       /*!< PIN4 (Bit 4)                                          */
#define GPIOx_ICR_PIN4_Msk (0x10UL)    /*!< PIN4 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ICR_PIN3_Pos (3UL)       /*!< PIN3 (Bit 3)                                          */
#define GPIOx_ICR_PIN3_Msk (0x8UL)     /*!< PIN3 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ICR_PIN2_Pos (2UL)       /*!< PIN2 (Bit 2)                                          */
#define GPIOx_ICR_PIN2_Msk (0x4UL)     /*!< PIN2 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ICR_PIN1_Pos (1UL)       /*!< PIN1 (Bit 1)                                          */
#define GPIOx_ICR_PIN1_Msk (0x2UL)     /*!< PIN1 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ICR_PIN0_Pos (0UL)       /*!< PIN0 (Bit 0)                                          */
#define GPIOx_ICR_PIN0_Msk (0x1UL)     /*!< PIN0 (Bitfield-Mask: 0x01)                            */
/* ========================================================  FILTER  ========================================================= */
#define GPIOx_FILTER_FLTCLK_Pos (16UL)      /*!< FLTCLK (Bit 16)                                       */
#define GPIOx_FILTER_FLTCLK_Msk (0x70000UL) /*!< FLTCLK (Bitfield-Mask: 0x07)                          */
#define GPIOx_FILTER_PIN15_Pos (15UL)       /*!< PIN15 (Bit 15)                                        */
#define GPIOx_FILTER_PIN15_Msk (0x8000UL)   /*!< PIN15 (Bitfield-Mask: 0x01)                           */
#define GPIOx_FILTER_PIN14_Pos (14UL)       /*!< PIN14 (Bit 14)                                        */
#define GPIOx_FILTER_PIN14_Msk (0x4000UL)   /*!< PIN14 (Bitfield-Mask: 0x01)                           */
#define GPIOx_FILTER_PIN13_Pos (13UL)       /*!< PIN13 (Bit 13)                                        */
#define GPIOx_FILTER_PIN13_Msk (0x2000UL)   /*!< PIN13 (Bitfield-Mask: 0x01)                           */
#define GPIOx_FILTER_PIN12_Pos (12UL)       /*!< PIN12 (Bit 12)                                        */
#define GPIOx_FILTER_PIN12_Msk (0x1000UL)   /*!< PIN12 (Bitfield-Mask: 0x01)                           */
#define GPIOx_FILTER_PIN11_Pos (11UL)       /*!< PIN11 (Bit 11)                                        */
#define GPIOx_FILTER_PIN11_Msk (0x800UL)    /*!< PIN11 (Bitfield-Mask: 0x01)                           */
#define GPIOx_FILTER_PIN10_Pos (10UL)       /*!< PIN10 (Bit 10)                                        */
#define GPIOx_FILTER_PIN10_Msk (0x400UL)    /*!< PIN10 (Bitfield-Mask: 0x01)                           */
#define GPIOx_FILTER_PIN9_Pos (9UL)         /*!< PIN9 (Bit 9)                                          */
#define GPIOx_FILTER_PIN9_Msk (0x200UL)     /*!< PIN9 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FILTER_PIN8_Pos (8UL)         /*!< PIN8 (Bit 8)                                          */
#define GPIOx_FILTER_PIN8_Msk (0x100UL)     /*!< PIN8 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FILTER_PIN7_Pos (7UL)         /*!< PIN7 (Bit 7)                                          */
#define GPIOx_FILTER_PIN7_Msk (0x80UL)      /*!< PIN7 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FILTER_PIN6_Pos (6UL)         /*!< PIN6 (Bit 6)                                          */
#define GPIOx_FILTER_PIN6_Msk (0x40UL)      /*!< PIN6 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FILTER_PIN5_Pos (5UL)         /*!< PIN5 (Bit 5)                                          */
#define GPIOx_FILTER_PIN5_Msk (0x20UL)      /*!< PIN5 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FILTER_PIN4_Pos (4UL)         /*!< PIN4 (Bit 4)                                          */
#define GPIOx_FILTER_PIN4_Msk (0x10UL)      /*!< PIN4 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FILTER_PIN3_Pos (3UL)         /*!< PIN3 (Bit 3)                                          */
#define GPIOx_FILTER_PIN3_Msk (0x8UL)       /*!< PIN3 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FILTER_PIN2_Pos (2UL)         /*!< PIN2 (Bit 2)                                          */
#define GPIOx_FILTER_PIN2_Msk (0x4UL)       /*!< PIN2 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FILTER_PIN1_Pos (1UL)         /*!< PIN1 (Bit 1)                                          */
#define GPIOx_FILTER_PIN1_Msk (0x2UL)       /*!< PIN1 (Bitfield-Mask: 0x01)                            */
#define GPIOx_FILTER_PIN0_Pos (0UL)         /*!< PIN0 (Bit 0)                                          */
#define GPIOx_FILTER_PIN0_Msk (0x1UL)       /*!< PIN0 (Bitfield-Mask: 0x01)                            */
/* ==========================================================  IDR  ========================================================== */
#define GPIOx_IDR_PIN15_Pos (15UL)     /*!< PIN15 (Bit 15)                                        */
#define GPIOx_IDR_PIN15_Msk (0x8000UL) /*!< PIN15 (Bitfield-Mask: 0x01)                           */
#define GPIOx_IDR_PIN14_Pos (14UL)     /*!< PIN14 (Bit 14)                                        */
#define GPIOx_IDR_PIN14_Msk (0x4000UL) /*!< PIN14 (Bitfield-Mask: 0x01)                           */
#define GPIOx_IDR_PIN13_Pos (13UL)     /*!< PIN13 (Bit 13)                                        */
#define GPIOx_IDR_PIN13_Msk (0x2000UL) /*!< PIN13 (Bitfield-Mask: 0x01)                           */
#define GPIOx_IDR_PIN12_Pos (12UL)     /*!< PIN12 (Bit 12)                                        */
#define GPIOx_IDR_PIN12_Msk (0x1000UL) /*!< PIN12 (Bitfield-Mask: 0x01)                           */
#define GPIOx_IDR_PIN11_Pos (11UL)     /*!< PIN11 (Bit 11)                                        */
#define GPIOx_IDR_PIN11_Msk (0x800UL)  /*!< PIN11 (Bitfield-Mask: 0x01)                           */
#define GPIOx_IDR_PIN10_Pos (10UL)     /*!< PIN10 (Bit 10)                                        */
#define GPIOx_IDR_PIN10_Msk (0x400UL)  /*!< PIN10 (Bitfield-Mask: 0x01)                           */
#define GPIOx_IDR_PIN9_Pos (9UL)       /*!< PIN9 (Bit 9)                                          */
#define GPIOx_IDR_PIN9_Msk (0x200UL)   /*!< PIN9 (Bitfield-Mask: 0x01)                            */
#define GPIOx_IDR_PIN8_Pos (8UL)       /*!< PIN8 (Bit 8)                                          */
#define GPIOx_IDR_PIN8_Msk (0x100UL)   /*!< PIN8 (Bitfield-Mask: 0x01)                            */
#define GPIOx_IDR_PIN7_Pos (7UL)       /*!< PIN7 (Bit 7)                                          */
#define GPIOx_IDR_PIN7_Msk (0x80UL)    /*!< PIN7 (Bitfield-Mask: 0x01)                            */
#define GPIOx_IDR_PIN6_Pos (6UL)       /*!< PIN6 (Bit 6)                                          */
#define GPIOx_IDR_PIN6_Msk (0x40UL)    /*!< PIN6 (Bitfield-Mask: 0x01)                            */
#define GPIOx_IDR_PIN5_Pos (5UL)       /*!< PIN5 (Bit 5)                                          */
#define GPIOx_IDR_PIN5_Msk (0x20UL)    /*!< PIN5 (Bitfield-Mask: 0x01)                            */
#define GPIOx_IDR_PIN4_Pos (4UL)       /*!< PIN4 (Bit 4)                                          */
#define GPIOx_IDR_PIN4_Msk (0x10UL)    /*!< PIN4 (Bitfield-Mask: 0x01)                            */
#define GPIOx_IDR_PIN3_Pos (3UL)       /*!< PIN3 (Bit 3)                                          */
#define GPIOx_IDR_PIN3_Msk (0x8UL)     /*!< PIN3 (Bitfield-Mask: 0x01)                            */
#define GPIOx_IDR_PIN2_Pos (2UL)       /*!< PIN2 (Bit 2)                                          */
#define GPIOx_IDR_PIN2_Msk (0x4UL)     /*!< PIN2 (Bitfield-Mask: 0x01)                            */
#define GPIOx_IDR_PIN1_Pos (1UL)       /*!< PIN1 (Bit 1)                                          */
#define GPIOx_IDR_PIN1_Msk (0x2UL)     /*!< PIN1 (Bitfield-Mask: 0x01)                            */
#define GPIOx_IDR_PIN0_Pos (0UL)       /*!< PIN0 (Bit 0)                                          */
#define GPIOx_IDR_PIN0_Msk (0x1UL)     /*!< PIN0 (Bitfield-Mask: 0x01)                            */
/* ==========================================================  ODR  ========================================================== */
#define GPIOx_ODR_PIN15_Pos (15UL)     /*!< PIN15 (Bit 15)                                        */
#define GPIOx_ODR_PIN15_Msk (0x8000UL) /*!< PIN15 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ODR_PIN14_Pos (14UL)     /*!< PIN14 (Bit 14)                                        */
#define GPIOx_ODR_PIN14_Msk (0x4000UL) /*!< PIN14 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ODR_PIN13_Pos (13UL)     /*!< PIN13 (Bit 13)                                        */
#define GPIOx_ODR_PIN13_Msk (0x2000UL) /*!< PIN13 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ODR_PIN12_Pos (12UL)     /*!< PIN12 (Bit 12)                                        */
#define GPIOx_ODR_PIN12_Msk (0x1000UL) /*!< PIN12 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ODR_PIN11_Pos (11UL)     /*!< PIN11 (Bit 11)                                        */
#define GPIOx_ODR_PIN11_Msk (0x800UL)  /*!< PIN11 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ODR_PIN10_Pos (10UL)     /*!< PIN10 (Bit 10)                                        */
#define GPIOx_ODR_PIN10_Msk (0x400UL)  /*!< PIN10 (Bitfield-Mask: 0x01)                           */
#define GPIOx_ODR_PIN9_Pos (9UL)       /*!< PIN9 (Bit 9)                                          */
#define GPIOx_ODR_PIN9_Msk (0x200UL)   /*!< PIN9 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ODR_PIN8_Pos (8UL)       /*!< PIN8 (Bit 8)                                          */
#define GPIOx_ODR_PIN8_Msk (0x100UL)   /*!< PIN8 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ODR_PIN7_Pos (7UL)       /*!< PIN7 (Bit 7)                                          */
#define GPIOx_ODR_PIN7_Msk (0x80UL)    /*!< PIN7 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ODR_PIN6_Pos (6UL)       /*!< PIN6 (Bit 6)                                          */
#define GPIOx_ODR_PIN6_Msk (0x40UL)    /*!< PIN6 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ODR_PIN5_Pos (5UL)       /*!< PIN5 (Bit 5)                                          */
#define GPIOx_ODR_PIN5_Msk (0x20UL)    /*!< PIN5 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ODR_PIN4_Pos (4UL)       /*!< PIN4 (Bit 4)                                          */
#define GPIOx_ODR_PIN4_Msk (0x10UL)    /*!< PIN4 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ODR_PIN3_Pos (3UL)       /*!< PIN3 (Bit 3)                                          */
#define GPIOx_ODR_PIN3_Msk (0x8UL)     /*!< PIN3 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ODR_PIN2_Pos (2UL)       /*!< PIN2 (Bit 2)                                          */
#define GPIOx_ODR_PIN2_Msk (0x4UL)     /*!< PIN2 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ODR_PIN1_Pos (1UL)       /*!< PIN1 (Bit 1)                                          */
#define GPIOx_ODR_PIN1_Msk (0x2UL)     /*!< PIN1 (Bitfield-Mask: 0x01)                            */
#define GPIOx_ODR_PIN0_Pos (0UL)       /*!< PIN0 (Bit 0)                                          */
#define GPIOx_ODR_PIN0_Msk (0x1UL)     /*!< PIN0 (Bitfield-Mask: 0x01)                            */
/* ======================================================  ODRLOWBYTE  ======================================================= */
#define GPIOx_ODRLOWBYTE_LOWBYTE_Pos (0UL)    /*!< LOWBYTE (Bit 0)                                       */
#define GPIOx_ODRLOWBYTE_LOWBYTE_Msk (0xffUL) /*!< LOWBYTE (Bitfield-Mask: 0xff)                         */
/* ======================================================  ODRHIGHBYTE  ====================================================== */
#define GPIOx_ODRHIGHBYTE_HIGHBYTE_Pos (0UL)    /*!< HIGHBYTE (Bit 0)                                      */
#define GPIOx_ODRHIGHBYTE_HIGHBYTE_Msk (0xffUL) /*!< HIGHBYTE (Bitfield-Mask: 0xff)                        */
/* ==========================================================  BRR  ========================================================== */
#define GPIOx_BRR_BRR15_Pos (15UL)     /*!< BRR15 (Bit 15)                                        */
#define GPIOx_BRR_BRR15_Msk (0x8000UL) /*!< BRR15 (Bitfield-Mask: 0x01)                           */
#define GPIOx_BRR_BRR14_Pos (14UL)     /*!< BRR14 (Bit 14)                                        */
#define GPIOx_BRR_BRR14_Msk (0x4000UL) /*!< BRR14 (Bitfield-Mask: 0x01)                           */
#define GPIOx_BRR_BRR13_Pos (13UL)     /*!< BRR13 (Bit 13)                                        */
#define GPIOx_BRR_BRR13_Msk (0x2000UL) /*!< BRR13 (Bitfield-Mask: 0x01)                           */
#define GPIOx_BRR_BRR12_Pos (12UL)     /*!< BRR12 (Bit 12)                                        */
#define GPIOx_BRR_BRR12_Msk (0x1000UL) /*!< BRR12 (Bitfield-Mask: 0x01)                           */
#define GPIOx_BRR_BRR11_Pos (11UL)     /*!< BRR11 (Bit 11)                                        */
#define GPIOx_BRR_BRR11_Msk (0x800UL)  /*!< BRR11 (Bitfield-Mask: 0x01)                           */
#define GPIOx_BRR_BRR10_Pos (10UL)     /*!< BRR10 (Bit 10)                                        */
#define GPIOx_BRR_BRR10_Msk (0x400UL)  /*!< BRR10 (Bitfield-Mask: 0x01)                           */
#define GPIOx_BRR_BRR9_Pos (9UL)       /*!< BRR9 (Bit 9)                                          */
#define GPIOx_BRR_BRR9_Msk (0x200UL)   /*!< BRR9 (Bitfield-Mask: 0x01)                            */
#define GPIOx_BRR_BRR8_Pos (8UL)       /*!< BRR8 (Bit 8)                                          */
#define GPIOx_BRR_BRR8_Msk (0x100UL)   /*!< BRR8 (Bitfield-Mask: 0x01)                            */
#define GPIOx_BRR_BRR7_Pos (7UL)       /*!< BRR7 (Bit 7)                                          */
#define GPIOx_BRR_BRR7_Msk (0x80UL)    /*!< BRR7 (Bitfield-Mask: 0x01)                            */
#define GPIOx_BRR_BRR6_Pos (6UL)       /*!< BRR6 (Bit 6)                                          */
#define GPIOx_BRR_BRR6_Msk (0x40UL)    /*!< BRR6 (Bitfield-Mask: 0x01)                            */
#define GPIOx_BRR_BRR5_Pos (5UL)       /*!< BRR5 (Bit 5)                                          */
#define GPIOx_BRR_BRR5_Msk (0x20UL)    /*!< BRR5 (Bitfield-Mask: 0x01)                            */
#define GPIOx_BRR_BRR4_Pos (4UL)       /*!< BRR4 (Bit 4)                                          */
