VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031.h
/* =========================================================================================================================== */
/* ================                                            LVD                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR0  ========================================================== */
#define LVD_CR0_IE_Pos (9UL)       /*!< IE (Bit 9)                                            */
#define LVD_CR0_IE_Msk (0x200UL)   /*!< IE (Bitfield-Mask: 0x01)                              */
#define LVD_CR0_VTH_Pos (4UL)      /*!< VTH (Bit 4)                                           */
#define LVD_CR0_VTH_Msk (0xf0UL)   /*!< VTH (Bitfield-Mask: 0x0f)                             */
#define LVD_CR0_SOURCE_Pos (2UL)   /*!< SOURCE (Bit 2)                                        */
#define LVD_CR0_SOURCE_Msk (0xcUL) /*!< SOURCE (Bitfield-Mask: 0x03)                          */
#define LVD_CR0_ACTION_Pos (1UL)   /*!< ACTION (Bit 1)                                        */
#define LVD_CR0_ACTION_Msk (0x2UL) /*!< ACTION (Bitfield-Mask: 0x01)                          */
#define LVD_CR0_EN_Pos (0UL)       /*!< EN (Bit 0)                                            */
#define LVD_CR0_EN_Msk (0x1UL)     /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CR1  ========================================================== */
#define LVD_CR1_LEVEL_Pos (7UL)     /*!< LEVEL (Bit 7)                                         */
#define LVD_CR1_LEVEL_Msk (0x80UL)  /*!< LEVEL (Bitfield-Mask: 0x01)                           */
#define LVD_CR1_FALL_Pos (6UL)      /*!< FALL (Bit 6)                                          */
#define LVD_CR1_FALL_Msk (0x40UL)   /*!< FALL (Bitfield-Mask: 0x01)                            */
#define LVD_CR1_RISE_Pos (5UL)      /*!< RISE (Bit 5)                                          */
#define LVD_CR1_RISE_Msk (0x20UL)   /*!< RISE (Bitfield-Mask: 0x01)                            */
#define LVD_CR1_FLTCLK_Pos (4UL)    /*!< FLTCLK (Bit 4)                                        */
#define LVD_CR1_FLTCLK_Msk (0x10UL) /*!< FLTCLK (Bitfield-Mask: 0x01)                          */
#define LVD_CR1_FLTTIME_Pos (1UL)   /*!< FLTTIME (Bit 1)                                       */
#define LVD_CR1_FLTTIME_Msk (0xeUL) /*!< FLTTIME (Bitfield-Mask: 0x07)                         */
#define LVD_CR1_FLTEN_Pos (0UL)     /*!< FLTEN (Bit 0)                                         */
#define LVD_CR1_FLTEN_Msk (0x1UL)   /*!< FLTEN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  SR  =========================================================== */
#define LVD_SR_FLTV_Pos (1UL)   /*!< FLTV (Bit 1)                                          */
#define LVD_SR_FLTV_Msk (0x2UL) /*!< FLTV (Bitfield-Mask: 0x01)                            */
#define LVD_SR_INTF_Pos (0UL)   /*!< INTF (Bit 0)                                          */
#define LVD_SR_INTF_Msk (0x1UL) /*!< INTF (Bitfield-Mask: 0x01)                            */

/* =========================================================================================================================== */
/* ================                                            RAM                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  ADDR  ========================================================== */
#define RAM_ADDR_ADDR_Pos (0UL)          /*!< ADDR (Bit 0)                                          */
#define RAM_ADDR_ADDR_Msk (0xffffffffUL) /*!< ADDR (Bitfield-Mask: 0xffffffff)                      */
/* ==========================================================  IER  ========================================================== */
#define RAM_IER_PARITY_Pos (1UL)   /*!< PARITY (Bit 1)                                        */
#define RAM_IER_PARITY_Msk (0x2UL) /*!< PARITY (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ISR  ========================================================== */
#define RAM_ISR_PARITY_Pos (0UL)   /*!< PARITY (Bit 0)                                        */
#define RAM_ISR_PARITY_Msk (0x1UL) /*!< PARITY (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ICR  ========================================================== */
#define RAM_ICR_PARITY_Pos (0UL)   /*!< PARITY (Bit 0)                                        */
#define RAM_ICR_PARITY_Msk (0x1UL) /*!< PARITY (Bitfield-Mask: 0x01)                          */

/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  KEY  ========================================================== */
#define RTC_KEY_KEY_Pos (0UL)    /*!< KEY (Bit 0)                                           */
#define RTC_KEY_KEY_Msk (0xffUL) /*!< KEY (Bitfield-Mask: 0xff)                             */
/* ==========================================================  CR0  ========================================================== */
#define RTC_CR0_START_Pos (7UL)      /*!< START (Bit 7)                                         */
#define RTC_CR0_START_Msk (0x80UL)   /*!< START (Bitfield-Mask: 0x01)                           */
#define RTC_CR0_RTC1HZ_Pos (5UL)     /*!< RTC1HZ (Bit 5)                                        */
#define RTC_CR0_RTC1HZ_Msk (0x60UL)  /*!< RTC1HZ (Bitfield-Mask: 0x03)                          */
#define RTC_CR0_AMPM_Pos (3UL)       /*!< AMPM (Bit 3)                                          */
#define RTC_CR0_AMPM_Msk (0x8UL)     /*!< AMPM (Bitfield-Mask: 0x01)                            */
#define RTC_CR0_INTERVAL_Pos (0UL)   /*!< INTERVAL (Bit 0)                                      */
#define RTC_CR0_INTERVAL_Msk (0x7UL) /*!< INTERVAL (Bitfield-Mask: 0x07)                        */
/* ==========================================================  CR1  ========================================================== */
#define RTC_CR1_SOURCE_Pos (8UL)     /*!< SOURCE (Bit 8)                                        */
#define RTC_CR1_SOURCE_Msk (0x700UL) /*!< SOURCE (Bitfield-Mask: 0x07)                          */
#define RTC_CR1_WINDOW_Pos (1UL)     /*!< WINDOW (Bit 1)                                        */
#define RTC_CR1_WINDOW_Msk (0x2UL)   /*!< WINDOW (Bitfield-Mask: 0x01)                          */
#define RTC_CR1_ACCESS_Pos (0UL)     /*!< ACCESS (Bit 0)                                        */
#define RTC_CR1_ACCESS_Msk (0x1UL)   /*!< ACCESS (Bitfield-Mask: 0x01)                          */
/* ==========================================================  CR2  ========================================================== */
#define RTC_CR2_ALARMBEN_Pos (10UL)    /*!< ALARMBEN (Bit 10)                                     */
#define RTC_CR2_ALARMBEN_Msk (0x400UL) /*!< ALARMBEN (Bitfield-Mask: 0x01)                        */
#define RTC_CR2_ALARMAEN_Pos (9UL)     /*!< ALARMAEN (Bit 9)                                      */
#define RTC_CR2_ALARMAEN_Msk (0x200UL) /*!< ALARMAEN (Bitfield-Mask: 0x01)                        */
#define RTC_CR2_AWTEN_Pos (7UL)        /*!< AWTEN (Bit 7)                                         */
#define RTC_CR2_AWTEN_Msk (0x80UL)     /*!< AWTEN (Bitfield-Mask: 0x01)                           */
#define RTC_CR2_TAMPEN_Pos (6UL)       /*!< TAMPEN (Bit 6)                                        */
#define RTC_CR2_TAMPEN_Msk (0x40UL)    /*!< TAMPEN (Bitfield-Mask: 0x01)                          */
#define RTC_CR2_RTCOUT_Pos (4UL)       /*!< RTCOUT (Bit 4)                                        */
#define RTC_CR2_RTCOUT_Msk (0x30UL)    /*!< RTCOUT (Bitfield-Mask: 0x03)                          */
#define RTC_CR2_TAMPEDGE_Pos (3UL)     /*!< TAMPEDGE (Bit 3)                                      */
#define RTC_CR2_TAMPEDGE_Msk (0x8UL)   /*!< TAMPEDGE (Bitfield-Mask: 0x01)                        */
#define RTC_CR2_AWTSRC_Pos (0UL)       /*!<  AWTRC (Bit 0)                                        */
#define RTC_CR2_AWTSRC_Msk (0x7UL)     /*!< AWTSRC (Bitfield-Mask: 0x07)                          */
/* ========================================================  COMPEN  ========================================================= */
#define RTC_COMPEN_FREQ_Pos (16UL)      /*!< FREQ (Bit 16)                                         */
#define RTC_COMPEN_FREQ_Msk (0xf0000UL) /*!< FREQ (Bitfield-Mask: 0x0f)                            */
#define RTC_COMPEN_EN_Pos (15UL)        /*!< EN (Bit 15)                                           */
#define RTC_COMPEN_EN_Msk (0x8000UL)    /*!< EN (Bitfield-Mask: 0x01)                              */
#define RTC_COMPEN_SIGN_Pos (14UL)      /*!< SIGN (Bit 14)                                         */
#define RTC_COMPEN_SIGN_Msk (0x4000UL)  /*!< SIGN (Bitfield-Mask: 0x01)                            */
#define RTC_COMPEN_STEP_Pos (12UL)      /*!< STEP (Bit 12)                                         */
#define RTC_COMPEN_STEP_Msk (0x3000UL)  /*!< STEP (Bitfield-Mask: 0x03)                            */
#define RTC_COMPEN_COMP_Pos (0UL)       /*!< COMP (Bit 0)                                          */
#define RTC_COMPEN_COMP_Msk (0xfffUL)   /*!< COMP (Bitfield-Mask: 0xfff)                           */
/* =========================================================  DATE  ========================================================== */
#define RTC_DATE_WEEK_Pos (24UL)        /*!< WEEK (Bit 24)                                         */
#define RTC_DATE_WEEK_Msk (0x7000000UL) /*!< WEEK (Bitfield-Mask: 0x07)                            */
#define RTC_DATE_YEAR_Pos (16UL)        /*!< YEAR (Bit 16)                                         */
#define RTC_DATE_YEAR_Msk (0xff0000UL)  /*!< YEAR (Bitfield-Mask: 0xff)                            */
#define RTC_DATE_MONTH_Pos (8UL)        /*!< MONTH (Bit 8)                                         */
#define RTC_DATE_MONTH_Msk (0xff00UL)   /*!< MONTH (Bitfield-Mask: 0xff)                           */
#define RTC_DATE_DAY_Pos (0UL)          /*!< DAY (Bit 0)                                           */
#define RTC_DATE_DAY_Msk (0xffUL)       /*!< DAY (Bitfield-Mask: 0xff)                             */
/* =========================================================  TIME  ========================================================== */
#define RTC_TIME_HOUR_Pos (16UL)       /*!< HOUR (Bit 16)                                         */
#define RTC_TIME_HOUR_Msk (0x3f0000UL) /*!< HOUR (Bitfield-Mask: 0x3f)                            */
#define RTC_TIME_MINUTE_Pos (8UL)      /*!< MINUTE (Bit 8)                                        */
#define RTC_TIME_MINUTE_Msk (0x7f00UL) /*!< MINUTE (Bitfield-Mask: 0x7f)                          */
#define RTC_TIME_SECOND_Pos (0UL)      /*!< SECOND (Bit 0)                                        */
#define RTC_TIME_SECOND_Msk (0x7fUL)   /*!< SECOND (Bitfield-Mask: 0x7f)                          */
/* ========================================================  ALARMA  ========================================================= */
#define RTC_ALARMA_WEEK_Pos (24UL)           /*!< WEEK (Bit 24)                                         */
#define RTC_ALARMA_WEEK_Msk (0x7f000000UL)   /*!< WEEK (Bitfield-Mask: 0x7f)                            */
#define RTC_ALARMA_HOURMASK_Pos (23UL)       /*!< HOURMASK (Bit 23)                                     */
#define RTC_ALARMA_HOURMASK_Msk (0x800000UL) /*!< HOURMASK (Bitfield-Mask: 0x01)                        */
#define RTC_ALARMA_HOUR_Pos (16UL)           /*!< HOUR (Bit 16)                                         */
#define RTC_ALARMA_HOUR_Msk (0x3f0000UL)     /*!< HOUR (Bitfield-Mask: 0x3f)                            */
#define RTC_ALARMA_MINUTEMASK_Pos (15UL)     /*!< MINUTEMASK (Bit 15)                                   */
#define RTC_ALARMA_MINUTEMASK_Msk (0x8000UL) /*!< MINUTEMASK (Bitfield-Mask: 0x01)                      */
#define RTC_ALARMA_MINUTE_Pos (8UL)          /*!< MINUTE (Bit 8)                                        */
#define RTC_ALARMA_MINUTE_Msk (0x7f00UL)     /*!< MINUTE (Bitfield-Mask: 0x7f)                          */
#define RTC_ALARMA_SECONDMASK_Pos (7UL)      /*!< SECONDMASK (Bit 7)                                    */
#define RTC_ALARMA_SECONDMASK_Msk (0x80UL)   /*!< SECONDMASK (Bitfield-Mask: 0x01)                      */
#define RTC_ALARMA_SECOND_Pos (0UL)          /*!< SECOND (Bit 0)                                        */
#define RTC_ALARMA_SECOND_Msk (0x7fUL)       /*!< SECOND (Bitfield-Mask: 0x7f)                          */
/* ========================================================  ALARMB  ========================================================= */
#define RTC_ALARMB_WEEK_Pos (24UL)         /*!< WEEK (Bit 24)                                         */
#define RTC_ALARMB_WEEK_Msk (0x7f000000UL) /*!< WEEK (Bitfield-Mask: 0x7f)                            */
#define RTC_ALARMB_HOUREN_Pos (23UL)       /*!< HOUREN (Bit 23)                                       */
#define RTC_ALARMB_HOUREN_Msk (0x800000UL) /*!< HOUREN (Bitfield-Mask: 0x01)                          */
#define RTC_ALARMB_HOUR_Pos (16UL)         /*!< HOUR (Bit 16)                                         */
#define RTC_ALARMB_HOUR_Msk (0x3f0000UL)   /*!< HOUR (Bitfield-Mask: 0x3f)                            */
#define RTC_ALARMB_MINUTEEN_Pos (15UL)     /*!< MINUTEEN (Bit 15)                                     */
#define RTC_ALARMB_MINUTEEN_Msk (0x8000UL) /*!< MINUTEEN (Bitfield-Mask: 0x01)                        */
#define RTC_ALARMB_MINUTE_Pos (8UL)        /*!< MINUTE (Bit 8)                                        */
#define RTC_ALARMB_MINUTE_Msk (0x7f00UL)   /*!< MINUTE (Bitfield-Mask: 0x7f)                          */
#define RTC_ALARMB_SECONDEN_Pos (7UL)      /*!< SECONDEN (Bit 7)                                      */
#define RTC_ALARMB_SECONDEN_Msk (0x80UL)   /*!< SECONDEN (Bitfield-Mask: 0x01)                        */
#define RTC_ALARMB_SECOND_Pos (0UL)        /*!< SECOND (Bit 0)                                        */
#define RTC_ALARMB_SECOND_Msk (0x7fUL)     /*!< SECOND (Bitfield-Mask: 0x7f)                          */
/* =======================================================  TAMPDATE  ======================================================== */
#define RTC_TAMPDATE_WEEK_Pos (13UL)      /*!< WEEK (Bit 13)                                         */
#define RTC_TAMPDATE_WEEK_Msk (0xe000UL)  /*!< WEEK (Bitfield-Mask: 0x07)                            */
#define RTC_TAMPDATE_MONTH_Pos (8UL)      /*!< MONTH (Bit 8)                                         */
#define RTC_TAMPDATE_MONTH_Msk (0x1f00UL) /*!< MONTH (Bitfield-Mask: 0x1f)                           */
#define RTC_TAMPDATE_DAY_Pos (0UL)        /*!< DAY (Bit 0)                                           */
#define RTC_TAMPDATE_DAY_Msk (0x3fUL)     /*!< DAY (Bitfield-Mask: 0x3f)                             */
/* =======================================================  TAMPTIME  ======================================================== */
#define RTC_TAMPTIME_HOUR_Pos (16UL)       /*!< HOUR (Bit 16)                                         */
#define RTC_TAMPTIME_HOUR_Msk (0x3f0000UL) /*!< HOUR (Bitfield-Mask: 0x3f)                            */
#define RTC_TAMPTIME_MINUTE_Pos (8UL)      /*!< MINUTE (Bit 8)                                        */
#define RTC_TAMPTIME_MINUTE_Msk (0x7f00UL) /*!< MINUTE (Bitfield-Mask: 0x7f)                          */
#define RTC_TAMPTIME_SECOND_Pos (0UL)      /*!< SECOND (Bit 0)                                        */
#define RTC_TAMPTIME_SECOND_Msk (0x7fUL)   /*!< SECOND (Bitfield-Mask: 0x7f)                          */
/* ========================================================  AWTARR  ======================================================== */
#define RTC_AWTARR_ARR_Pos (0UL)      /*!< ARR (Bit 0)                                           */
#define RTC_AWTARR_ARR_Msk (0xffffUL) /*!< ARR (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  IER  ========================================================== */
#define RTC_IER_INTERVAL_Pos (6UL)    /*!< INTERVAL (Bit 6)                                      */
#define RTC_IER_INTERVAL_Msk (0x40UL) /*!< INTERVAL (Bitfield-Mask: 0x01)                        */
#define RTC_IER_TAMPOV_Pos (4UL)      /*!< TAMPOV (Bit 4)                                        */
#define RTC_IER_TAMPOV_Msk (0x10UL)   /*!< TAMPOV (Bitfield-Mask: 0x01)                          */
#define RTC_IER_TAMP_Pos (3UL)        /*!< TAMP (Bit 3)                                          */
#define RTC_IER_TAMP_Msk (0x8UL)      /*!< TAMP (Bitfield-Mask: 0x01)                            */
#define RTC_IER_AWTIMER_Pos (2UL)     /*!< AWTIMER (Bit 2)                                       */
#define RTC_IER_AWTIMER_Msk (0x4UL)   /*!< AWTIMER (Bitfield-Mask: 0x01)                         */
#define RTC_IER_ALARMB_Pos (1UL)      /*!< ALARMB (Bit 1)                                        */
#define RTC_IER_ALARMB_Msk (0x2UL)    /*!< ALARMB (Bitfield-Mask: 0x01)                          */
#define RTC_IER_ALARMA_Pos (0UL)      /*!< ALARMA (Bit 0)                                        */
#define RTC_IER_ALARMA_Msk (0x1UL)    /*!< ALARMA (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ISR  ========================================================== */
#define RTC_ISR_INTERVAL_Pos (6UL)    /*!< INTERVAL (Bit 6)                                      */
#define RTC_ISR_INTERVAL_Msk (0x40UL) /*!< INTERVAL (Bitfield-Mask: 0x01)                        */
#define RTC_ISR_TAMPOV_Pos (4UL)      /*!< TAMPOV (Bit 4)                                        */
#define RTC_ISR_TAMPOV_Msk (0x10UL)   /*!< TAMPOV (Bitfield-Mask: 0x01)                          */
#define RTC_ISR_TAMP_Pos (3UL)        /*!< TAMP (Bit 3)                                          */
#define RTC_ISR_TAMP_Msk (0x8UL)      /*!< TAMP (Bitfield-Mask: 0x01)                            */
#define RTC_ISR_AWTIMER_Pos (2UL)     /*!< AWTIMER (Bit 2)                                       */
#define RTC_ISR_AWTIMER_Msk (0x4UL)   /*!< AWTIMER (Bitfield-Mask: 0x01)                         */
#define RTC_ISR_ALARMB_Pos (1UL)      /*!< ALARMB (Bit 1)                                        */
#define RTC_ISR_ALARMB_Msk (0x2UL)    /*!< ALARMB (Bitfield-Mask: 0x01)                          */
#define RTC_ISR_ALARMA_Pos (0UL)      /*!< ALARMA (Bit 0)                                        */
#define RTC_ISR_ALARMA_Msk (0x1UL)    /*!< ALARMA (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ICR  ========================================================== */
#define RTC_ICR_INTERVAL_Pos (6UL)    /*!< INTERVAL (Bit 6)                                      */
#define RTC_ICR_INTERVAL_Msk (0x40UL) /*!< INTERVAL (Bitfield-Mask: 0x01)                        */
#define RTC_ICR_TAMPOV_Pos (4UL)      /*!< TAMPOV (Bit 4)                                        */
#define RTC_ICR_TAMPOV_Msk (0x10UL)   /*!< TAMPOV (Bitfield-Mask: 0x01)                          */
#define RTC_ICR_TAMP_Pos (3UL)        /*!< TAMP (Bit 3)                                          */
#define RTC_ICR_TAMP_Msk (0x8UL)      /*!< TAMP (Bitfield-Mask: 0x01)                            */
#define RTC_ICR_AWTIMER_Pos (2UL)     /*!< AWTIMER (Bit 2)                                       */
#define RTC_ICR_AWTIMER_Msk (0x4UL)   /*!< AWTIMER (Bitfield-Mask: 0x01)                         */
#define RTC_ICR_ALARMB_Pos (1UL)      /*!< ALARMB (Bit 1)                                        */
#define RTC_ICR_ALARMB_Msk (0x2UL)    /*!< ALARMB (Bitfield-Mask: 0x01)                          */
#define RTC_ICR_ALARMA_Pos (0UL)      /*!< ALARMA (Bit 0)                                        */
#define RTC_ICR_ALARMA_Msk (0x1UL)    /*!< ALARMA (Bitfield-Mask: 0x01)                          */

/* =========================================================================================================================== */
/* ================                                            SPI                                            ================ */
/* =========================================================================================================================== */

