VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031.h
/* ==========================================================  CR1  ========================================================== */
#define SPIx_CR1_MISOHD_Pos (18UL)      /*!< MISOHD (Bit 18)                                      */
#define SPIx_CR1_MISOHD_Msk (0x40000UL) /*!< MISOHD (Bitfield-Mask: 0x01)                         */
#define SPIx_CR1_DMATX_Pos (17UL)       /*!< DMATX (Bit 17)                                        */
#define SPIx_CR1_DMATX_Msk (0x20000UL)  /*!< DMATX (Bitfield-Mask: 0x01)                           */
#define SPIx_CR1_DMARX_Pos (16UL)       /*!< DMARX (Bit 16)                                        */
#define SPIx_CR1_DMARX_Msk (0x10000UL)  /*!< DMARX (Bitfield-Mask: 0x01)                           */
#define SPIx_CR1_MODE_Pos (14UL)        /*!< MODE (Bit 14)                                         */
#define SPIx_CR1_MODE_Msk (0xc000UL)    /*!< MODE (Bitfield-Mask: 0x03)                            */
#define SPIx_CR1_WIDTH_Pos (10UL)       /*!< WIDTH (Bit 10)                                        */
#define SPIx_CR1_WIDTH_Msk (0x3c00UL)   /*!< WIDTH (Bitfield-Mask: 0x0f)                           */
#define SPIx_CR1_SSM_Pos (9UL)          /*!< SSM (Bit 9)                                           */
#define SPIx_CR1_SSM_Msk (0x200UL)      /*!< SSM (Bitfield-Mask: 0x01)                             */
#define SPIx_CR1_SMP_Pos (8UL)          /*!< SMP (Bit 8)                                           */
#define SPIx_CR1_SMP_Msk (0x100UL)      /*!< SMP (Bitfield-Mask: 0x01)                             */
#define SPIx_CR1_LSBF_Pos (7UL)         /*!< LSBF (Bit 7)                                          */
#define SPIx_CR1_LSBF_Msk (0x80UL)      /*!< LSBF (Bitfield-Mask: 0x01)                            */
#define SPIx_CR1_EN_Pos (6UL)           /*!< EN (Bit 6)                                            */
#define SPIx_CR1_EN_Msk (0x40UL)        /*!< EN (Bitfield-Mask: 0x01)                              */
#define SPIx_CR1_BR_Pos (3UL)           /*!< BR (Bit 3)                                            */
#define SPIx_CR1_BR_Msk (0x38UL)        /*!< BR (Bitfield-Mask: 0x07)                              */
#define SPIx_CR1_MSTR_Pos (2UL)         /*!< MSTR (Bit 2)                                          */
#define SPIx_CR1_MSTR_Msk (0x4UL)       /*!< MSTR (Bitfield-Mask: 0x01)                            */
#define SPIx_CR1_CPOL_Pos (1UL)         /*!< CPOL (Bit 1)                                          */
#define SPIx_CR1_CPOL_Msk (0x2UL)       /*!< CPOL (Bitfield-Mask: 0x01)                            */
#define SPIx_CR1_CPHA_Pos (0UL)         /*!< CPHA (Bit 0)                                          */
#define SPIx_CR1_CPHA_Msk (0x1UL)       /*!< CPHA (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CR2  ========================================================== */
#define SPIx_CR2_DOEN_Pos (0UL)   /*!< DOEN (Bit 0)                                          */
#define SPIx_CR2_DOEN_Msk (0x1UL) /*!< DOEN (Bitfield-Mask: 0x01)                            */
/* ==========================================================  SSI  ========================================================== */
#define SPIx_SSI_SSI_Pos (0UL)   /*!< SSI (Bit 0)                                           */
#define SPIx_SSI_SSI_Msk (0x1UL) /*!< SSI (Bitfield-Mask: 0x01)                             */
/* ==========================================================  IER  ========================================================== */
#define SPIx_IER_MODF_Pos (7UL)     /*!< MODF (Bit 7)                                          */
#define SPIx_IER_MODF_Msk (0x80UL)  /*!< MODF (Bitfield-Mask: 0x01)                            */
#define SPIx_IER_SSERR_Pos (6UL)    /*!< SSERR (Bit 6)                                         */
#define SPIx_IER_SSERR_Msk (0x40UL) /*!< SSERR (Bitfield-Mask: 0x01)                           */
#define SPIx_IER_OV_Pos (5UL)       /*!< OV (Bit 5)                                            */
#define SPIx_IER_OV_Msk (0x20UL)    /*!< OV (Bitfield-Mask: 0x01)                              */
#define SPIx_IER_UD_Pos (4UL)       /*!< UD (Bit 4)                                            */
#define SPIx_IER_UD_Msk (0x10UL)    /*!< UD (Bitfield-Mask: 0x01)                              */
#define SPIx_IER_SSRISE_Pos (3UL)   /*!< SSRISE (Bit 3)                                        */
#define SPIx_IER_SSRISE_Msk (0x8UL) /*!< SSRISE (Bitfield-Mask: 0x01)                          */
#define SPIx_IER_SSFALL_Pos (2UL)   /*!< SSFALL (Bit 2)                                        */
#define SPIx_IER_SSFALL_Msk (0x4UL) /*!< SSFALL (Bitfield-Mask: 0x01)                          */
#define SPIx_IER_RXNE_Pos (1UL)     /*!< RXNE (Bit 1)                                          */
#define SPIx_IER_RXNE_Msk (0x2UL)   /*!< RXNE (Bitfield-Mask: 0x01)                            */
#define SPIx_IER_TXE_Pos (0UL)      /*!< TXE (Bit 0)                                           */
#define SPIx_IER_TXE_Msk (0x1UL)    /*!< TXE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ISR  ========================================================== */
#define SPIx_ISR_SSLVL_Pos (9UL)     /*!< SSLVL (Bit 9)                                         */
#define SPIx_ISR_SSLVL_Msk (0x200UL) /*!< SSLVL (Bitfield-Mask: 0x01)                           */
#define SPIx_ISR_BUSY_Pos (8UL)      /*!< BUSY (Bit 8)                                          */
#define SPIx_ISR_BUSY_Msk (0x100UL)  /*!< BUSY (Bitfield-Mask: 0x01)                            */
#define SPIx_ISR_MODF_Pos (7UL)      /*!< MODF (Bit 7)                                          */
#define SPIx_ISR_MODF_Msk (0x80UL)   /*!< MODF (Bitfield-Mask: 0x01)                            */
#define SPIx_ISR_SSERR_Pos (6UL)     /*!< SSERR (Bit 6)                                         */
#define SPIx_ISR_SSERR_Msk (0x40UL)  /*!< SSERR (Bitfield-Mask: 0x01)                           */
#define SPIx_ISR_OV_Pos (5UL)        /*!< OV (Bit 5)                                            */
#define SPIx_ISR_OV_Msk (0x20UL)     /*!< OV (Bitfield-Mask: 0x01)                              */
#define SPIx_ISR_UD_Pos (4UL)        /*!< UD (Bit 4)                                            */
#define SPIx_ISR_UD_Msk (0x10UL)     /*!< UD (Bitfield-Mask: 0x01)                              */
#define SPIx_ISR_SSR_Pos (3UL)       /*!< SSR (Bit 3)                                           */
#define SPIx_ISR_SSR_Msk (0x8UL)     /*!< SSR (Bitfield-Mask: 0x01)                             */
#define SPIx_ISR_SSF_Pos (2UL)       /*!< SSF (Bit 2)                                           */
#define SPIx_ISR_SSF_Msk (0x4UL)     /*!< SSF (Bitfield-Mask: 0x01)                             */
#define SPIx_ISR_RXNE_Pos (1UL)      /*!< RXNE (Bit 1)                                          */
#define SPIx_ISR_RXNE_Msk (0x2UL)    /*!< RXNE (Bitfield-Mask: 0x01)                            */
#define SPIx_ISR_TXE_Pos (0UL)       /*!< TXE (Bit 0)                                           */
#define SPIx_ISR_TXE_Msk (0x1UL)     /*!< TXE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define SPIx_ICR_MODF_Pos (7UL)     /*!< MODF (Bit 7)                                          */
#define SPIx_ICR_MODF_Msk (0x80UL)  /*!< MODF (Bitfield-Mask: 0x01)                            */
#define SPIx_ICR_SSERR_Pos (6UL)    /*!< SSERR (Bit 6)                                         */
#define SPIx_ICR_SSERR_Msk (0x40UL) /*!< SSERR (Bitfield-Mask: 0x01)                           */
#define SPIx_ICR_OV_Pos (5UL)       /*!< OV (Bit 5)                                            */
#define SPIx_ICR_OV_Msk (0x20UL)    /*!< OV (Bitfield-Mask: 0x01)                              */
#define SPIx_ICR_UD_Pos (4UL)       /*!< UD (Bit 4)                                            */
#define SPIx_ICR_UD_Msk (0x10UL)    /*!< UD (Bitfield-Mask: 0x01)                              */
#define SPIx_ICR_SSR_Pos (3UL)      /*!< SSR (Bit 3)                                           */
#define SPIx_ICR_SSR_Msk (0x8UL)    /*!< SSR (Bitfield-Mask: 0x01)                             */
#define SPIx_ICR_SSF_Pos (2UL)      /*!< SSF (Bit 2)                                           */
#define SPIx_ICR_SSF_Msk (0x4UL)    /*!< SSF (Bitfield-Mask: 0x01)                             */
#define SPIx_ICR_RXNE_Pos (1UL)     /*!< RXNE (Bit 1)                                          */
#define SPIx_ICR_RXNE_Msk (0x2UL)   /*!< RXNE (Bitfield-Mask: 0x01)                            */
#define SPIx_ICR_FLUSH_Pos (0UL)    /*!< FLUSH (Bit 0)                                         */
#define SPIx_ICR_FLUSH_Msk (0x1UL)  /*!< FLUSH (Bitfield-Mask: 0x01)                           */
/* ==========================================================  DR  =========================================================== */
#define SPIx_DR_DR_Pos (0UL)      /*!< DR (Bit 0)                                            */
#define SPIx_DR_DR_Msk (0xffffUL) /*!< DR (Bitfield-Mask: 0xffff)                            */

/* =========================================================================================================================== */
/* ================                                          SYSCTRL                                          ================ */
/* =========================================================================================================================== */

