VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031.h
/* ==========================================================  CR0  ========================================================== */
#define SYSCTRL_CR0_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define SYSCTRL_CR0_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define SYSCTRL_CR0_HCLKPRS_Pos (5UL)      /*!< HCLKPRS (Bit 5)                                       */
#define SYSCTRL_CR0_HCLKPRS_Msk (0xe0UL)   /*!< HCLKPRS (Bitfield-Mask: 0x07)                         */
#define SYSCTRL_CR0_PCLKPRS_Pos (3UL)      /*!< PCLKPRS (Bit 3)                                       */
#define SYSCTRL_CR0_PCLKPRS_Msk (0x18UL)   /*!< PCLKPRS (Bitfield-Mask: 0x03)                         */
#define SYSCTRL_CR0_SYSCLK_Pos (0UL)       /*!< SYSCLK (Bit 0)                                        */
#define SYSCTRL_CR0_SYSCLK_Msk (0x7UL)     /*!< SYSCLK (Bitfield-Mask: 0x07)                          */
/* ==========================================================  CR1  ========================================================== */
#define SYSCTRL_CR1_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define SYSCTRL_CR1_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define SYSCTRL_CR1_CLKCCS_Pos (8UL)       /*!< CLKCCS (Bit 8)                                        */
#define SYSCTRL_CR1_CLKCCS_Msk (0x100UL)   /*!< CLKCCS (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_CR1_HSECCS_Pos (7UL)       /*!< HSECCS (Bit 7)                                        */
#define SYSCTRL_CR1_HSECCS_Msk (0x80UL)    /*!< HSECCS (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_CR1_LSECCS_Pos (6UL)       /*!< LSECCS (Bit 6)                                        */
#define SYSCTRL_CR1_LSECCS_Msk (0x40UL)    /*!< LSECCS (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_CR1_LSELOCK_Pos (5UL)      /*!< LSELOCK (Bit 5)                                       */
#define SYSCTRL_CR1_LSELOCK_Msk (0x20UL)   /*!< LSELOCK (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_CR1_LSEEN_Pos (4UL)        /*!< LSEEN (Bit 4)                                         */
#define SYSCTRL_CR1_LSEEN_Msk (0x10UL)     /*!< LSEEN (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_CR1_LSIEN_Pos (3UL)        /*!< LSIEN (Bit 3)                                         */
#define SYSCTRL_CR1_LSIEN_Msk (0x8UL)      /*!< LSIEN (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_CR1_HSEEN_Pos (1UL)        /*!< HSEEN (Bit 1)                                         */
#define SYSCTRL_CR1_HSEEN_Msk (0x2UL)      /*!< HSEEN (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_CR1_HSIEN_Pos (0UL)        /*!< HSIEN (Bit 0)                                         */
#define SYSCTRL_CR1_HSIEN_Msk (0x1UL)      /*!< HSIEN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CR2  ========================================================== */
#define SYSCTRL_CR2_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define SYSCTRL_CR2_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define SYSCTRL_CR2_FLASHWAIT_Pos (4UL)    /*!< FLASHWAIT (Bit 4)                                     */
#define SYSCTRL_CR2_FLASHWAIT_Msk (0x70UL) /*!< FLASHWAIT (Bitfield-Mask: 0x07)                       */
#define SYSCTRL_CR2_WAKEUPCLK_Pos (3UL)    /*!< WAKEUPCLK (Bit 3)                                     */
#define SYSCTRL_CR2_WAKEUPCLK_Msk (0x8UL)  /*!< WAKEUPCLK (Bitfield-Mask: 0x01)                       */
#define SYSCTRL_CR2_LOCKUP_Pos (2UL)       /*!< LOCKUP (Bit 2)                                        */
#define SYSCTRL_CR2_LOCKUP_Msk (0x4UL)     /*!< LOCKUP (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_CR2_SWDIO_Pos (1UL)        /*!< SWDIO (Bit 1)                                         */
#define SYSCTRL_CR2_SWDIO_Msk (0x2UL)      /*!< SWDIO (Bitfield-Mask: 0x01)                           */
/* ==========================================================  HSI  ========================================================== */
#define SYSCTRL_HSI_STABLE_Pos (15UL)     /*!< STABLE (Bit 15)                                       */
#define SYSCTRL_HSI_STABLE_Msk (0x8000UL) /*!< STABLE (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_HSI_DIV_Pos (11UL)        /*!< DIV (Bit 11)                                          */
#define SYSCTRL_HSI_DIV_Msk (0x7800UL)    /*!< DIV (Bitfield-Mask: 0x0f)                             */
#define SYSCTRL_HSI_TRIM_Pos (0UL)        /*!< TRIM (Bit 0)                                          */
#define SYSCTRL_HSI_TRIM_Msk (0x7ffUL)    /*!< TRIM (Bitfield-Mask: 0x7ff)                           */
/* ==========================================================  LSI  ========================================================== */
#define SYSCTRL_LSI_STABLE_Pos (15UL)       /*!< STABLE (Bit 15)                                       */
#define SYSCTRL_LSI_STABLE_Msk (0x8000UL)   /*!< STABLE (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_LSI_WAITCYCLE_Pos (10UL)    /*!< WAITCYCLE (Bit 10)                                    */
#define SYSCTRL_LSI_WAITCYCLE_Msk (0xc00UL) /*!< WAITCYCLE (Bitfield-Mask: 0x03)                       */
#define SYSCTRL_LSI_TRIM_Pos (0UL)          /*!< TRIM (Bit 0)                                          */
#define SYSCTRL_LSI_TRIM_Msk (0x3ffUL)      /*!< TRIM (Bitfield-Mask: 0x3ff)                           */
/* ==========================================================  HSE  ========================================================== */
#define SYSCTRL_HSE_STABLE_Pos (19UL)      /*!< STABLE (Bit 19)                                       */
#define SYSCTRL_HSE_STABLE_Msk (0x80000UL) /*!< STABLE (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_HSE_DETCNT_Pos (8UL)       /*!< DETCNT (Bit 8)                                        */
#define SYSCTRL_HSE_DETCNT_Msk (0x7ff00UL) /*!< DETCNT (Bitfield-Mask: 0x7ff)                         */
#define SYSCTRL_HSE_FLT_Pos (7UL)          /*!< FLT (Bit 7)                                           */
#define SYSCTRL_HSE_FLT_Msk (0x80UL)       /*!< FLT (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_HSE_MODE_Pos (6UL)         /*!< MODE (Bit 6)                                          */
#define SYSCTRL_HSE_MODE_Msk (0x40UL)      /*!< MODE (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_HSE_WAITCYCLE_Pos (4UL)    /*!< WAITCYCLE (Bit 4)                                     */
#define SYSCTRL_HSE_WAITCYCLE_Msk (0x30UL) /*!< WAITCYCLE (Bitfield-Mask: 0x03)                       */
#define SYSCTRL_HSE_FREQRANGE_Pos (2UL)    /*!< FREQRANGE (Bit 2)                                     */
#define SYSCTRL_HSE_FREQRANGE_Msk (0xcUL)  /*!< FREQRANGE (Bitfield-Mask: 0x03)                       */
#define SYSCTRL_HSE_DRIVER_Pos (0UL)       /*!< DRIVER (Bit 0)                                        */
#define SYSCTRL_HSE_DRIVER_Msk (0x3UL)     /*!< DRIVER (Bitfield-Mask: 0x03)                          */
/* ==========================================================  LSE  ========================================================== */
#define SYSCTRL_LSE_STABLE_Pos (15UL)      /*!< STABLE (Bit 15)                                       */
#define SYSCTRL_LSE_STABLE_Msk (0x8000UL)  /*!< STABLE (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_LSE_MODE_Pos (6UL)         /*!< MODE (Bit 6)                                          */
#define SYSCTRL_LSE_MODE_Msk (0x40UL)      /*!< MODE (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_LSE_WAITCYCLE_Pos (4UL)    /*!< WAITCYCLE (Bit 4)                                     */
#define SYSCTRL_LSE_WAITCYCLE_Msk (0x30UL) /*!< WAITCYCLE (Bitfield-Mask: 0x03)                       */
#define SYSCTRL_LSE_AMP_Pos (2UL)          /*!< AMP (Bit 2)                                           */
#define SYSCTRL_LSE_AMP_Msk (0xcUL)        /*!< AMP (Bitfield-Mask: 0x03)                             */
#define SYSCTRL_LSE_DRIVER_Pos (0UL)       /*!< DRIVER (Bit 0)                                        */
#define SYSCTRL_LSE_DRIVER_Msk (0x3UL)     /*!< DRIVER (Bitfield-Mask: 0x03)                          */
/* ==========================================================  IER  ========================================================== */
#define SYSCTRL_IER_KEY_Pos (16UL)         /*!< KEY (Bit 16)                                          */
#define SYSCTRL_IER_KEY_Msk (0xffff0000UL) /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define SYSCTRL_IER_HSEFAULT_Pos (8UL)     /*!< HSEFAULT (Bit 8)                                      */
#define SYSCTRL_IER_HSEFAULT_Msk (0x100UL) /*!< HSEFAULT (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_IER_LSEFAULT_Pos (7UL)     /*!< LSEFAULT (Bit 7)                                      */
#define SYSCTRL_IER_LSEFAULT_Msk (0x80UL)  /*!< LSEFAULT (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_IER_HSEFAIL_Pos (6UL)      /*!< HSEFAIL (Bit 6)                                       */
#define SYSCTRL_IER_HSEFAIL_Msk (0x40UL)   /*!< HSEFAIL (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_IER_LSEFAIL_Pos (5UL)      /*!< LSEFAIL (Bit 5)                                       */
#define SYSCTRL_IER_LSEFAIL_Msk (0x20UL)   /*!< LSEFAIL (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_IER_LSERDY_Pos (4UL)       /*!< LSERDY (Bit 4)                                        */
#define SYSCTRL_IER_LSERDY_Msk (0x10UL)    /*!< LSERDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_IER_LSIRDY_Pos (3UL)       /*!< LSIRDY (Bit 3)                                        */
#define SYSCTRL_IER_LSIRDY_Msk (0x8UL)     /*!< LSIRDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_IER_HSERDY_Pos (1UL)       /*!< HSERDY (Bit 1)                                        */
#define SYSCTRL_IER_HSERDY_Msk (0x2UL)     /*!< HSERDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_IER_HSIRDY_Pos (0UL)       /*!< HSIRDY (Bit 0)                                        */
#define SYSCTRL_IER_HSIRDY_Msk (0x1UL)     /*!< HSIRDY (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ISR  ========================================================== */
#define SYSCTRL_ISR_LSESTABLE_Pos (15UL)     /*!< LSESTABLE (Bit 15)                                    */
#define SYSCTRL_ISR_LSESTABLE_Msk (0x8000UL) /*!< LSESTABLE (Bitfield-Mask: 0x01)                       */
#define SYSCTRL_ISR_LSISTABLE_Pos (14UL)     /*!< LSISTABLE (Bit 14)                                    */
#define SYSCTRL_ISR_LSISTABLE_Msk (0x4000UL) /*!< LSISTABLE (Bitfield-Mask: 0x01)                       */
#define SYSCTRL_ISR_HSESTABLE_Pos (12UL)     /*!< HSESTABLE (Bit 12)                                    */
#define SYSCTRL_ISR_HSESTABLE_Msk (0x1000UL) /*!< HSESTABLE (Bitfield-Mask: 0x01)                       */
#define SYSCTRL_ISR_HSISTABLE_Pos (11UL)     /*!< HSISTABLE (Bit 11)                                    */
#define SYSCTRL_ISR_HSISTABLE_Msk (0x800UL)  /*!< HSISTABLE (Bitfield-Mask: 0x01)                       */
#define SYSCTRL_ISR_HSEFAULT_Pos (8UL)       /*!< HSEFAULT (Bit 8)                                      */
#define SYSCTRL_ISR_HSEFAULT_Msk (0x100UL)   /*!< HSEFAULT (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_ISR_LSEFAULT_Pos (7UL)       /*!< LSEFAULT (Bit 7)                                      */
#define SYSCTRL_ISR_LSEFAULT_Msk (0x80UL)    /*!< LSEFAULT (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_ISR_HSEFAIL_Pos (6UL)        /*!< HSEFAIL (Bit 6)                                       */
#define SYSCTRL_ISR_HSEFAIL_Msk (0x40UL)     /*!< HSEFAIL (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_ISR_LSEFAIL_Pos (5UL)        /*!< LSEFAIL (Bit 5)                                       */
#define SYSCTRL_ISR_LSEFAIL_Msk (0x20UL)     /*!< LSEFAIL (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_ISR_LSERDY_Pos (4UL)         /*!< LSERDY (Bit 4)                                        */
#define SYSCTRL_ISR_LSERDY_Msk (0x10UL)      /*!< LSERDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_ISR_LSIRDY_Pos (3UL)         /*!< LSIRDY (Bit 3)                                        */
#define SYSCTRL_ISR_LSIRDY_Msk (0x8UL)       /*!< LSIRDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_ISR_HSERDY_Pos (1UL)         /*!< HSERDY (Bit 1)                                        */
#define SYSCTRL_ISR_HSERDY_Msk (0x2UL)       /*!< HSERDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_ISR_HSIRDY_Pos (0UL)         /*!< HSIRDY (Bit 0)                                        */
#define SYSCTRL_ISR_HSIRDY_Msk (0x1UL)       /*!< HSIRDY (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ICR  ========================================================== */
#define SYSCTRL_ICR_HSEFAULT_Pos (8UL)     /*!< HSEFAULT (Bit 8)                                      */
#define SYSCTRL_ICR_HSEFAULT_Msk (0x100UL) /*!< HSEFAULT (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_ICR_LSEFAULT_Pos (7UL)     /*!< LSEFAULT (Bit 7)                                      */
#define SYSCTRL_ICR_LSEFAULT_Msk (0x80UL)  /*!< LSEFAULT (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_ICR_HSEFAIL_Pos (6UL)      /*!< HSEFAIL (Bit 6)                                       */
#define SYSCTRL_ICR_HSEFAIL_Msk (0x40UL)   /*!< HSEFAIL (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_ICR_LSEFAIL_Pos (5UL)      /*!< LSEFAIL (Bit 5)                                       */
#define SYSCTRL_ICR_LSEFAIL_Msk (0x20UL)   /*!< LSEFAIL (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_ICR_LSERDY_Pos (4UL)       /*!< LSERDY (Bit 4)                                        */
#define SYSCTRL_ICR_LSERDY_Msk (0x10UL)    /*!< LSERDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_ICR_LSIRDY_Pos (3UL)       /*!< LSIRDY (Bit 3)                                        */
#define SYSCTRL_ICR_LSIRDY_Msk (0x8UL)     /*!< LSIRDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_ICR_HSERDY_Pos (1UL)       /*!< HSERDY (Bit 1)                                        */
#define SYSCTRL_ICR_HSERDY_Msk (0x2UL)     /*!< HSERDY (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_ICR_HSIRDY_Pos (0UL)       /*!< HSIRDY (Bit 0)                                        */
#define SYSCTRL_ICR_HSIRDY_Msk (0x1UL)     /*!< HSIRDY (Bitfield-Mask: 0x01)                          */
/* =========================================================  AHBEN  ========================================================= */
#define SYSCTRL_AHBEN_GPIOF_Pos (9UL)     /*!< GPIOF (Bit 9)                                         */
#define SYSCTRL_AHBEN_GPIOF_Msk (0x200UL) /*!< GPIOF (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBEN_GPIOC_Pos (6UL)     /*!< GPIOC (Bit 6)                                         */
#define SYSCTRL_AHBEN_GPIOC_Msk (0x40UL)  /*!< GPIOC (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBEN_GPIOB_Pos (5UL)     /*!< GPIOB (Bit 5)                                         */
#define SYSCTRL_AHBEN_GPIOB_Msk (0x20UL)  /*!< GPIOB (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBEN_GPIOA_Pos (4UL)     /*!< GPIOA (Bit 4)                                         */
#define SYSCTRL_AHBEN_GPIOA_Msk (0x10UL)  /*!< GPIOA (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBEN_CRC_Pos (2UL)       /*!< CRC (Bit 2)                                           */
#define SYSCTRL_AHBEN_CRC_Msk (0x4UL)     /*!< CRC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_AHBEN_FLASH_Pos (1UL)     /*!< FLASH (Bit 1)                                         */
#define SYSCTRL_AHBEN_FLASH_Msk (0x2UL)   /*!< FLASH (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBEN_DMA_Pos (0UL)       /*!< DMA (Bit 0)                                           */
#define SYSCTRL_AHBEN_DMA_Msk (0x1UL)     /*!< DMA (Bitfield-Mask: 0x01)                             */
/* ========================================================  APBEN1  ========================================================= */
#define SYSCTRL_APBEN1_I2C1_Pos (11UL)     /*!< I2C1 (Bit 11)                                         */
#define SYSCTRL_APBEN1_I2C1_Msk (0x800UL)  /*!< I2C1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN1_UART3_Pos (8UL)     /*!< UART3 (Bit 8)                                         */
#define SYSCTRL_APBEN1_UART3_Msk (0x100UL) /*!< UART3 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_UART2_Pos (7UL)     /*!< UART2 (Bit 7)                                         */
#define SYSCTRL_APBEN1_UART2_Msk (0x80UL)  /*!< UART2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_IWDT_Pos (5UL)      /*!< IWDT (Bit 5)                                          */
#define SYSCTRL_APBEN1_IWDT_Msk (0x20UL)   /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN1_WWDT_Pos (4UL)      /*!< WWDT (Bit 4)                                          */
#define SYSCTRL_APBEN1_WWDT_Msk (0x10UL)   /*!< WWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN1_RTC_Pos (3UL)       /*!< RTC (Bit 3)                                           */
#define SYSCTRL_APBEN1_RTC_Msk (0x8UL)     /*!< RTC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_APBEN1_GTIM2_Pos (2UL)     /*!< GTIM2 (Bit 2)                                         */
#define SYSCTRL_APBEN1_GTIM2_Msk (0x4UL)   /*!< GTIM2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_GTIM1_Pos (1UL)     /*!< GTIM1 (Bit 1)                                         */
#define SYSCTRL_APBEN1_GTIM1_Msk (0x2UL)   /*!< GTIM1 (Bitfield-Mask: 0x01)                           */
/* ========================================================  APBEN2  ========================================================= */
#define SYSCTRL_APBEN2_BOOT_Pos (15UL)     /*!< BOOT (Bit 15)                                         */
#define SYSCTRL_APBEN2_BOOT_Msk (0x8000UL) /*!< BOOT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN2_AWT_Pos (13UL)      /*!< AWT (Bit 13)                                          */
#define SYSCTRL_APBEN2_AWT_Msk (0x2000UL)  /*!< AWT (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_APBEN2_BTIM_Pos (12UL)     /*!< BTIM (Bit 12)                                         */
#define SYSCTRL_APBEN2_BTIM_Msk (0x1000UL) /*!< BTIM (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN2_UART1_Pos (9UL)     /*!< UART1 (Bit 9)                                         */
#define SYSCTRL_APBEN2_UART1_Msk (0x200UL) /*!< UART1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN2_SPI1_Pos (8UL)      /*!< SPI1 (Bit 8)                                          */
#define SYSCTRL_APBEN2_SPI1_Msk (0x100UL)  /*!< SPI1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN2_ATIM_Pos (7UL)      /*!< ATIM (Bit 7)                                          */
#define SYSCTRL_APBEN2_ATIM_Msk (0x80UL)   /*!< ATIM (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN2_VC_Pos (4UL)        /*!< VC (Bit 4)                                            */
#define SYSCTRL_APBEN2_VC_Msk (0x10UL)     /*!< VC (Bitfield-Mask: 0x01)                              */
#define SYSCTRL_APBEN2_ADC_Pos (2UL)       /*!< ADC (Bit 2)                                           */
#define SYSCTRL_APBEN2_ADC_Msk (0x4UL)     /*!< ADC (Bitfield-Mask: 0x01)                             */
/* ========================================================  AHBRST  ========================================================= */
#define SYSCTRL_AHBRST_GPIOF_Pos (9UL)     /*!< GPIOF (Bit 9)                                         */
#define SYSCTRL_AHBRST_GPIOF_Msk (0x200UL) /*!< GPIOF (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_GPIOC_Pos (6UL)     /*!< GPIOC (Bit 6)                                         */
#define SYSCTRL_AHBRST_GPIOC_Msk (0x40UL)  /*!< GPIOC (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_GPIOB_Pos (5UL)     /*!< GPIOB (Bit 5)                                         */
#define SYSCTRL_AHBRST_GPIOB_Msk (0x20UL)  /*!< GPIOB (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_GPIOA_Pos (4UL)     /*!< GPIOA (Bit 4)                                         */
#define SYSCTRL_AHBRST_GPIOA_Msk (0x10UL)  /*!< GPIOA (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_CRC_Pos (2UL)       /*!< CRC (Bit 2)                                           */
#define SYSCTRL_AHBRST_CRC_Msk (0x4UL)     /*!< CRC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_AHBRST_FLASH_Pos (1UL)     /*!< FLASH (Bit 1)                                         */
#define SYSCTRL_AHBRST_FLASH_Msk (0x2UL)   /*!< FLASH (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_DMA_Pos (0UL)       /*!< DMA (Bit 0)                                           */
#define SYSCTRL_AHBRST_DMA_Msk (0x1UL)     /*!< DMA (Bitfield-Mask: 0x01)                             */
/* ========================================================  APBRST1  ======================================================== */
#define SYSCTRL_APBRST1_I2C1_Pos (11UL)     /*!< I2C1 (Bit 11)                                         */
#define SYSCTRL_APBRST1_I2C1_Msk (0x800UL)  /*!< I2C1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_UART3_Pos (8UL)     /*!< UART3 (Bit 8)                                         */
#define SYSCTRL_APBRST1_UART3_Msk (0x100UL) /*!< UART3 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_UART2_Pos (7UL)     /*!< UART2 (Bit 7)                                         */
#define SYSCTRL_APBRST1_UART2_Msk (0x80UL)  /*!< UART2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_IWDT_Pos (5UL)      /*!< IWDT (Bit 5)                                          */
#define SYSCTRL_APBRST1_IWDT_Msk (0x20UL)   /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_WWDT_Pos (4UL)      /*!< WWDT (Bit 4)                                          */
#define SYSCTRL_APBRST1_WWDT_Msk (0x10UL)   /*!< WWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_RTC_Pos (3UL)       /*!< RTC (Bit 3)                                           */
#define SYSCTRL_APBRST1_RTC_Msk (0x8UL)     /*!< RTC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_APBRST1_GTIM2_Pos (2UL)     /*!< GTIM2 (Bit 2)                                         */
#define SYSCTRL_APBRST1_GTIM2_Msk (0x4UL)   /*!< GTIM2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_GTIM1_Pos (1UL)     /*!< GTIM1 (Bit 1)                                         */
#define SYSCTRL_APBRST1_GTIM1_Msk (0x2UL)   /*!< GTIM1 (Bitfield-Mask: 0x01)                           */
/* ========================================================  APBRST2  ======================================================== */
#define SYSCTRL_APBRST2_AWT_Pos (13UL)      /*!< AWT (Bit 13)                                          */
#define SYSCTRL_APBRST2_AWT_Msk (0x2000UL)  /*!< AWT (Bitfield-Mask: 0x01)                             */
