VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031.h
#define SYSCTRL_APBRST2_BTIM_Pos (12UL)     /*!< BTIM (Bit 12)                                         */
#define SYSCTRL_APBRST2_BTIM_Msk (0x1000UL) /*!< BTIM (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST2_UART1_Pos (9UL)     /*!< UART1 (Bit 9)                                         */
#define SYSCTRL_APBRST2_UART1_Msk (0x200UL) /*!< UART1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST2_SPI1_Pos (8UL)      /*!< SPI1 (Bit 8)                                          */
#define SYSCTRL_APBRST2_SPI1_Msk (0x100UL)  /*!< SPI1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST2_ATIM_Pos (7UL)      /*!< ATIM (Bit 7)                                          */
#define SYSCTRL_APBRST2_ATIM_Msk (0x80UL)   /*!< ATIM (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST2_VC_Pos (4UL)        /*!< VC (Bit 4)                                            */
#define SYSCTRL_APBRST2_VC_Msk (0x10UL)     /*!< VC (Bitfield-Mask: 0x01)                              */
#define SYSCTRL_APBRST2_ADC_Pos (2UL)       /*!< ADC (Bit 2)                                           */
#define SYSCTRL_APBRST2_ADC_Msk (0x4UL)     /*!< ADC (Bitfield-Mask: 0x01)                             */
/* =======================================================  RESETFLAG  ======================================================= */
#define SYSCTRL_RESETFLAG_SYSREQ_Pos (9UL)     /*!< SYSREQ (Bit 9)                                        */
#define SYSCTRL_RESETFLAG_SYSREQ_Msk (0x200UL) /*!< SYSREQ (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_RESETFLAG_LOCKUP_Pos (8UL)     /*!< LOCKUP (Bit 8)                                        */
#define SYSCTRL_RESETFLAG_LOCKUP_Msk (0x100UL) /*!< LOCKUP (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_RESETFLAG_SOFTPOR_Pos (7UL)    /*!< SOFTPOR (Bit 7)                                       */
#define SYSCTRL_RESETFLAG_SOFTPOR_Msk (0x80UL) /*!< SOFTPOR (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_RESETFLAG_RSTB_Pos (6UL)       /*!< RSTB (Bit 6)                                          */
#define SYSCTRL_RESETFLAG_RSTB_Msk (0x40UL)    /*!< RSTB (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_RESETFLAG_WWDT_Pos (5UL)       /*!< WWDT (Bit 5)                                          */
#define SYSCTRL_RESETFLAG_WWDT_Msk (0x20UL)    /*!< WWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_RESETFLAG_IWDT_Pos (4UL)       /*!< IWDT (Bit 4)                                          */
#define SYSCTRL_RESETFLAG_IWDT_Msk (0x10UL)    /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_RESETFLAG_LVD_Pos (3UL)        /*!< LVD (Bit 3)                                           */
#define SYSCTRL_RESETFLAG_LVD_Msk (0x8UL)      /*!< LVD (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_RESETFLAG_VCORE_Pos (1UL)      /*!< VCORE (Bit 1)                                         */
#define SYSCTRL_RESETFLAG_VCORE_Msk (0x2UL)    /*!< VCORE (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_RESETFLAG_POR_Pos (0UL)        /*!< POR (Bit 0)                                           */
#define SYSCTRL_RESETFLAG_POR_Msk (0x1UL)      /*!< POR (Bitfield-Mask: 0x01)                             */
/* ========================================================  DEBUGEN  ======================================================== */
#define SYSCTRL_DEBUG_WWDT_Pos (10UL)      /*!< WWDT (Bit 10)                                         */
#define SYSCTRL_DEBUG_WWDT_Msk (0x400UL)   /*!< WWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_DEBUG_IWDT_Pos (9UL)       /*!< IWDT (Bit 9)                                          */
#define SYSCTRL_DEBUG_IWDT_Msk (0x200UL)   /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_DEBUG_RTC_Pos (8UL)        /*!< RTC (Bit 8)                                           */
#define SYSCTRL_DEBUG_RTC_Msk (0x100UL)    /*!< RTC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_DEBUG_AWT_Pos (6UL)        /*!< AWT (Bit 6)                                           */
#define SYSCTRL_DEBUG_AWT_Msk (0x40UL)     /*!< AWT (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_DEBUG_BTIM123_Pos (5UL)    /*!< BTIM123 (Bit 5)                                       */
#define SYSCTRL_DEBUG_BTIM123_Msk (0x20UL) /*!< BTIM123 (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_DEBUG_GTIM2_Pos (2UL)      /*!< GTIM2 (Bit 2)                                         */
#define SYSCTRL_DEBUG_GTIM2_Msk (0x4UL)    /*!< GTIM2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_GTIM1_Pos (1UL)      /*!< GTIM1 (Bit 1)                                         */
#define SYSCTRL_DEBUG_GTIM1_Msk (0x2UL)    /*!< GTIM1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_ATIM_Pos (0UL)       /*!< ATIM (Bit 0)                                          */
#define SYSCTRL_DEBUG_ATIM_Msk (0x1UL)     /*!< ATIM (Bitfield-Mask: 0x01)                            */
/* =======================================================  GTIM1CAP  ======================================================== */
#define SYSCTRL_GTIM1CAP_CH4_Pos (12UL)     /*!< CH4 (Bit 12)                                          */
#define SYSCTRL_GTIM1CAP_CH4_Msk (0x7000UL) /*!< CH4 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM1CAP_CH3_Pos (8UL)      /*!< CH3 (Bit 8)                                           */
#define SYSCTRL_GTIM1CAP_CH3_Msk (0x700UL)  /*!< CH3 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM1CAP_CH2_Pos (4UL)      /*!< CH2 (Bit 4)                                           */
#define SYSCTRL_GTIM1CAP_CH2_Msk (0x70UL)   /*!< CH2 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM1CAP_CH1_Pos (0UL)      /*!< CH1 (Bit 0)                                           */
#define SYSCTRL_GTIM1CAP_CH1_Msk (0x7UL)    /*!< CH1 (Bitfield-Mask: 0x07)                             */
/* =======================================================  GTIM2CAP  ======================================================== */
#define SYSCTRL_GTIM2CAP_CH4_Pos (12UL)     /*!< CH4 (Bit 12)                                          */
#define SYSCTRL_GTIM2CAP_CH4_Msk (0x7000UL) /*!< CH4 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM2CAP_CH3_Pos (8UL)      /*!< CH3 (Bit 8)                                           */
#define SYSCTRL_GTIM2CAP_CH3_Msk (0x700UL)  /*!< CH3 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM2CAP_CH2_Pos (4UL)      /*!< CH2 (Bit 4)                                           */
#define SYSCTRL_GTIM2CAP_CH2_Msk (0x70UL)   /*!< CH2 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM2CAP_CH1_Pos (0UL)      /*!< CH1 (Bit 0)                                           */
#define SYSCTRL_GTIM2CAP_CH1_Msk (0x7UL)    /*!< CH1 (Bitfield-Mask: 0x07)                             */
/* ========================================================  ATIMETR  ======================================================== */
#define SYSCTRL_ATIMETR_ATIMETR_Pos (0UL)   /*!< ATIMETR (Bit 0)                                       */
#define SYSCTRL_ATIMETR_ATIMETR_Msk (0x7UL) /*!< ATIMETR (Bitfield-Mask: 0x07)                         */
/* ========================================================  GTIMETR  ======================================================== */
#define SYSCTRL_GTIMETR_GTIM2ETR_Pos (4UL)    /*!< GTIM2ETR (Bit 4)                                      */
#define SYSCTRL_GTIMETR_GTIM2ETR_Msk (0x70UL) /*!< GTIM2ETR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_GTIMETR_GTIM1ETR_Pos (0UL)    /*!< GTIM1ETR (Bit 0)                                      */
#define SYSCTRL_GTIMETR_GTIM1ETR_Msk (0x7UL)  /*!< GTIM1ETR (Bitfield-Mask: 0x07)                        */
/* =======================================================  ATIMGATE  ======================================================== */
#define SYSCTRL_ATIMGATE_ATIMGATE_Pos (0UL)   /*!< ATIMGATE (Bit 0)                                      */
#define SYSCTRL_ATIMGATE_ATIMGATE_Msk (0x7UL) /*!< ATIMGATE (Bitfield-Mask: 0x07)                        */
/* ========================================================  TIMITR  ========================================================= */
#define SYSCTRL_TIMITR_BTIM3ITR_Pos (21UL)       /*!< BTIM3ITR (Bit 21)                                     */
#define SYSCTRL_TIMITR_BTIM3ITR_Msk (0xe00000UL) /*!< BTIM3ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_BTIM2ITR_Pos (18UL)       /*!< BTIM2ITR (Bit 18)                                     */
#define SYSCTRL_TIMITR_BTIM2ITR_Msk (0x1c0000UL) /*!< BTIM2ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_BTIM1ITR_Pos (15UL)       /*!< BTIM1ITR (Bit 15)                                     */
#define SYSCTRL_TIMITR_BTIM1ITR_Msk (0x38000UL)  /*!< BTIM1ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_GTIM2ITR_Pos (6UL)        /*!< GTIM2ITR (Bit 6)                                      */
#define SYSCTRL_TIMITR_GTIM2ITR_Msk (0x1c0UL)    /*!< GTIM2ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_GTIM1ITR_Pos (3UL)        /*!< GTIM1ITR (Bit 3)                                      */
#define SYSCTRL_TIMITR_GTIM1ITR_Msk (0x38UL)     /*!< GTIM1ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_ATIMITR_Pos (0UL)         /*!< ATIMITR (Bit 0)                                       */
#define SYSCTRL_TIMITR_ATIMITR_Msk (0x7UL)       /*!< ATIMITR (Bitfield-Mask: 0x07)                         */
/* ==========================================================  MCO  ========================================================== */
#define SYSCTRL_MCO_DIV_Pos (4UL)      /*!< DIV (Bit 4)                                           */
#define SYSCTRL_MCO_DIV_Msk (0x70UL)   /*!< DIV (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_MCO_SOURCE_Pos (0UL)   /*!< SOURCE (Bit 0)                                        */
#define SYSCTRL_MCO_SOURCE_Msk (0xfUL) /*!< SOURCE (Bitfield-Mask: 0x0f)                          */

/* =========================================================================================================================== */
/* ================                                           UART                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR1  ========================================================== */
#define UARTx_CR1_BRKLEN_Pos (12UL)     /*!< BRKLEN (Bit 12)                                       */
#define UARTx_CR1_BRKLEN_Msk (0x1000UL) /*!< BRKLEN (Bitfield-Mask: 0x01)                          */
#define UARTx_CR1_TXBRK_Pos (11UL)      /*!< TXBRK (Bit 11)                                        */
#define UARTx_CR1_TXBRK_Msk (0x800UL)   /*!< TXBRK (Bitfield-Mask: 0x01)                           */
#define UARTx_CR1_OVER_Pos (9UL)        /*!< OVER (Bit 9)                                          */
#define UARTx_CR1_OVER_Msk (0x600UL)    /*!< OVER (Bitfield-Mask: 0x03)                            */
#define UARTx_CR1_START_Pos (8UL)       /*!< START (Bit 8)                                         */
#define UARTx_CR1_START_Msk (0x100UL)   /*!< START (Bitfield-Mask: 0x01)                           */
#define UARTx_CR1_LINEN_Pos (7UL)       /*!< LINEN (Bit 7)                                         */
#define UARTx_CR1_LINEN_Msk (0x80UL)    /*!< LINEN (Bitfield-Mask: 0x01)                           */
#define UARTx_CR1_SYNC_Pos (6UL)        /*!< SYNC (Bit 6)                                          */
#define UARTx_CR1_SYNC_Msk (0x40UL)     /*!< SYNC (Bitfield-Mask: 0x01)                            */
#define UARTx_CR1_STOP_Pos (4UL)        /*!< STOP (Bit 4)                                          */
#define UARTx_CR1_STOP_Msk (0x30UL)     /*!< STOP (Bitfield-Mask: 0x03)                            */
#define UARTx_CR1_PARITY_Pos (2UL)      /*!< PARITY (Bit 2)                                        */
#define UARTx_CR1_PARITY_Msk (0xcUL)    /*!< PARITY (Bitfield-Mask: 0x03)                          */
#define UARTx_CR1_RXEN_Pos (1UL)        /*!< RXEN (Bit 1)                                          */
#define UARTx_CR1_RXEN_Msk (0x2UL)      /*!< RXEN (Bitfield-Mask: 0x01)                            */
#define UARTx_CR1_TXEN_Pos (0UL)        /*!< TXEN (Bit 0)                                          */
#define UARTx_CR1_TXEN_Msk (0x1UL)      /*!< TXEN (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CR2  ========================================================== */
#define UARTx_CR2_TIMCR_Pos (10UL)     /*!< TIMCR (Bit 10)                                        */
#define UARTx_CR2_TIMCR_Msk (0xc00UL)  /*!< TIMCR (Bitfield-Mask: 0x03)                           */
#define UARTx_CR2_SOURCE_Pos (8UL)     /*!< SOURCE (Bit 8)                                         */
#define UARTx_CR2_SOURCE_Msk (0x300UL) /*!< SOURCE (Bitfield-Mask: 0x03)                           */
#define UARTx_CR2_DMATX_Pos (7UL)      /*!< DMATX (Bit 7)                                         */
#define UARTx_CR2_DMATX_Msk (0x80UL)   /*!< DMATX (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_DMARX_Pos (6UL)      /*!< DMARX (Bit 6)                                         */
#define UARTx_CR2_DMARX_Msk (0x40UL)   /*!< DMARX (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_TXINV_Pos (5UL)      /*!< TXINV (Bit 5)                                         */
#define UARTx_CR2_TXINV_Msk (0x20UL)   /*!< TXINV (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_RXINV_Pos (4UL)      /*!< RXINV (Bit 4)                                         */
#define UARTx_CR2_RXINV_Msk (0x10UL)   /*!< RXINV (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_RTSEN_Pos (3UL)      /*!< RTSEN (Bit 3)                                         */
#define UARTx_CR2_RTSEN_Msk (0x8UL)    /*!< RTSEN (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_CTSEN_Pos (2UL)      /*!< CTSEN (Bit 2)                                         */
#define UARTx_CR2_CTSEN_Msk (0x4UL)    /*!< CTSEN (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_SIGNAL_Pos (1UL)     /*!< SIGNAL (Bit 1)                                        */
#define UARTx_CR2_SIGNAL_Msk (0x2UL)   /*!< SIGNAL (Bitfield-Mask: 0x01)                          */
#define UARTx_CR2_ADDREN_Pos (0UL)     /*!< ADDREN (Bit 0)                                        */
#define UARTx_CR2_ADDREN_Msk (0x1UL)   /*!< ADDREN (Bitfield-Mask: 0x01)                          */
/* =========================================================  BRRI  ========================================================== */
#define UARTx_BRRI_BRRI_Pos (0UL)      /*!< BRRI (Bit 0)                                          */
#define UARTx_BRRI_BRRI_Msk (0xffffUL) /*!< BRRI (Bitfield-Mask: 0xffff)                          */
/* =========================================================  BRRF  ========================================================== */
#define UARTx_BRRF_BRRF_Pos (0UL)   /*!< BRRF (Bit 0)                                          */
#define UARTx_BRRF_BRRF_Msk (0xfUL) /*!< BRRF (Bitfield-Mask: 0x0f)                            */
/* ========================================================  TIMARR  ========================================================= */
#define UARTx_TIMARR_TIMARR_Pos (0UL)        /*!< TIMARR (Bit 0)                                        */
#define UARTx_TIMARR_TIMARR_Msk (0xffffffUL) /*!< TIMARR (Bitfield-Mask: 0xffffff)                      */
/* ========================================================  TIMCNT  ========================================================= */
#define UARTx_TIMCNT_TIMCNT_Pos (0UL)        /*!< TIMCNT (Bit 0)                                        */
#define UARTx_TIMCNT_TIMCNT_Msk (0xffffffUL) /*!< TIMCNT (Bitfield-Mask: 0xffffff)                      */
/* ==========================================================  TDR  ========================================================== */
#define UARTx_TDR_TDR_Pos (0UL)     /*!< TDR (Bit 0)                                           */
#define UARTx_TDR_TDR_Msk (0x1ffUL) /*!< TDR (Bitfield-Mask: 0x1ff)                            */
/* ==========================================================  RDR  ========================================================== */
#define UARTx_RDR_RDR_Pos (0UL)     /*!< RDR (Bit 0)                                           */
#define UARTx_RDR_RDR_Msk (0x1ffUL) /*!< RDR (Bitfield-Mask: 0x1ff)                            */
/* ==========================================================  IER  ========================================================== */
#define UARTx_IER_RXBRK_Pos (11UL)    /*!< RXBRK (Bit 11)                                        */
#define UARTx_IER_RXBRK_Msk (0x800UL) /*!< RXBRK (Bitfield-Mask: 0x01)                           */
#define UARTx_IER_BAUD_Pos (10UL)     /*!< BAUD (Bit 10)                                         */
#define UARTx_IER_BAUD_Msk (0x400UL)  /*!< BAUD (Bitfield-Mask: 0x01)                            */
#define UARTx_IER_TIMOV_Pos (9UL)     /*!< TIMOV (Bit 9)                                         */
#define UARTx_IER_TIMOV_Msk (0x200UL) /*!< TIMOV (Bitfield-Mask: 0x01)                           */
#define UARTx_IER_CTS_Pos (6UL)       /*!< CTS (Bit 6)                                           */
#define UARTx_IER_CTS_Msk (0x40UL)    /*!< CTS (Bitfield-Mask: 0x01)                             */
#define UARTx_IER_PE_Pos (4UL)        /*!< PE (Bit 4)                                            */
#define UARTx_IER_PE_Msk (0x10UL)     /*!< PE (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_FE_Pos (3UL)        /*!< FE (Bit 3)                                            */
#define UARTx_IER_FE_Msk (0x8UL)      /*!< FE (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_RC_Pos (2UL)        /*!< RC (Bit 2)                                            */
#define UARTx_IER_RC_Msk (0x4UL)      /*!< RC (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_TC_Pos (1UL)        /*!< TC (Bit 1)                                            */
#define UARTx_IER_TC_Msk (0x2UL)      /*!< TC (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_TXE_Pos (0UL)       /*!< TXE (Bit 0)                                           */
#define UARTx_IER_TXE_Msk (0x1UL)     /*!< TXE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ISR  ========================================================== */
#define UARTx_ISR_RXBRK_Pos (11UL)     /*!< RXBRK (Bit 11)                                        */
#define UARTx_ISR_RXBRK_Msk (0x800UL)  /*!< RXBRK (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_BAUD_Pos (10UL)      /*!< BAUD (Bit 10)                                         */
#define UARTx_ISR_BAUD_Msk (0x400UL)   /*!< BAUD (Bitfield-Mask: 0x01)                            */
#define UARTx_ISR_TIMOV_Pos (9UL)      /*!< TIMOV (Bit 9)                                         */
#define UARTx_ISR_TIMOV_Msk (0x200UL)  /*!< TIMOV (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_TXBUSY_Pos (8UL)     /*!< TXBUSY (Bit 8)                                        */
#define UARTx_ISR_TXBUSY_Msk (0x100UL) /*!< TXBUSY (Bitfield-Mask: 0x01)                          */
#define UARTx_ISR_CTSLV_Pos (7UL)      /*!< CTSLV (Bit 7)                                         */
#define UARTx_ISR_CTSLV_Msk (0x80UL)   /*!< CTSLV (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_CTS_Pos (6UL)        /*!< CTS (Bit 6)                                           */
#define UARTx_ISR_CTS_Msk (0x40UL)     /*!< CTS (Bitfield-Mask: 0x01)                             */
#define UARTx_ISR_MATCH_Pos (5UL)      /*!< MATCH (Bit 5)                                         */
#define UARTx_ISR_MATCH_Msk (0x20UL)   /*!< MATCH (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_PE_Pos (4UL)         /*!< PE (Bit 4)                                            */
#define UARTx_ISR_PE_Msk (0x10UL)      /*!< PE (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_FE_Pos (3UL)         /*!< FE (Bit 3)                                            */
#define UARTx_ISR_FE_Msk (0x8UL)       /*!< FE (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_RC_Pos (2UL)         /*!< RC (Bit 2)                                            */
#define UARTx_ISR_RC_Msk (0x4UL)       /*!< RC (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_TC_Pos (1UL)         /*!< TC (Bit 1)                                            */
#define UARTx_ISR_TC_Msk (0x2UL)       /*!< TC (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_TXE_Pos (0UL)        /*!< TXE (Bit 0)                                           */
#define UARTx_ISR_TXE_Msk (0x1UL)      /*!< TXE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define UARTx_ICR_RXBRK_Pos (11UL)    /*!< RXBRK (Bit 11)                                        */
#define UARTx_ICR_RXBRK_Msk (0x800UL) /*!< RXBRK (Bitfield-Mask: 0x01)                           */
#define UARTx_ICR_BAUD_Pos (10UL)     /*!< BAUD (Bit 10)                                         */
#define UARTx_ICR_BAUD_Msk (0x400UL)  /*!< BAUD (Bitfield-Mask: 0x01)                            */
#define UARTx_ICR_TIMOV_Pos (9UL)     /*!< TIMOV (Bit 9)                                         */
#define UARTx_ICR_TIMOV_Msk (0x200UL) /*!< TIMOV (Bitfield-Mask: 0x01)                           */
#define UARTx_ICR_CTS_Pos (6UL)       /*!< CTS (Bit 6)                                           */
#define UARTx_ICR_CTS_Msk (0x40UL)    /*!< CTS (Bitfield-Mask: 0x01)                             */
#define UARTx_ICR_PE_Pos (4UL)        /*!< PE (Bit 4)                                            */
#define UARTx_ICR_PE_Msk (0x10UL)     /*!< PE (Bitfield-Mask: 0x01)                              */
#define UARTx_ICR_FE_Pos (3UL)        /*!< FE (Bit 3)                                            */
#define UARTx_ICR_FE_Msk (0x8UL)      /*!< FE (Bitfield-Mask: 0x01)                              */
#define UARTx_ICR_RC_Pos (2UL)        /*!< RC (Bit 2)                                            */
#define UARTx_ICR_RC_Msk (0x4UL)      /*!< RC (Bitfield-Mask: 0x01)                              */
#define UARTx_ICR_TC_Pos (1UL)        /*!< TC (Bit 1)                                            */
#define UARTx_ICR_TC_Msk (0x2UL)      /*!< TC (Bitfield-Mask: 0x01)                              */
/* =========================================================  ADDR  ========================================================== */
#define UARTx_ADDR_ADDR_Pos (0UL)    /*!< ADDR (Bit 0)                                          */
#define UARTx_ADDR_ADDR_Msk (0xffUL) /*!< ADDR (Bitfield-Mask: 0xff)                            */
/* =========================================================  MASK  ========================================================== */
#define UARTx_MASK_MASK_Pos (0UL)    /*!< MASK (Bit 0)                                          */
#define UARTx_MASK_MASK_Msk (0xffUL) /*!< MASK (Bitfield-Mask: 0xff)                            */

