VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031.h
/* =========================================================================================================================== */
/* ================                                            VC                                             ================ */
/* =========================================================================================================================== */

/* ==========================================================  DIV  ========================================================== */
#define VCx_DIV_VIN_Pos (7UL)    /*!< VIN (Bit 7)                                           */
#define VCx_DIV_VIN_Msk (0x80UL) /*!< VIN (Bitfield-Mask: 0x01)                             */
#define VCx_DIV_EN_Pos (6UL)     /*!< EN (Bit 6)                                            */
#define VCx_DIV_EN_Msk (0x40UL)  /*!< EN (Bitfield-Mask: 0x01)                              */
#define VCx_DIV_DIV_Pos (0UL)    /*!< DIV (Bit 0)                                           */
#define VCx_DIV_DIV_Msk (0x3fUL) /*!< DIV (Bitfield-Mask: 0x3f)                             */
/* ==========================================================  CR0  ========================================================== */
#define VCx_CR0_INN_Pos (12UL)      /*!< INN (Bit 12)                                          */
#define VCx_CR0_INN_Msk (0xf000UL)  /*!< INN (Bitfield-Mask: 0x0f)                             */
#define VCx_CR0_INP_Pos (8UL)       /*!< INP (Bit 8)                                           */
#define VCx_CR0_INP_Msk (0xf00UL)   /*!< INP (Bitfield-Mask: 0x0f)                             */
#define VCx_CR0_WINDOW_Pos (7UL)    /*!< WINDOW (Bit 7)                                        */
#define VCx_CR0_WINDOW_Msk (0x80UL) /*!< WINDOW (Bitfield-Mask: 0x01)                          */
#define VCx_CR0_POL_Pos (6UL)       /*!< POL (Bit 6)                                           */
#define VCx_CR0_POL_Msk (0x40UL)    /*!< POL (Bitfield-Mask: 0x01)                             */
#define VCx_CR0_IE_Pos (5UL)        /*!< IE (Bit 5)                                            */
#define VCx_CR0_IE_Msk (0x20UL)     /*!< IE (Bitfield-Mask: 0x01)                              */
#define VCx_CR0_HYS_Pos (3UL)       /*!< HYS (Bit 3)                                           */
#define VCx_CR0_HYS_Msk (0x18UL)    /*!< HYS (Bitfield-Mask: 0x03)                             */
#define VCx_CR0_RESP_Pos (1UL)      /*!< RESP (Bit 1)                                          */
#define VCx_CR0_RESP_Msk (0x6UL)    /*!< RESP (Bitfield-Mask: 0x03)                            */
#define VCx_CR0_EN_Pos (0UL)        /*!< EN (Bit 0)                                            */
#define VCx_CR0_EN_Msk (0x1UL)      /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CR1  ========================================================== */
#define VCx_CR1_BLANKFLT_Pos (13UL)      /*!< BLANKFLT (Bit 13)                                     */
#define VCx_CR1_BLANKFLT_Msk (0xe000UL)  /*!< BLANKFLT (Bitfield-Mask: 0x07)                        */
#define VCx_CR1_BLANKCH3B_Pos (12UL)     /*!< BLANKCH3B (Bit 12)                                    */
#define VCx_CR1_BLANKCH3B_Msk (0x1000UL) /*!< BLANKCH3B (Bitfield-Mask: 0x01)                       */
#define VCx_CR1_BLANKCH2B_Pos (11UL)     /*!< BLANKCH2B (Bit 11)                                    */
#define VCx_CR1_BLANKCH2B_Msk (0x800UL)  /*!< BLANKCH2B (Bitfield-Mask: 0x01)                       */
#define VCx_CR1_BLANKCH1B_Pos (10UL)     /*!< BLANKCH1B (Bit 10)                                    */
#define VCx_CR1_BLANKCH1B_Msk (0x400UL)  /*!< BLANKCH1B (Bitfield-Mask: 0x01)                       */
#define VCx_CR1_ATIMBK_Pos (9UL)         /*!< ATIMBK (Bit 9)                                        */
#define VCx_CR1_ATIMBK_Msk (0x200UL)     /*!< ATIMBK (Bitfield-Mask: 0x01)                          */
#define VCx_CR1_ATIMCLR_Pos (8UL)        /*!< ATIMCLR (Bit 8)                                       */
#define VCx_CR1_ATIMCLR_Msk (0x100UL)    /*!< ATIMCLR (Bitfield-Mask: 0x01)                         */
#define VCx_CR1_HIGHIE_Pos (7UL)         /*!< HIGHIE (Bit 7)                                        */
#define VCx_CR1_HIGHIE_Msk (0x80UL)      /*!< HIGHIE (Bitfield-Mask: 0x01)                          */
#define VCx_CR1_RISEIE_Pos (6UL)         /*!< RISEIE (Bit 6)                                        */
#define VCx_CR1_RISEIE_Msk (0x40UL)      /*!< RISEIE (Bitfield-Mask: 0x01)                          */
#define VCx_CR1_FALLIE_Pos (5UL)         /*!< FALLIE (Bit 5)                                        */
#define VCx_CR1_FALLIE_Msk (0x20UL)      /*!< FALLIE (Bitfield-Mask: 0x01)                          */
#define VCx_CR1_FLTCLK_Pos (4UL)         /*!< FLTCLK (Bit 4)                                        */
#define VCx_CR1_FLTCLK_Msk (0x10UL)      /*!< FLTCLK (Bitfield-Mask: 0x01)                          */
#define VCx_CR1_FLTTIME_Pos (1UL)        /*!< FLTTIME (Bit 1)                                       */
#define VCx_CR1_FLTTIME_Msk (0xeUL)      /*!< FLTTIME (Bitfield-Mask: 0x07)                         */
#define VCx_CR1_FLTEN_Pos (0UL)          /*!< FLTEN (Bit 0)                                         */
#define VCx_CR1_FLTEN_Msk (0x1UL)        /*!< FLTEN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  SR  =========================================================== */
#define VCx_SR_READY_Pos (2UL)   /*!< READY (Bit 2)                                         */
#define VCx_SR_READY_Msk (0x4UL) /*!< READY (Bitfield-Mask: 0x01)                           */
#define VCx_SR_FLTV_Pos (1UL)    /*!< FLTV (Bit 1)                                          */
#define VCx_SR_FLTV_Msk (0x2UL)  /*!< FLTV (Bitfield-Mask: 0x01)                            */
#define VCx_SR_INTF_Pos (0UL)    /*!< INTF (Bit 0)                                          */
#define VCx_SR_INTF_Msk (0x1UL)  /*!< INTF (Bitfield-Mask: 0x01)                            */

/* =========================================================================================================================== */
/* ================                                           WWDT                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR0  ========================================================== */
#define WWDT_CR0_EN_Pos (7UL)      /*!< EN (Bit 7)                                            */
#define WWDT_CR0_EN_Msk (0x80UL)   /*!< EN (Bitfield-Mask: 0x01)                              */
#define WWDT_CR0_WCNT_Pos (0UL)    /*!< WCNT (Bit 0)                                          */
#define WWDT_CR0_WCNT_Msk (0x7fUL) /*!< WCNT (Bitfield-Mask: 0x7f)                            */
/* ==========================================================  CR1  ========================================================== */
#define WWDT_CR1_IE_Pos (10UL)     /*!< IE (Bit 10)                                           */
#define WWDT_CR1_IE_Msk (0x400UL)  /*!< IE (Bitfield-Mask: 0x01)                              */
#define WWDT_CR1_PRS_Pos (7UL)     /*!< PRS (Bit 7)                                           */
#define WWDT_CR1_PRS_Msk (0x380UL) /*!< PRS (Bitfield-Mask: 0x07)                             */
#define WWDT_CR1_WINR_Pos (0UL)    /*!< WINR (Bit 0)                                          */
#define WWDT_CR1_WINR_Msk (0x7fUL) /*!< WINR (Bitfield-Mask: 0x7f)                            */
/* ==========================================================  SR  =========================================================== */
#define WWDT_SR_POV_Pos (0UL)   /*!< POV (Bit 0)                                           */
#define WWDT_SR_POV_Msk (0x1UL) /*!< POV (Bitfield-Mask: 0x01)                             */

  /** @} */ /* End of group PosMask_peripherals */

#ifdef __cplusplus
}
#endif

#endif /* __CW32W031_H */

/** @} */ /* End of group cw32w031 */

/** @} */ /* End of group CW Co.Ltd */
